<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Function id="_497" name="__builtin_cargf" returns="_533" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_548" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_498" name="__builtin_cargl" returns="_534" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_549" location="f0:95" file="f0" line="95"/>
  </Function>
  <FundamentalType id="_499" name="unsigned char" size="8" align="8"/>
  <Typedef id="_500" name="SPIKE_COUNT_DATA_TYPE" type="_499" context="_1" location="f5:24" file="f5" line="24"/>
  <Variable id="_501" name="cpp_sym_MAX_SPIKE_SOURCES" type="_531c" init="3" context="_1" location="f1:257" file="f1" line="257" static="1"/>
  <Function id="_502" name="__builtin_cosf" returns="_533" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_533" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_503" name="__builtin_cosh" returns="_449" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_449" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_504" name="__builtin_cosl" returns="_534" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_534" location="f0:44" file="f0" line="44"/>
  </Function>
  <Variable id="_505" name="cpp_sym_MT_COMMANDSPACE_FEEDBACK" type="_531c" init="1703" context="_1" location="f1:218" file="f1" line="218" static="1"/>
  <Variable id="_506" name="cpp_sym_MT_SPM_SPIKE_TIMES" type="_531c" init="2171" context="_1" location="f1:110" file="f1" line="110" static="1"/>
  <Variable id="_507" name="cpp_sym_MT_NOOP" type="_531c" init="998" context="_1" location="f1:240" file="f1" line="240" static="1"/>
  <Variable id="_508" name="cpp_sym_MID_OPTOTRAK" type="_531c" init="74" context="_1" location="f1:101" file="f1" line="101" static="1"/>
  <Variable id="_509" name="cpp_sym_SAMPLE_DT" type="_449c" init="2.99999999999999988897769753748434595763683319091796875e-2" context="_1" location="f1:90" file="f1" line="90" static="1"/>
  <Variable id="_510" name="cpp_sym_MAX_GROBOT_FEEDBACK_DIMS" type="_531c" init="18" context="_1" location="f1:252" file="f1" line="252" static="1"/>
  <Variable id="_511" name="cpp_sym_MID_WATCHDOG" type="_531c" init="97" context="_1" location="f1:234" file="f1" line="234" static="1"/>
  <Variable id="_512" name="cpp_sym_MT_KEYBOARD" type="_531c" init="1002" context="_1" location="f1:203" file="f1" line="203" static="1"/>
  <Variable id="_513" name="cpp_sym_MAX_FINGER_DIMS" type="_531c" init="10" context="_1" location="f1:148" file="f1" line="148" static="1"/>
  <Function id="_514" name="__builtin_isgreater" returns="_535" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Variable id="_515" name="cpp_sym_MID_IO_MOD" type="_531c" init="60" context="_1" location="f1:61" file="f1" line="61" static="1"/>
  <Variable id="_516" name="cpp_sym_MT_TRIAL_STATUS" type="_531c" init="102" context="_1" location="f1:35" file="f1" line="35" static="1"/>
  <Variable id="_517" name="cpp_sym_MT_CERESTIM_CONFIG_CHAN" type="_531c" init="1890" context="_1" location="f1:217" file="f1" line="217" static="1"/>
  <Variable id="_518" name="cpp_sym_MID_VIRTUAL_FIXTURING" type="_531c" init="28" context="_1" location="f1:97" file="f1" line="97" static="1"/>
  <Variable id="_519" name="cpp_sym_MT_EM_MOVEMENT_COMMAND" type="_531c" init="350" context="_1" location="f1:2" file="f1" line="2" static="1"/>
  <Variable id="_520" name="cpp_sym_MT_IDLE_DETECTION_ENDED" type="_531c" init="2251" context="_1" location="f1:244" file="f1" line="244" static="1"/>
  <Function id="_521" name="__builtin_sinf" returns="_533" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_533" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_522" name="__builtin_sinh" returns="_449" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_449" location="f0:77" file="f0" line="77"/>
  </Function>
  <Variable id="_523" name="cpp_sym_NUM_D_COLS" type="_531c" init="16" context="_1" location="f1:204" file="f1" line="204" static="1"/>
  <Function id="_524" name="__builtin_sinl" returns="_534" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_534" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_525" name="__builtin_csin" returns="_568" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_568" location="f0:115" file="f0" line="115"/>
  </Function>
  <Variable id="_526" name="cpp_sym_MID_PS3_MODULE" type="_531c" init="92" context="_1" location="f1:262" file="f1" line="262" static="1"/>
  <Variable id="_527" name="cpp_sym_MT_DENSO_CONFIG" type="_531c" init="800" context="_1" location="f1:144" file="f1" line="144" static="1"/>
  <Variable id="_528" name="cpp_sym_MT_FSR_DATA" type="_531c" init="2421" context="_1" location="f1:140" file="f1" line="140" static="1"/>
  <Variable id="_529" name="cpp_sym_MT_PING" type="_531c" init="2140" context="_1" location="f1:157" file="f1" line="157" static="1"/>
  <PointerType id="_530" type="_547c" size="64" align="64"/>
  <FundamentalType id="_531" name="int" size="32" align="32"/>
  <CvQualifiedType id="_531c" type="_531" const="1"/>
  <FundamentalType id="_533" name="float" size="32" align="32"/>
  <FundamentalType id="_534" name="long double" size="128" align="128"/>
  <FundamentalType id="_535" name="bool" size="8" align="8"/>
  <FundamentalType id="_536" name="long long int" size="64" align="64"/>
  <Field id="_537" name="sample_header" type="_187" offset="0" context="_14" access="public" location="f2:46" file="f2" line="46"/>
  <Field id="_538" name="sample_interval" type="_449" offset="128" context="_14" access="public" location="f2:47" file="f2" line="47"/>
  <Field id="_539" name="pos" type="_1203" offset="192" context="_14" access="public" location="f2:48" file="f2" line="48"/>
  <Field id="_540" name="vel" type="_1203" offset="1344" context="_14" access="public" location="f2:49" file="f2" line="49"/>
  <Field id="_541" name="controlledDims" type="_1204" offset="2496" context="_14" access="public" location="f2:50" file="f2" line="50"/>
  <Field id="_542" name="tag" type="_1205" offset="3072" context="_14" access="public" location="f2:51" file="f2" line="51"/>
  <Destructor id="_543" name="._1" artificial="1" throw="" context="_14" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAD1Ev *INTERNAL* " demangled="MOVEMENT_COMMAND_DATA::~MOVEMENT_COMMAND_DATA()" location="f2:52" file="f2" line="52" endline="52" inline="1">
  </Destructor>
  <OperatorMethod id="_544" name="=" returns="_1206" artificial="1" throw="" context="_14" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAaSERKS_" demangled="MOVEMENT_COMMAND_DATA::operator=(MOVEMENT_COMMAND_DATA const&amp;)" location="f2:52" file="f2" line="52" endline="52" inline="1">
    <Argument type="_1207" location="f2:45" file="f2" line="45"/>
  </OperatorMethod>
  <Constructor id="_545" name="._1" artificial="1" throw="" context="_14" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAC1ERKS_ *INTERNAL* " demangled="MOVEMENT_COMMAND_DATA::MOVEMENT_COMMAND_DATA(MOVEMENT_COMMAND_DATA const&amp;)" location="f2:52" file="f2" line="52" endline="52" inline="1">
    <Argument type="_1207" location="f2:45" file="f2" line="45"/>
  </Constructor>
  <Constructor id="_546" name="._1" artificial="1" throw="" context="_14" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAC1Ev *INTERNAL* " demangled="MOVEMENT_COMMAND_DATA::MOVEMENT_COMMAND_DATA()" location="f2:52" file="f2" line="52" inline="1"/>
  <FundamentalType id="_547" name="char" size="8" align="8"/>
  <FundamentalType id="_548" name="complex float" size="64" align="32"/>
  <FundamentalType id="_549" name="complex long double" size="256" align="128"/>
  <Field id="_550" name="sample_header" type="_187" offset="0" context="_28" access="public" location="f5:32" file="f5" line="32"/>
  <Field id="_551" name="source_timestamp" type="_449" offset="128" context="_28" access="public" location="f5:33" file="f5" line="33"/>
  <Destructor id="_552" name="._15" artificial="1" throw="" context="_28" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDD1Ev *INTERNAL* " demangled="MDF_SAMPLE_GENERATED::~MDF_SAMPLE_GENERATED()" location="f5:34" file="f5" line="34" endline="34" inline="1">
  </Destructor>
  <OperatorMethod id="_553" name="=" returns="_1208" artificial="1" throw="" context="_28" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDaSERKS_" demangled="MDF_SAMPLE_GENERATED::operator=(MDF_SAMPLE_GENERATED const&amp;)" location="f5:34" file="f5" line="34" endline="34" inline="1">
    <Argument type="_1209" location="f5:31" file="f5" line="31"/>
  </OperatorMethod>
  <Constructor id="_554" name="._15" artificial="1" throw="" context="_28" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDC1ERKS_ *INTERNAL* " demangled="MDF_SAMPLE_GENERATED::MDF_SAMPLE_GENERATED(MDF_SAMPLE_GENERATED const&amp;)" location="f5:34" file="f5" line="34" endline="34" inline="1">
    <Argument type="_1209" location="f5:31" file="f5" line="31"/>
  </Constructor>
  <Constructor id="_555" name="._15" artificial="1" throw="" context="_28" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDC1Ev *INTERNAL* " demangled="MDF_SAMPLE_GENERATED::MDF_SAMPLE_GENERATED()" location="f5:34" file="f5" line="34" inline="1"/>
  <Field id="_556" name="movement_id" type="_531" offset="0" context="_37" access="public" location="f4:218" file="f4" line="218"/>
  <Field id="_557" name="reserved" type="_531" offset="32" context="_37" access="public" location="f4:219" file="f4" line="219"/>
  <Destructor id="_558" name="._80" artificial="1" throw="" context="_37" access="public" mangled="_ZN27RESPONSE_DATA_TO_DENSO_MOVED1Ev *INTERNAL* " demangled="RESPONSE_DATA_TO_DENSO_MOVE::~RESPONSE_DATA_TO_DENSO_MOVE()" location="f4:220" file="f4" line="220" endline="220" inline="1">
  </Destructor>
  <OperatorMethod id="_559" name="=" returns="_1210" artificial="1" throw="" context="_37" access="public" mangled="_ZN27RESPONSE_DATA_TO_DENSO_MOVEaSERKS_" demangled="RESPONSE_DATA_TO_DENSO_MOVE::operator=(RESPONSE_DATA_TO_DENSO_MOVE const&amp;)" location="f4:220" file="f4" line="220" endline="220" inline="1">
    <Argument type="_1211" location="f4:217" file="f4" line="217"/>
  </OperatorMethod>
  <Constructor id="_560" name="._80" artificial="1" throw="" context="_37" access="public" mangled="_ZN27RESPONSE_DATA_TO_DENSO_MOVEC1ERKS_ *INTERNAL* " demangled="RESPONSE_DATA_TO_DENSO_MOVE::RESPONSE_DATA_TO_DENSO_MOVE(RESPONSE_DATA_TO_DENSO_MOVE const&amp;)" location="f4:220" file="f4" line="220" endline="220" inline="1">
    <Argument type="_1211" location="f4:217" file="f4" line="217"/>
  </Constructor>
  <Constructor id="_561" name="._80" artificial="1" throw="" context="_37" access="public" mangled="_ZN27RESPONSE_DATA_TO_DENSO_MOVEC1Ev *INTERNAL* " demangled="RESPONSE_DATA_TO_DENSO_MOVE::RESPONSE_DATA_TO_DENSO_MOVE()" location="f4:220" file="f4" line="220" inline="1"/>
  <Field id="_562" name="id" type="_531" offset="0" context="_50" access="public" location="f3:469" file="f3" line="469"/>
  <Field id="_563" name="reserved" type="_531" offset="32" context="_50" access="public" location="f3:470" file="f3" line="470"/>
  <Destructor id="_564" name="._52" artificial="1" throw="" context="_50" access="public" mangled="_ZN14MDF_PLAY_SOUNDD1Ev *INTERNAL* " demangled="MDF_PLAY_SOUND::~MDF_PLAY_SOUND()" location="f3:471" file="f3" line="471" endline="471" inline="1">
  </Destructor>
  <OperatorMethod id="_565" name="=" returns="_1212" artificial="1" throw="" context="_50" access="public" mangled="_ZN14MDF_PLAY_SOUNDaSERKS_" demangled="MDF_PLAY_SOUND::operator=(MDF_PLAY_SOUND const&amp;)" location="f3:471" file="f3" line="471" endline="471" inline="1">
    <Argument type="_1213" location="f3:468" file="f3" line="468"/>
  </OperatorMethod>
  <Constructor id="_566" name="._52" artificial="1" throw="" context="_50" access="public" mangled="_ZN14MDF_PLAY_SOUNDC1ERKS_ *INTERNAL* " demangled="MDF_PLAY_SOUND::MDF_PLAY_SOUND(MDF_PLAY_SOUND const&amp;)" location="f3:471" file="f3" line="471" endline="471" inline="1">
    <Argument type="_1213" location="f3:468" file="f3" line="468"/>
  </Constructor>
  <Constructor id="_567" name="._52" artificial="1" throw="" context="_50" access="public" mangled="_ZN14MDF_PLAY_SOUNDC1Ev *INTERNAL* " demangled="MDF_PLAY_SOUND::MDF_PLAY_SOUND()" location="f3:471" file="f3" line="471" inline="1"/>
  <FundamentalType id="_568" name="complex double" size="128" align="64"/>
  <Field id="_569" name="sample_header" type="_187" offset="0" context="_69" access="public" location="f2:122" file="f2" line="122"/>
  <Field id="_570" name="RTMA_received_time" type="_449" offset="128" context="_69" access="public" location="f2:123" file="f2" line="123"/>
  <Field id="_571" name="pos" type="_1203" offset="192" context="_69" access="public" location="f2:124" file="f2" line="124"/>
  <Field id="_572" name="vel" type="_1203" offset="1344" context="_69" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_573" name="CoriMatrix" type="_1214" offset="2496" context="_69" access="public" location="f2:126" file="f2" line="126"/>
  <Destructor id="_574" name="._8" artificial="1" throw="" context="_69" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATED1Ev *INTERNAL* " demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::~ROBOT_CONTROL_SPACE_ACTUAL_STATE()" location="f2:127" file="f2" line="127" endline="127" inline="1">
  </Destructor>
  <OperatorMethod id="_575" name="=" returns="_1215" artificial="1" throw="" context="_69" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATEaSERKS_" demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::operator=(ROBOT_CONTROL_SPACE_ACTUAL_STATE const&amp;)" location="f2:127" file="f2" line="127" endline="127" inline="1">
    <Argument type="_1216" location="f2:121" file="f2" line="121"/>
  </OperatorMethod>
  <Constructor id="_576" name="._8" artificial="1" throw="" context="_69" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATEC1ERKS_ *INTERNAL* " demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::ROBOT_CONTROL_SPACE_ACTUAL_STATE(ROBOT_CONTROL_SPACE_ACTUAL_STATE const&amp;)" location="f2:127" file="f2" line="127" endline="127" inline="1">
    <Argument type="_1216" location="f2:121" file="f2" line="121"/>
  </Constructor>
  <Constructor id="_577" name="._8" artificial="1" throw="" context="_69" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATEC1Ev *INTERNAL* " demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::ROBOT_CONTROL_SPACE_ACTUAL_STATE()" location="f2:127" file="f2" line="127" inline="1"/>
  <Field id="_578" name="time" type="_1217" offset="0" context="_86" access="public" location="f3:444" file="f3" line="444"/>
  <Field id="_579" name="chan" type="_1218" offset="16384" context="_86" access="public" location="f3:445" file="f3" line="445"/>
  <Field id="_580" name="unit" type="_1219" offset="20480" context="_86" access="public" location="f3:446" file="f3" line="446"/>
  <Field id="_581" name="box_id" type="_1219" offset="22528" context="_86" access="public" location="f3:447" file="f3" line="447"/>
  <Destructor id="_582" name="._49" artificial="1" throw="" context="_86" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESD1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_TIMES::~MDF_SPM_SPIKE_TIMES()" location="f3:448" file="f3" line="448" endline="448" inline="1">
  </Destructor>
  <OperatorMethod id="_583" name="=" returns="_1220" artificial="1" throw="" context="_86" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESaSERKS_" demangled="MDF_SPM_SPIKE_TIMES::operator=(MDF_SPM_SPIKE_TIMES const&amp;)" location="f3:448" file="f3" line="448" endline="448" inline="1">
    <Argument type="_1221" location="f3:443" file="f3" line="443"/>
  </OperatorMethod>
  <Constructor id="_584" name="._49" artificial="1" throw="" context="_86" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESC1ERKS_ *INTERNAL* " demangled="MDF_SPM_SPIKE_TIMES::MDF_SPM_SPIKE_TIMES(MDF_SPM_SPIKE_TIMES const&amp;)" location="f3:448" file="f3" line="448" endline="448" inline="1">
    <Argument type="_1221" location="f3:443" file="f3" line="443"/>
  </Constructor>
  <Constructor id="_585" name="._49" artificial="1" throw="" context="_86" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESC1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_TIMES::MDF_SPM_SPIKE_TIMES()" location="f3:448" file="f3" line="448" inline="1"/>
  <Field id="_586" name="module" type="_1205" offset="0" context="_89" access="public" location="f3:430" file="f3" line="430"/>
  <Destructor id="_587" name="._47" artificial="1" throw="" context="_89" access="public" mangled="_ZN16MDF_MODULE_STARTD1Ev *INTERNAL* " demangled="MDF_MODULE_START::~MDF_MODULE_START()" location="f3:431" file="f3" line="431" endline="431" inline="1">
  </Destructor>
  <OperatorMethod id="_588" name="=" returns="_1222" artificial="1" throw="" context="_89" access="public" mangled="_ZN16MDF_MODULE_STARTaSERKS_" demangled="MDF_MODULE_START::operator=(MDF_MODULE_START const&amp;)" location="f3:431" file="f3" line="431" endline="431" inline="1">
    <Argument type="_1223" location="f3:429" file="f3" line="429"/>
  </OperatorMethod>
  <Constructor id="_589" name="._47" artificial="1" throw="" context="_89" access="public" mangled="_ZN16MDF_MODULE_STARTC1ERKS_ *INTERNAL* " demangled="MDF_MODULE_START::MDF_MODULE_START(MDF_MODULE_START const&amp;)" location="f3:431" file="f3" line="431" endline="431" inline="1">
    <Argument type="_1223" location="f3:429" file="f3" line="429"/>
  </Constructor>
  <Constructor id="_590" name="._47" artificial="1" throw="" context="_89" access="public" mangled="_ZN16MDF_MODULE_STARTC1Ev *INTERNAL* " demangled="MDF_MODULE_START::MDF_MODULE_START()" location="f3:431" file="f3" line="431" inline="1"/>
  <Field id="_591" name="x" type="_449" offset="0" context="_96" access="public" location="f3:568" file="f3" line="568"/>
  <Field id="_592" name="y" type="_449" offset="64" context="_96" access="public" location="f3:569" file="f3" line="569"/>
  <Field id="_593" name="z" type="_449" offset="128" context="_96" access="public" location="f3:570" file="f3" line="570"/>
  <Destructor id="_594" name="._67" artificial="1" throw="" context="_96" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_POSITION_FEEDBACK::~MDF_POSITION_FEEDBACK()" location="f3:571" file="f3" line="571" endline="571" inline="1">
  </Destructor>
  <OperatorMethod id="_595" name="=" returns="_1224" artificial="1" throw="" context="_96" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKaSERKS_" demangled="MDF_POSITION_FEEDBACK::operator=(MDF_POSITION_FEEDBACK const&amp;)" location="f3:571" file="f3" line="571" endline="571" inline="1">
    <Argument type="_1225" location="f3:567" file="f3" line="567"/>
  </OperatorMethod>
  <Constructor id="_596" name="._67" artificial="1" throw="" context="_96" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_POSITION_FEEDBACK::MDF_POSITION_FEEDBACK(MDF_POSITION_FEEDBACK const&amp;)" location="f3:571" file="f3" line="571" endline="571" inline="1">
    <Argument type="_1225" location="f3:567" file="f3" line="567"/>
  </Constructor>
  <Constructor id="_597" name="._67" artificial="1" throw="" context="_96" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_POSITION_FEEDBACK::MDF_POSITION_FEEDBACK()" location="f3:571" file="f3" line="571" inline="1"/>
  <Field id="_598" name="sample_header" type="_187" offset="0" context="_101" access="public" location="f4:302" file="f4" line="302"/>
  <Field id="_599" name="cloud" type="_1226" offset="128" context="_101" access="public" location="f4:303" file="f4" line="303"/>
  <Field id="_600" name="nTargs" type="_531" offset="36992" context="_101" access="public" location="f4:304" file="f4" line="304"/>
  <Field id="_601" name="spacer" type="_531" offset="37024" context="_101" access="public" location="f4:305" file="f4" line="305"/>
  <Destructor id="_602" name="._82" artificial="1" throw="" context="_101" access="public" mangled="_ZN10TARG_CLOUDD1Ev *INTERNAL* " demangled="TARG_CLOUD::~TARG_CLOUD()" location="f4:306" file="f4" line="306" endline="306" inline="1">
  </Destructor>
  <OperatorMethod id="_603" name="=" returns="_1227" artificial="1" throw="" context="_101" access="public" mangled="_ZN10TARG_CLOUDaSERKS_" demangled="TARG_CLOUD::operator=(TARG_CLOUD const&amp;)" location="f4:306" file="f4" line="306" endline="306" inline="1">
    <Argument type="_1228" location="f4:301" file="f4" line="301"/>
  </OperatorMethod>
  <Constructor id="_604" name="._82" artificial="1" throw="" context="_101" access="public" mangled="_ZN10TARG_CLOUDC1ERKS_ *INTERNAL* " demangled="TARG_CLOUD::TARG_CLOUD(TARG_CLOUD const&amp;)" location="f4:306" file="f4" line="306" endline="306" inline="1">
    <Argument type="_1228" location="f4:301" file="f4" line="301"/>
  </Constructor>
  <Constructor id="_605" name="._82" artificial="1" throw="" context="_101" access="public" mangled="_ZN10TARG_CLOUDC1Ev *INTERNAL* " demangled="TARG_CLOUD::TARG_CLOUD()" location="f4:306" file="f4" line="306" inline="1"/>
  <Field id="_606" name="x" type="_449" offset="0" context="_105" access="public" location="f3:561" file="f3" line="561"/>
  <Field id="_607" name="y" type="_449" offset="64" context="_105" access="public" location="f3:562" file="f3" line="562"/>
  <Field id="_608" name="z" type="_449" offset="128" context="_105" access="public" location="f3:563" file="f3" line="563"/>
  <Destructor id="_609" name="._66" artificial="1" throw="" context="_105" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_FORCE_FEEDBACK::~MDF_FORCE_FEEDBACK()" location="f3:564" file="f3" line="564" endline="564" inline="1">
  </Destructor>
  <OperatorMethod id="_610" name="=" returns="_1229" artificial="1" throw="" context="_105" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKaSERKS_" demangled="MDF_FORCE_FEEDBACK::operator=(MDF_FORCE_FEEDBACK const&amp;)" location="f3:564" file="f3" line="564" endline="564" inline="1">
    <Argument type="_1230" location="f3:560" file="f3" line="560"/>
  </OperatorMethod>
  <Constructor id="_611" name="._66" artificial="1" throw="" context="_105" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_FORCE_FEEDBACK::MDF_FORCE_FEEDBACK(MDF_FORCE_FEEDBACK const&amp;)" location="f3:564" file="f3" line="564" endline="564" inline="1">
    <Argument type="_1230" location="f3:560" file="f3" line="560"/>
  </Constructor>
  <Constructor id="_612" name="._66" artificial="1" throw="" context="_105" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_FORCE_FEEDBACK::MDF_FORCE_FEEDBACK()" location="f3:564" file="f3" line="564" inline="1"/>
  <Field id="_613" name="full_path" type="_1231" offset="0" context="_113" access="public" location="f3:402" file="f3" line="402"/>
  <Destructor id="_614" name="._41" artificial="1" throw="" context="_113" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGD1Ev *INTERNAL* " demangled="MDF_LOAD_DECODER_CONFIG::~MDF_LOAD_DECODER_CONFIG()" location="f3:403" file="f3" line="403" endline="403" inline="1">
  </Destructor>
  <OperatorMethod id="_615" name="=" returns="_1232" artificial="1" throw="" context="_113" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGaSERKS_" demangled="MDF_LOAD_DECODER_CONFIG::operator=(MDF_LOAD_DECODER_CONFIG const&amp;)" location="f3:403" file="f3" line="403" endline="403" inline="1">
    <Argument type="_1233" location="f3:401" file="f3" line="401"/>
  </OperatorMethod>
  <Constructor id="_616" name="._41" artificial="1" throw="" context="_113" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_LOAD_DECODER_CONFIG::MDF_LOAD_DECODER_CONFIG(MDF_LOAD_DECODER_CONFIG const&amp;)" location="f3:403" file="f3" line="403" endline="403" inline="1">
    <Argument type="_1233" location="f3:401" file="f3" line="401"/>
  </Constructor>
  <Constructor id="_617" name="._41" artificial="1" throw="" context="_113" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGC1Ev *INTERNAL* " demangled="MDF_LOAD_DECODER_CONFIG::MDF_LOAD_DECODER_CONFIG()" location="f3:403" file="f3" line="403" inline="1"/>
  <Field id="_618" name="sample_header" type="_187" offset="0" context="_116" access="public" location="f4:278" file="f4" line="278"/>
  <Field id="_619" name="Components" type="_1234" offset="128" context="_116" access="public" location="f4:279" file="f4" line="279"/>
  <Field id="_620" name="Total" type="_449" offset="512" context="_116" access="public" location="f4:280" file="f4" line="280"/>
  <Destructor id="_621" name="._81" artificial="1" throw="" context="_116" access="public" mangled="_ZN10DELAY_DATAD1Ev *INTERNAL* " demangled="DELAY_DATA::~DELAY_DATA()" location="f4:281" file="f4" line="281" endline="281" inline="1">
  </Destructor>
  <OperatorMethod id="_622" name="=" returns="_1235" artificial="1" throw="" context="_116" access="public" mangled="_ZN10DELAY_DATAaSERKS_" demangled="DELAY_DATA::operator=(DELAY_DATA const&amp;)" location="f4:281" file="f4" line="281" endline="281" inline="1">
    <Argument type="_1236" location="f4:277" file="f4" line="277"/>
  </OperatorMethod>
  <Constructor id="_623" name="._81" artificial="1" throw="" context="_116" access="public" mangled="_ZN10DELAY_DATAC1ERKS_ *INTERNAL* " demangled="DELAY_DATA::DELAY_DATA(DELAY_DATA const&amp;)" location="f4:281" file="f4" line="281" endline="281" inline="1">
    <Argument type="_1236" location="f4:277" file="f4" line="277"/>
  </Constructor>
  <Constructor id="_624" name="._81" artificial="1" throw="" context="_116" access="public" mangled="_ZN10DELAY_DATAC1Ev *INTERNAL* " demangled="DELAY_DATA::DELAY_DATA()" location="f4:281" file="f4" line="281" inline="1"/>
  <FundamentalType id="_625" name="void" align="8"/>
  <PointerType id="_626" type="_625" size="64" align="64"/>
  <Field id="_627" name="sample_header" type="_187" offset="0" context="_126" access="public" location="f2:57" file="f2" line="57"/>
  <Field id="_628" name="dof_vals" type="_1237" offset="128" context="_126" access="public" location="f2:58" file="f2" line="58"/>
  <Field id="_629" name="tag" type="_1205" offset="1472" context="_126" access="public" location="f2:59" file="f2" line="59"/>
  <Destructor id="_630" name="._2" artificial="1" throw="" context="_126" access="public" mangled="_ZN14INPUT_DOF_DATAD1Ev *INTERNAL* " demangled="INPUT_DOF_DATA::~INPUT_DOF_DATA()" location="f2:60" file="f2" line="60" endline="60" inline="1">
  </Destructor>
  <OperatorMethod id="_631" name="=" returns="_1238" artificial="1" throw="" context="_126" access="public" mangled="_ZN14INPUT_DOF_DATAaSERKS_" demangled="INPUT_DOF_DATA::operator=(INPUT_DOF_DATA const&amp;)" location="f2:60" file="f2" line="60" endline="60" inline="1">
    <Argument type="_1239" location="f2:56" file="f2" line="56"/>
  </OperatorMethod>
  <Constructor id="_632" name="._2" artificial="1" throw="" context="_126" access="public" mangled="_ZN14INPUT_DOF_DATAC1ERKS_ *INTERNAL* " demangled="INPUT_DOF_DATA::INPUT_DOF_DATA(INPUT_DOF_DATA const&amp;)" location="f2:60" file="f2" line="60" endline="60" inline="1">
    <Argument type="_1239" location="f2:56" file="f2" line="56"/>
  </Constructor>
  <Constructor id="_633" name="._2" artificial="1" throw="" context="_126" access="public" mangled="_ZN14INPUT_DOF_DATAC1Ev *INTERNAL* " demangled="INPUT_DOF_DATA::INPUT_DOF_DATA()" location="f2:60" file="f2" line="60" inline="1"/>
  <Field id="_634" name="event_time" type="_449" offset="0" context="_128" access="public" location="f2:64" file="f2" line="64"/>
  <Field id="_635" name="event_code" type="_531" offset="64" context="_128" access="public" location="f2:65" file="f2" line="65"/>
  <Field id="_636" name="reserved" type="_531" offset="96" context="_128" access="public" location="f2:66" file="f2" line="66"/>
  <Destructor id="_637" name="._3" artificial="1" throw="" context="_128" access="public" mangled="_ZN11TRIAL_EVENTD1Ev *INTERNAL* " demangled="TRIAL_EVENT::~TRIAL_EVENT()" location="f2:67" file="f2" line="67" endline="67" inline="1">
  </Destructor>
  <OperatorMethod id="_638" name="=" returns="_1240" artificial="1" throw="" context="_128" access="public" mangled="_ZN11TRIAL_EVENTaSERKS_" demangled="TRIAL_EVENT::operator=(TRIAL_EVENT const&amp;)" location="f2:67" file="f2" line="67" endline="67" inline="1">
    <Argument type="_1241" location="f2:63" file="f2" line="63"/>
  </OperatorMethod>
  <Constructor id="_639" name="._3" artificial="1" throw="" context="_128" access="public" mangled="_ZN11TRIAL_EVENTC1ERKS_ *INTERNAL* " demangled="TRIAL_EVENT::TRIAL_EVENT(TRIAL_EVENT const&amp;)" location="f2:67" file="f2" line="67" endline="67" inline="1">
    <Argument type="_1241" location="f2:63" file="f2" line="63"/>
  </Constructor>
  <Constructor id="_640" name="._3" artificial="1" throw="" context="_128" access="public" mangled="_ZN11TRIAL_EVENTC1Ev *INTERNAL* " demangled="TRIAL_EVENT::TRIAL_EVENT()" location="f2:67" file="f2" line="67" inline="1"/>
  <Field id="_641" name="source_index" type="_531" offset="0" context="_131" access="public" location="f5:17" file="f5" line="17"/>
  <Field id="_642" name="reserved" type="_531" offset="32" context="_131" access="public" location="f5:18" file="f5" line="18"/>
  <Field id="_643" name="source_timestamp" type="_449" offset="64" context="_131" access="public" location="f5:19" file="f5" line="19"/>
  <Field id="_644" name="count_interval" type="_449" offset="128" context="_131" access="public" location="f5:20" file="f5" line="20"/>
  <Field id="_645" name="counts" type="_1242" offset="192" context="_131" access="public" location="f5:21" file="f5" line="21"/>
  <Destructor id="_646" name="._13" artificial="1" throw="" context="_131" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTD1Ev *INTERNAL* " demangled="MDF_RAW_SPIKECOUNT::~MDF_RAW_SPIKECOUNT()" location="f5:22" file="f5" line="22" endline="22" inline="1">
  </Destructor>
  <OperatorMethod id="_647" name="=" returns="_1243" artificial="1" throw="" context="_131" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTaSERKS_" demangled="MDF_RAW_SPIKECOUNT::operator=(MDF_RAW_SPIKECOUNT const&amp;)" location="f5:22" file="f5" line="22" endline="22" inline="1">
    <Argument type="_1244" location="f5:16" file="f5" line="16"/>
  </OperatorMethod>
  <Constructor id="_648" name="._13" artificial="1" throw="" context="_131" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTC1ERKS_ *INTERNAL* " demangled="MDF_RAW_SPIKECOUNT::MDF_RAW_SPIKECOUNT(MDF_RAW_SPIKECOUNT const&amp;)" location="f5:22" file="f5" line="22" endline="22" inline="1">
    <Argument type="_1244" location="f5:16" file="f5" line="16"/>
  </Constructor>
  <Constructor id="_649" name="._13" artificial="1" throw="" context="_131" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTC1Ev *INTERNAL* " demangled="MDF_RAW_SPIKECOUNT::MDF_RAW_SPIKECOUNT()" location="f5:22" file="f5" line="22" inline="1"/>
  <Field id="_650" name="data" type="_1245" offset="0" context="_133" access="public" location="f3:422" file="f3" line="422"/>
  <Destructor id="_651" name="._45" artificial="1" throw="" context="_133" access="public" mangled="_ZN16MDF_DEBUG_VECTORD1Ev *INTERNAL* " demangled="MDF_DEBUG_VECTOR::~MDF_DEBUG_VECTOR()" location="f3:423" file="f3" line="423" endline="423" inline="1">
  </Destructor>
  <OperatorMethod id="_652" name="=" returns="_1246" artificial="1" throw="" context="_133" access="public" mangled="_ZN16MDF_DEBUG_VECTORaSERKS_" demangled="MDF_DEBUG_VECTOR::operator=(MDF_DEBUG_VECTOR const&amp;)" location="f3:423" file="f3" line="423" endline="423" inline="1">
    <Argument type="_1247" location="f3:421" file="f3" line="421"/>
  </OperatorMethod>
  <Constructor id="_653" name="._45" artificial="1" throw="" context="_133" access="public" mangled="_ZN16MDF_DEBUG_VECTORC1ERKS_ *INTERNAL* " demangled="MDF_DEBUG_VECTOR::MDF_DEBUG_VECTOR(MDF_DEBUG_VECTOR const&amp;)" location="f3:423" file="f3" line="423" endline="423" inline="1">
    <Argument type="_1247" location="f3:421" file="f3" line="421"/>
  </Constructor>
  <Constructor id="_654" name="._45" artificial="1" throw="" context="_133" access="public" mangled="_ZN16MDF_DEBUG_VECTORC1Ev *INTERNAL* " demangled="MDF_DEBUG_VECTOR::MDF_DEBUG_VECTOR()" location="f3:423" file="f3" line="423" inline="1"/>
  <Field id="_655" name="module_name" type="_1205" offset="0" context="_141" access="public" location="f3:388" file="f3" line="388"/>
  <Field id="_656" name="version" type="_1205" offset="512" context="_141" access="public" location="f3:389" file="f3" line="389"/>
  <Destructor id="_657" name="._39" artificial="1" throw="" context="_141" access="public" mangled="_ZN16MDF_CODE_VERSIOND1Ev *INTERNAL* " demangled="MDF_CODE_VERSION::~MDF_CODE_VERSION()" location="f3:390" file="f3" line="390" endline="390" inline="1">
  </Destructor>
  <OperatorMethod id="_658" name="=" returns="_1248" artificial="1" throw="" context="_141" access="public" mangled="_ZN16MDF_CODE_VERSIONaSERKS_" demangled="MDF_CODE_VERSION::operator=(MDF_CODE_VERSION const&amp;)" location="f3:390" file="f3" line="390" endline="390" inline="1">
    <Argument type="_1249" location="f3:387" file="f3" line="387"/>
  </OperatorMethod>
  <Constructor id="_659" name="._39" artificial="1" throw="" context="_141" access="public" mangled="_ZN16MDF_CODE_VERSIONC1ERKS_ *INTERNAL* " demangled="MDF_CODE_VERSION::MDF_CODE_VERSION(MDF_CODE_VERSION const&amp;)" location="f3:390" file="f3" line="390" endline="390" inline="1">
    <Argument type="_1249" location="f3:387" file="f3" line="387"/>
  </Constructor>
  <Constructor id="_660" name="._39" artificial="1" throw="" context="_141" access="public" mangled="_ZN16MDF_CODE_VERSIONC1Ev *INTERNAL* " demangled="MDF_CODE_VERSION::MDF_CODE_VERSION()" location="f3:390" file="f3" line="390" inline="1"/>
  <Field id="_661" name="event_time" type="_449" offset="0" context="_147" access="public" location="f4:95" file="f4" line="95"/>
  <Field id="_662" name="event_code" type="_531" offset="64" context="_147" access="public" location="f4:96" file="f4" line="96"/>
  <Field id="_663" name="reserved" type="_531" offset="96" context="_147" access="public" location="f4:97" file="f4" line="97"/>
  <Destructor id="_664" name="._71" artificial="1" throw="" context="_147" access="public" mangled="_ZN15MDF_TRIAL_EVENTD1Ev *INTERNAL* " demangled="MDF_TRIAL_EVENT::~MDF_TRIAL_EVENT()" location="f4:98" file="f4" line="98" endline="98" inline="1">
  </Destructor>
  <OperatorMethod id="_665" name="=" returns="_1250" artificial="1" throw="" context="_147" access="public" mangled="_ZN15MDF_TRIAL_EVENTaSERKS_" demangled="MDF_TRIAL_EVENT::operator=(MDF_TRIAL_EVENT const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_1251" location="f4:94" file="f4" line="94"/>
  </OperatorMethod>
  <Constructor id="_666" name="._71" artificial="1" throw="" context="_147" access="public" mangled="_ZN15MDF_TRIAL_EVENTC1ERKS_ *INTERNAL* " demangled="MDF_TRIAL_EVENT::MDF_TRIAL_EVENT(MDF_TRIAL_EVENT const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_1251" location="f4:94" file="f4" line="94"/>
  </Constructor>
  <Constructor id="_667" name="._71" artificial="1" throw="" context="_147" access="public" mangled="_ZN15MDF_TRIAL_EVENTC1Ev *INTERNAL* " demangled="MDF_TRIAL_EVENT::MDF_TRIAL_EVENT()" location="f4:98" file="f4" line="98" inline="1"/>
  <Field id="_668" name="sample_header" type="_187" offset="0" context="_153" access="public" location="f4:178" file="f4" line="178"/>
  <Field id="_669" name="sample_interval" type="_449" offset="128" context="_153" access="public" location="f4:179" file="f4" line="179"/>
  <Field id="_670" name="data" type="_1252" offset="192" context="_153" access="public" location="f4:180" file="f4" line="180"/>
  <Destructor id="_671" name="._77" artificial="1" throw="" context="_153" access="public" mangled="_ZN17MDF_ANALOG_STREAMD1Ev *INTERNAL* " demangled="MDF_ANALOG_STREAM::~MDF_ANALOG_STREAM()" location="f4:181" file="f4" line="181" endline="181" inline="1">
  </Destructor>
  <OperatorMethod id="_672" name="=" returns="_1253" artificial="1" throw="" context="_153" access="public" mangled="_ZN17MDF_ANALOG_STREAMaSERKS_" demangled="MDF_ANALOG_STREAM::operator=(MDF_ANALOG_STREAM const&amp;)" location="f4:181" file="f4" line="181" endline="181" inline="1">
    <Argument type="_1254" location="f4:177" file="f4" line="177"/>
  </OperatorMethod>
  <Constructor id="_673" name="._77" artificial="1" throw="" context="_153" access="public" mangled="_ZN17MDF_ANALOG_STREAMC1ERKS_ *INTERNAL* " demangled="MDF_ANALOG_STREAM::MDF_ANALOG_STREAM(MDF_ANALOG_STREAM const&amp;)" location="f4:181" file="f4" line="181" endline="181" inline="1">
    <Argument type="_1254" location="f4:177" file="f4" line="177"/>
  </Constructor>
  <Constructor id="_674" name="._77" artificial="1" throw="" context="_153" access="public" mangled="_ZN17MDF_ANALOG_STREAMC1Ev *INTERNAL* " demangled="MDF_ANALOG_STREAM::MDF_ANALOG_STREAM()" location="f4:181" file="f4" line="181" inline="1"/>
  <PointerType id="_675" type="_625c" size="64" align="64"/>
  <FundamentalType id="_676" name="unsigned int" size="32" align="32"/>
  <Field id="_677" name="limits" type="_681" offset="0" context="_167" access="public" location="f4:159" file="f4" line="159"/>
  <Field id="_678" name="reserved" type="_531" offset="1536" context="_167" access="public" location="f4:160" file="f4" line="160"/>
  <Field id="_679" name="internal_sampling" type="_531" offset="1568" context="_167" access="public" location="f4:161" file="f4" line="161"/>
  <Field id="_680" name="sample_interval" type="_449" offset="1600" context="_167" access="public" location="f4:162" file="f4" line="162"/>
  <Struct id="_681" context="_167" access="public" mangled="N19MDF_IO_START_STREAM4._76E" demangled="MDF_IO_START_STREAM::._76" location="f4:156" file="f4" line="156" artificial="1" size="1536" align="64" members="_1256 _1257 _1258 _1259 _1260 _1261 " bases=""/>
  <Destructor id="_682" name="._75" artificial="1" throw="" context="_167" access="public" mangled="_ZN19MDF_IO_START_STREAMD1Ev *INTERNAL* " demangled="MDF_IO_START_STREAM::~MDF_IO_START_STREAM()" location="f4:163" file="f4" line="163" endline="163" inline="1">
  </Destructor>
  <OperatorMethod id="_683" name="=" returns="_1262" artificial="1" throw="" context="_167" access="public" mangled="_ZN19MDF_IO_START_STREAMaSERKS_" demangled="MDF_IO_START_STREAM::operator=(MDF_IO_START_STREAM const&amp;)" location="f4:163" file="f4" line="163" endline="163" inline="1">
    <Argument type="_1263" location="f4:155" file="f4" line="155"/>
  </OperatorMethod>
  <Constructor id="_684" name="._75" artificial="1" throw="" context="_167" access="public" mangled="_ZN19MDF_IO_START_STREAMC1ERKS_ *INTERNAL* " demangled="MDF_IO_START_STREAM::MDF_IO_START_STREAM(MDF_IO_START_STREAM const&amp;)" location="f4:163" file="f4" line="163" endline="163" inline="1">
    <Argument type="_1263" location="f4:155" file="f4" line="155"/>
  </Constructor>
  <Constructor id="_685" name="._75" artificial="1" throw="" context="_167" access="public" mangled="_ZN19MDF_IO_START_STREAMC1Ev *INTERNAL* " demangled="MDF_IO_START_STREAM::MDF_IO_START_STREAM()" location="f4:163" file="f4" line="163" inline="1"/>
  <PointerType id="_686" type="_531" size="64" align="64"/>
  <Field id="_687" name="cmd" type="_1264" offset="0" context="_183" access="public" location="f2:135" file="f2" line="135"/>
  <Destructor id="_688" name="._10" artificial="1" throw="" context="_183" access="public" mangled="_ZN12JVEL_COMMANDD1Ev *INTERNAL* " demangled="JVEL_COMMAND::~JVEL_COMMAND()" location="f2:136" file="f2" line="136" endline="136" inline="1">
  </Destructor>
  <OperatorMethod id="_689" name="=" returns="_1265" artificial="1" throw="" context="_183" access="public" mangled="_ZN12JVEL_COMMANDaSERKS_" demangled="JVEL_COMMAND::operator=(JVEL_COMMAND const&amp;)" location="f2:136" file="f2" line="136" endline="136" inline="1">
    <Argument type="_1266" location="f2:134" file="f2" line="134"/>
  </OperatorMethod>
  <Constructor id="_690" name="._10" artificial="1" throw="" context="_183" access="public" mangled="_ZN12JVEL_COMMANDC1ERKS_ *INTERNAL* " demangled="JVEL_COMMAND::JVEL_COMMAND(JVEL_COMMAND const&amp;)" location="f2:136" file="f2" line="136" endline="136" inline="1">
    <Argument type="_1266" location="f2:134" file="f2" line="134"/>
  </Constructor>
  <Constructor id="_691" name="._10" artificial="1" throw="" context="_183" access="public" mangled="_ZN12JVEL_COMMANDC1Ev *INTERNAL* " demangled="JVEL_COMMAND::JVEL_COMMAND()" location="f2:136" file="f2" line="136" inline="1"/>
  <Field id="_692" name="SerialNo" type="_531" offset="0" context="_187" access="public" location="f2:23" file="f2" line="23"/>
  <Field id="_693" name="Flags" type="_531" offset="32" context="_187" access="public" location="f2:24" file="f2" line="24"/>
  <Field id="_694" name="DeltaTime" type="_449" offset="64" context="_187" access="public" location="f2:25" file="f2" line="25"/>
  <Destructor id="_695" name="._0" artificial="1" throw="" context="_187" access="public" mangled="_ZN13SAMPLE_HEADERD1Ev *INTERNAL* " demangled="SAMPLE_HEADER::~SAMPLE_HEADER()" location="f2:26" file="f2" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_696" name="=" returns="_1267" artificial="1" throw="" context="_187" access="public" mangled="_ZN13SAMPLE_HEADERaSERKS_" demangled="SAMPLE_HEADER::operator=(SAMPLE_HEADER const&amp;)" location="f2:26" file="f2" line="26" endline="26" inline="1">
    <Argument type="_1268" location="f2:22" file="f2" line="22"/>
  </OperatorMethod>
  <Constructor id="_697" name="._0" artificial="1" throw="" context="_187" access="public" mangled="_ZN13SAMPLE_HEADERC1ERKS_ *INTERNAL* " demangled="SAMPLE_HEADER::SAMPLE_HEADER(SAMPLE_HEADER const&amp;)" location="f2:26" file="f2" line="26" endline="26" inline="1">
    <Argument type="_1268" location="f2:22" file="f2" line="22"/>
  </Constructor>
  <Constructor id="_698" name="._0" artificial="1" throw="" context="_187" access="public" mangled="_ZN13SAMPLE_HEADERC1Ev *INTERNAL* " demangled="SAMPLE_HEADER::SAMPLE_HEADER()" location="f2:26" file="f2" line="26" inline="1"/>
  <Field id="_699" name="configID" type="_531" offset="0" context="_192" access="public" location="f3:258" file="f3" line="258"/>
  <Field id="_700" name="afcf" type="_531" offset="32" context="_192" access="public" location="f3:259" file="f3" line="259"/>
  <Field id="_701" name="pulses" type="_449" offset="64" context="_192" access="public" location="f3:260" file="f3" line="260"/>
  <Field id="_702" name="amp1" type="_449" offset="128" context="_192" access="public" location="f3:261" file="f3" line="261"/>
  <Field id="_703" name="amp2" type="_449" offset="192" context="_192" access="public" location="f3:262" file="f3" line="262"/>
  <Field id="_704" name="width1" type="_449" offset="256" context="_192" access="public" location="f3:263" file="f3" line="263"/>
  <Field id="_705" name="width2" type="_449" offset="320" context="_192" access="public" location="f3:264" file="f3" line="264"/>
  <Field id="_706" name="frequency" type="_449" offset="384" context="_192" access="public" location="f3:265" file="f3" line="265"/>
  <Field id="_707" name="interphase" type="_449" offset="448" context="_192" access="public" location="f3:266" file="f3" line="266"/>
  <Destructor id="_708" name="._25" artificial="1" throw="" context="_192" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULED1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_MODULE::~MDF_CERESTIM_CONFIG_MODULE()" location="f3:267" file="f3" line="267" endline="267" inline="1">
  </Destructor>
  <OperatorMethod id="_709" name="=" returns="_1269" artificial="1" throw="" context="_192" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULEaSERKS_" demangled="MDF_CERESTIM_CONFIG_MODULE::operator=(MDF_CERESTIM_CONFIG_MODULE const&amp;)" location="f3:267" file="f3" line="267" endline="267" inline="1">
    <Argument type="_1270" location="f3:257" file="f3" line="257"/>
  </OperatorMethod>
  <Constructor id="_710" name="._25" artificial="1" throw="" context="_192" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULEC1ERKS_ *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_MODULE::MDF_CERESTIM_CONFIG_MODULE(MDF_CERESTIM_CONFIG_MODULE const&amp;)" location="f3:267" file="f3" line="267" endline="267" inline="1">
    <Argument type="_1270" location="f3:257" file="f3" line="257"/>
  </Constructor>
  <Constructor id="_711" name="._25" artificial="1" throw="" context="_192" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULEC1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_MODULE::MDF_CERESTIM_CONFIG_MODULE()" location="f3:267" file="f3" line="267" inline="1"/>
  <FundamentalType id="_712" name="long int" size="64" align="64"/>
  <Field id="_713" name="SerialNo" type="_676" offset="0" context="_207" access="public" location="f3:533" file="f3" line="533"/>
  <Field id="_714" name="reserved" type="_676" offset="32" context="_207" access="public" location="f3:534" file="f3" line="534"/>
  <Destructor id="_715" name="._61" artificial="1" throw="" context="_207" access="public" mangled="_ZN14MDF_SYNC_PULSED1Ev *INTERNAL* " demangled="MDF_SYNC_PULSE::~MDF_SYNC_PULSE()" location="f3:535" file="f3" line="535" endline="535" inline="1">
  </Destructor>
  <OperatorMethod id="_716" name="=" returns="_1271" artificial="1" throw="" context="_207" access="public" mangled="_ZN14MDF_SYNC_PULSEaSERKS_" demangled="MDF_SYNC_PULSE::operator=(MDF_SYNC_PULSE const&amp;)" location="f3:535" file="f3" line="535" endline="535" inline="1">
    <Argument type="_1272" location="f3:532" file="f3" line="532"/>
  </OperatorMethod>
  <Constructor id="_717" name="._61" artificial="1" throw="" context="_207" access="public" mangled="_ZN14MDF_SYNC_PULSEC1ERKS_ *INTERNAL* " demangled="MDF_SYNC_PULSE::MDF_SYNC_PULSE(MDF_SYNC_PULSE const&amp;)" location="f3:535" file="f3" line="535" endline="535" inline="1">
    <Argument type="_1272" location="f3:532" file="f3" line="532"/>
  </Constructor>
  <Constructor id="_718" name="._61" artificial="1" throw="" context="_207" access="public" mangled="_ZN14MDF_SYNC_PULSEC1Ev *INTERNAL* " demangled="MDF_SYNC_PULSE::MDF_SYNC_PULSE()" location="f3:535" file="f3" line="535" inline="1"/>
  <Field id="_719" name="time" type="_449" offset="0" context="_214" access="public" location="f3:474" file="f3" line="474"/>
  <Destructor id="_720" name="._53" artificial="1" throw="" context="_214" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDD1Ev *INTERNAL* " demangled="MDF_ARTIFACT_REJECTED::~MDF_ARTIFACT_REJECTED()" location="f3:475" file="f3" line="475" endline="475" inline="1">
  </Destructor>
  <OperatorMethod id="_721" name="=" returns="_1273" artificial="1" throw="" context="_214" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDaSERKS_" demangled="MDF_ARTIFACT_REJECTED::operator=(MDF_ARTIFACT_REJECTED const&amp;)" location="f3:475" file="f3" line="475" endline="475" inline="1">
    <Argument type="_1274" location="f3:473" file="f3" line="473"/>
  </OperatorMethod>
  <Constructor id="_722" name="._53" artificial="1" throw="" context="_214" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDC1ERKS_ *INTERNAL* " demangled="MDF_ARTIFACT_REJECTED::MDF_ARTIFACT_REJECTED(MDF_ARTIFACT_REJECTED const&amp;)" location="f3:475" file="f3" line="475" endline="475" inline="1">
    <Argument type="_1274" location="f3:473" file="f3" line="473"/>
  </Constructor>
  <Constructor id="_723" name="._53" artificial="1" throw="" context="_214" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDC1Ev *INTERNAL* " demangled="MDF_ARTIFACT_REJECTED::MDF_ARTIFACT_REJECTED()" location="f3:475" file="f3" line="475" inline="1"/>
  <PointerType id="_724" type="_533" size="64" align="64"/>
  <Field id="_725" name="tool_id" type="_531" offset="0" context="_217" access="public" location="f3:324" file="f3" line="324"/>
  <Field id="_726" name="reserved" type="_531" offset="32" context="_217" access="public" location="f3:325" file="f3" line="325"/>
  <Destructor id="_727" name="._34" artificial="1" throw="" context="_217" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETED1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL_COMPLETE::~MDF_CHANGE_TOOL_COMPLETE()" location="f3:326" file="f3" line="326" endline="326" inline="1">
  </Destructor>
  <OperatorMethod id="_728" name="=" returns="_1275" artificial="1" throw="" context="_217" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETEaSERKS_" demangled="MDF_CHANGE_TOOL_COMPLETE::operator=(MDF_CHANGE_TOOL_COMPLETE const&amp;)" location="f3:326" file="f3" line="326" endline="326" inline="1">
    <Argument type="_1276" location="f3:323" file="f3" line="323"/>
  </OperatorMethod>
  <Constructor id="_729" name="._34" artificial="1" throw="" context="_217" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETEC1ERKS_ *INTERNAL* " demangled="MDF_CHANGE_TOOL_COMPLETE::MDF_CHANGE_TOOL_COMPLETE(MDF_CHANGE_TOOL_COMPLETE const&amp;)" location="f3:326" file="f3" line="326" endline="326" inline="1">
    <Argument type="_1276" location="f3:323" file="f3" line="323"/>
  </Constructor>
  <Constructor id="_730" name="._34" artificial="1" throw="" context="_217" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETEC1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL_COMPLETE::MDF_CHANGE_TOOL_COMPLETE()" location="f3:326" file="f3" line="326" inline="1"/>
  <PointerType id="_731" type="_534" size="64" align="64"/>
  <Field id="_732" name="position_no" type="_531" offset="0" context="_219" access="public" location="f4:205" file="f4" line="205"/>
  <Field id="_733" name="movement_id" type="_531" offset="32" context="_219" access="public" location="f4:206" file="f4" line="206"/>
  <Destructor id="_734" name="._78" artificial="1" throw="" context="_219" access="public" mangled="_ZN14MDF_DENSO_MOVED1Ev *INTERNAL* " demangled="MDF_DENSO_MOVE::~MDF_DENSO_MOVE()" location="f4:207" file="f4" line="207" endline="207" inline="1">
  </Destructor>
  <OperatorMethod id="_735" name="=" returns="_1277" artificial="1" throw="" context="_219" access="public" mangled="_ZN14MDF_DENSO_MOVEaSERKS_" demangled="MDF_DENSO_MOVE::operator=(MDF_DENSO_MOVE const&amp;)" location="f4:207" file="f4" line="207" endline="207" inline="1">
    <Argument type="_1278" location="f4:204" file="f4" line="204"/>
  </OperatorMethod>
  <Constructor id="_736" name="._78" artificial="1" throw="" context="_219" access="public" mangled="_ZN14MDF_DENSO_MOVEC1ERKS_ *INTERNAL* " demangled="MDF_DENSO_MOVE::MDF_DENSO_MOVE(MDF_DENSO_MOVE const&amp;)" location="f4:207" file="f4" line="207" endline="207" inline="1">
    <Argument type="_1278" location="f4:204" file="f4" line="204"/>
  </Constructor>
  <Constructor id="_737" name="._78" artificial="1" throw="" context="_219" access="public" mangled="_ZN14MDF_DENSO_MOVEC1Ev *INTERNAL* " demangled="MDF_DENSO_MOVE::MDF_DENSO_MOVE()" location="f4:207" file="f4" line="207" inline="1"/>
  <Field id="_738" name="sample_header" type="_187" offset="0" context="_222" access="public" location="f5:26" file="f5" line="26"/>
  <Field id="_739" name="source_timestamp" type="_449" offset="128" context="_222" access="public" location="f5:27" file="f5" line="27"/>
  <Field id="_740" name="count_interval" type="_449" offset="192" context="_222" access="public" location="f5:28" file="f5" line="28"/>
  <Field id="_741" name="counts" type="_1279" offset="256" context="_222" access="public" location="f5:29" file="f5" line="29"/>
  <Destructor id="_742" name="._14" artificial="1" throw="" context="_222" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTD1Ev *INTERNAL* " demangled="MDF_SPM_SPIKECOUNT::~MDF_SPM_SPIKECOUNT()" location="f5:30" file="f5" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_743" name="=" returns="_1280" artificial="1" throw="" context="_222" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTaSERKS_" demangled="MDF_SPM_SPIKECOUNT::operator=(MDF_SPM_SPIKECOUNT const&amp;)" location="f5:30" file="f5" line="30" endline="30" inline="1">
    <Argument type="_1281" location="f5:25" file="f5" line="25"/>
  </OperatorMethod>
  <Constructor id="_744" name="._14" artificial="1" throw="" context="_222" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTC1ERKS_ *INTERNAL* " demangled="MDF_SPM_SPIKECOUNT::MDF_SPM_SPIKECOUNT(MDF_SPM_SPIKECOUNT const&amp;)" location="f5:30" file="f5" line="30" endline="30" inline="1">
    <Argument type="_1281" location="f5:25" file="f5" line="25"/>
  </Constructor>
  <Constructor id="_745" name="._14" artificial="1" throw="" context="_222" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTC1Ev *INTERNAL* " demangled="MDF_SPM_SPIKECOUNT::MDF_SPM_SPIKECOUNT()" location="f5:30" file="f5" line="30" inline="1"/>
  <Field id="_746" name="target" type="_1203" offset="0" context="_223" access="public" location="f2:89" file="f2" line="89"/>
  <Field id="_747" name="coriMatrix" type="_1214" offset="1152" context="_223" access="public" location="f2:90" file="f2" line="90"/>
  <Field id="_748" name="trialEvent" type="_128" offset="1728" context="_223" access="public" location="f2:92" file="f2" line="92"/>
  <Field id="_749" name="autoControlParams" type="_318" offset="1856" context="_223" access="public" location="f2:93" file="f2" line="93"/>
  <Field id="_750" name="autoPosControlFraction" type="_1203" offset="8128" context="_223" access="public" location="f2:94" file="f2" line="94"/>
  <Field id="_751" name="autoVelControlFraction" type="_1203" offset="9280" context="_223" access="public" location="f2:95" file="f2" line="95"/>
  <Field id="_752" name="orthPosImpedance" type="_1203" offset="10432" context="_223" access="public" location="f2:96" file="f2" line="96"/>
  <Field id="_753" name="orthVelImpedance" type="_1203" offset="11584" context="_223" access="public" location="f2:97" file="f2" line="97"/>
  <Field id="_754" name="extrinsicVelControlled" type="_1204" offset="12736" context="_223" access="public" location="f2:98" file="f2" line="98"/>
  <Field id="_755" name="extrinsicPosControlled" type="_1204" offset="13312" context="_223" access="public" location="f2:99" file="f2" line="99"/>
  <Field id="_756" name="importantDOF" type="_1204" offset="13888" context="_223" access="public" location="f2:100" file="f2" line="100"/>
  <Destructor id="_757" name="._6" artificial="1" throw="" context="_223" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGD1Ev *INTERNAL* " demangled="ROBOT_CONTROL_CONFIG::~ROBOT_CONTROL_CONFIG()" location="f2:102" file="f2" line="102" endline="102" inline="1">
  </Destructor>
  <OperatorMethod id="_758" name="=" returns="_1282" artificial="1" throw="" context="_223" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGaSERKS_" demangled="ROBOT_CONTROL_CONFIG::operator=(ROBOT_CONTROL_CONFIG const&amp;)" location="f2:102" file="f2" line="102" endline="102" inline="1">
    <Argument type="_1283" location="f2:88" file="f2" line="88"/>
  </OperatorMethod>
  <Constructor id="_759" name="._6" artificial="1" throw="" context="_223" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGC1ERKS_ *INTERNAL* " demangled="ROBOT_CONTROL_CONFIG::ROBOT_CONTROL_CONFIG(ROBOT_CONTROL_CONFIG const&amp;)" location="f2:102" file="f2" line="102" endline="102" inline="1">
    <Argument type="_1283" location="f2:88" file="f2" line="88"/>
  </Constructor>
  <Constructor id="_760" name="._6" artificial="1" throw="" context="_223" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGC1Ev *INTERNAL* " demangled="ROBOT_CONTROL_CONFIG::ROBOT_CONTROL_CONFIG()" location="f2:102" file="f2" line="102" inline="1"/>
  <Field id="_761" name="sample_header" type="_187" offset="0" context="_231" access="public" location="f3:508" file="f3" line="508"/>
  <Field id="_762" name="applied" type="_531" offset="128" context="_231" access="public" location="f3:509" file="f3" line="509"/>
  <Field id="_763" name="reserved" type="_531" offset="160" context="_231" access="public" location="f3:510" file="f3" line="510"/>
  <Destructor id="_764" name="._58" artificial="1" throw="" context="_231" access="public" mangled="_ZN17MDF_FORCE_APPLIEDD1Ev *INTERNAL* " demangled="MDF_FORCE_APPLIED::~MDF_FORCE_APPLIED()" location="f3:511" file="f3" line="511" endline="511" inline="1">
  </Destructor>
  <OperatorMethod id="_765" name="=" returns="_1284" artificial="1" throw="" context="_231" access="public" mangled="_ZN17MDF_FORCE_APPLIEDaSERKS_" demangled="MDF_FORCE_APPLIED::operator=(MDF_FORCE_APPLIED const&amp;)" location="f3:511" file="f3" line="511" endline="511" inline="1">
    <Argument type="_1285" location="f3:507" file="f3" line="507"/>
  </OperatorMethod>
  <Constructor id="_766" name="._58" artificial="1" throw="" context="_231" access="public" mangled="_ZN17MDF_FORCE_APPLIEDC1ERKS_ *INTERNAL* " demangled="MDF_FORCE_APPLIED::MDF_FORCE_APPLIED(MDF_FORCE_APPLIED const&amp;)" location="f3:511" file="f3" line="511" endline="511" inline="1">
    <Argument type="_1285" location="f3:507" file="f3" line="507"/>
  </Constructor>
  <Constructor id="_767" name="._58" artificial="1" throw="" context="_231" access="public" mangled="_ZN17MDF_FORCE_APPLIEDC1Ev *INTERNAL* " demangled="MDF_FORCE_APPLIED::MDF_FORCE_APPLIED()" location="f3:511" file="f3" line="511" inline="1"/>
  <Field id="_768" name="sample_header" type="_187" offset="0" context="_232" access="public" location="f2:130" file="f2" line="130"/>
  <Field id="_769" name="targetPos" type="_1203" offset="128" context="_232" access="public" location="f2:131" file="f2" line="131"/>
  <Destructor id="_770" name="._9" artificial="1" throw="" context="_232" access="public" mangled="_ZN13PLANNER_STATED1Ev *INTERNAL* " demangled="PLANNER_STATE::~PLANNER_STATE()" location="f2:132" file="f2" line="132" endline="132" inline="1">
  </Destructor>
  <OperatorMethod id="_771" name="=" returns="_1286" artificial="1" throw="" context="_232" access="public" mangled="_ZN13PLANNER_STATEaSERKS_" demangled="PLANNER_STATE::operator=(PLANNER_STATE const&amp;)" location="f2:132" file="f2" line="132" endline="132" inline="1">
    <Argument type="_1287" location="f2:129" file="f2" line="129"/>
  </OperatorMethod>
  <Constructor id="_772" name="._9" artificial="1" throw="" context="_232" access="public" mangled="_ZN13PLANNER_STATEC1ERKS_ *INTERNAL* " demangled="PLANNER_STATE::PLANNER_STATE(PLANNER_STATE const&amp;)" location="f2:132" file="f2" line="132" endline="132" inline="1">
    <Argument type="_1287" location="f2:129" file="f2" line="129"/>
  </Constructor>
  <Constructor id="_773" name="._9" artificial="1" throw="" context="_232" access="public" mangled="_ZN13PLANNER_STATEC1Ev *INTERNAL* " demangled="PLANNER_STATE::PLANNER_STATE()" location="f2:132" file="f2" line="132" inline="1"/>
  <Field id="_774" name="sample_header" type="_187" offset="0" context="_242" access="public" location="f2:147" file="f2" line="147"/>
  <Field id="_775" name="autoControl" type="_232" offset="128" context="_242" access="public" location="f2:148" file="f2" line="148"/>
  <Field id="_776" name="overrideCommand" type="_259" offset="1408" context="_242" access="public" location="f2:149" file="f2" line="149"/>
  <Field id="_777" name="RTMA_received_time" type="_449" offset="3072" context="_242" access="public" location="f2:150" file="f2" line="150"/>
  <Field id="_778" name="actualControlPos" type="_1203" offset="3136" context="_242" access="public" location="f2:151" file="f2" line="151"/>
  <Field id="_779" name="actualControlVel" type="_1203" offset="4288" context="_242" access="public" location="f2:152" file="f2" line="152"/>
  <Field id="_780" name="autoControlPos" type="_1203" offset="5440" context="_242" access="public" location="f2:153" file="f2" line="153"/>
  <Field id="_781" name="autoControlVel" type="_1203" offset="6592" context="_242" access="public" location="f2:154" file="f2" line="154"/>
  <Field id="_782" name="autoPosControlFraction" type="_1203" offset="7744" context="_242" access="public" location="f2:155" file="f2" line="155"/>
  <Field id="_783" name="autoVelControlFraction" type="_1203" offset="8896" context="_242" access="public" location="f2:156" file="f2" line="156"/>
  <Field id="_784" name="orthPosImpedance" type="_1203" offset="10048" context="_242" access="public" location="f2:157" file="f2" line="157"/>
  <Field id="_785" name="orthVelImpedance" type="_1203" offset="11200" context="_242" access="public" location="f2:158" file="f2" line="158"/>
  <Field id="_786" name="intrinsicVelControlled" type="_1204" offset="12352" context="_242" access="public" location="f2:159" file="f2" line="159"/>
  <Field id="_787" name="intrinsicPosControlled" type="_1204" offset="12928" context="_242" access="public" location="f2:160" file="f2" line="160"/>
  <Field id="_788" name="extrinsicVelControlled" type="_1204" offset="13504" context="_242" access="public" location="f2:161" file="f2" line="161"/>
  <Field id="_789" name="extrinsicPosControlled" type="_1204" offset="14080" context="_242" access="public" location="f2:162" file="f2" line="162"/>
  <Field id="_790" name="overrideDimensions" type="_1204" offset="14656" context="_242" access="public" location="f2:163" file="f2" line="163"/>
  <Field id="_791" name="actualCommandComposition" type="_676" offset="15232" context="_242" access="public" location="f2:164" file="f2" line="164"/>
  <Field id="_792" name="blank" type="_531" offset="15264" context="_242" access="public" location="f2:165" file="f2" line="165"/>
  <Destructor id="_793" name="._12" artificial="1" throw="" context="_242" access="public" mangled="_ZN19ROBOT_CONTROL_STATED1Ev *INTERNAL* " demangled="ROBOT_CONTROL_STATE::~ROBOT_CONTROL_STATE()" location="f2:166" file="f2" line="166" endline="166" inline="1">
  </Destructor>
  <OperatorMethod id="_794" name="=" returns="_1288" artificial="1" throw="" context="_242" access="public" mangled="_ZN19ROBOT_CONTROL_STATEaSERKS_" demangled="ROBOT_CONTROL_STATE::operator=(ROBOT_CONTROL_STATE const&amp;)" location="f2:166" file="f2" line="166" endline="166" inline="1">
    <Argument type="_1289" location="f2:146" file="f2" line="146"/>
  </OperatorMethod>
  <Constructor id="_795" name="._12" artificial="1" throw="" context="_242" access="public" mangled="_ZN19ROBOT_CONTROL_STATEC1ERKS_ *INTERNAL* " demangled="ROBOT_CONTROL_STATE::ROBOT_CONTROL_STATE(ROBOT_CONTROL_STATE const&amp;)" location="f2:166" file="f2" line="166" endline="166" inline="1">
    <Argument type="_1289" location="f2:146" file="f2" line="146"/>
  </Constructor>
  <Constructor id="_796" name="._12" artificial="1" throw="" context="_242" access="public" mangled="_ZN19ROBOT_CONTROL_STATEC1Ev *INTERNAL* " demangled="ROBOT_CONTROL_STATE::ROBOT_CONTROL_STATE()" location="f2:166" file="f2" line="166" inline="1"/>
  <Field id="_797" name="sample_header" type="_187" offset="0" context="_245" access="public" location="f2:106" file="f2" line="106"/>
  <Field id="_798" name="RTMA_received_time" type="_449" offset="128" context="_245" access="public" location="f2:107" file="f2" line="107"/>
  <Field id="_799" name="Jpos" type="_1290" offset="192" context="_245" access="public" location="f2:108" file="f2" line="108"/>
  <Field id="_800" name="Jvel" type="_1290" offset="640" context="_245" access="public" location="f2:109" file="f2" line="109"/>
  <Field id="_801" name="Cpos" type="_1291" offset="1088" context="_245" access="public" location="f2:110" file="f2" line="110"/>
  <Field id="_802" name="Cori" type="_1291" offset="1280" context="_245" access="public" location="f2:111" file="f2" line="111"/>
  <Field id="_803" name="Cforce" type="_1291" offset="1472" context="_245" access="public" location="f2:112" file="f2" line="112"/>
  <Field id="_804" name="Ctrq" type="_1291" offset="1664" context="_245" access="public" location="f2:113" file="f2" line="113"/>
  <Field id="_805" name="Cvel" type="_1291" offset="1856" context="_245" access="public" location="f2:114" file="f2" line="114"/>
  <Field id="_806" name="CangVel" type="_1291" offset="2048" context="_245" access="public" location="f2:115" file="f2" line="115"/>
  <Field id="_807" name="Hpos" type="_1292" offset="2240" context="_245" access="public" location="f2:116" file="f2" line="116"/>
  <Field id="_808" name="Hstrain" type="_1292" offset="2496" context="_245" access="public" location="f2:117" file="f2" line="117"/>
  <Field id="_809" name="Jtrq" type="_1291" offset="2752" context="_245" access="public" location="f2:118" file="f2" line="118"/>
  <Destructor id="_810" name="._7" artificial="1" throw="" context="_245" access="public" mangled="_ZN18ROBOT_ACTUAL_STATED1Ev *INTERNAL* " demangled="ROBOT_ACTUAL_STATE::~ROBOT_ACTUAL_STATE()" location="f2:119" file="f2" line="119" endline="119" inline="1">
  </Destructor>
  <OperatorMethod id="_811" name="=" returns="_1293" artificial="1" throw="" context="_245" access="public" mangled="_ZN18ROBOT_ACTUAL_STATEaSERKS_" demangled="ROBOT_ACTUAL_STATE::operator=(ROBOT_ACTUAL_STATE const&amp;)" location="f2:119" file="f2" line="119" endline="119" inline="1">
    <Argument type="_1294" location="f2:105" file="f2" line="105"/>
  </OperatorMethod>
  <Constructor id="_812" name="._7" artificial="1" throw="" context="_245" access="public" mangled="_ZN18ROBOT_ACTUAL_STATEC1ERKS_ *INTERNAL* " demangled="ROBOT_ACTUAL_STATE::ROBOT_ACTUAL_STATE(ROBOT_ACTUAL_STATE const&amp;)" location="f2:119" file="f2" line="119" endline="119" inline="1">
    <Argument type="_1294" location="f2:105" file="f2" line="105"/>
  </Constructor>
  <Constructor id="_813" name="._7" artificial="1" throw="" context="_245" access="public" mangled="_ZN18ROBOT_ACTUAL_STATEC1Ev *INTERNAL* " demangled="ROBOT_ACTUAL_STATE::ROBOT_ACTUAL_STATE()" location="f2:119" file="f2" line="119" inline="1"/>
  <Field id="_814" name="Cmd" type="_1234" offset="0" context="_255" access="public" location="f3:223" file="f3" line="223"/>
  <Destructor id="_815" name="._20" artificial="1" throw="" context="_255" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDD1Ev *INTERNAL* " demangled="MDF_OPTO_CNTRL_CMD::~MDF_OPTO_CNTRL_CMD()" location="f3:224" file="f3" line="224" endline="224" inline="1">
  </Destructor>
  <OperatorMethod id="_816" name="=" returns="_1295" artificial="1" throw="" context="_255" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDaSERKS_" demangled="MDF_OPTO_CNTRL_CMD::operator=(MDF_OPTO_CNTRL_CMD const&amp;)" location="f3:224" file="f3" line="224" endline="224" inline="1">
    <Argument type="_1296" location="f3:222" file="f3" line="222"/>
  </OperatorMethod>
  <Constructor id="_817" name="._20" artificial="1" throw="" context="_255" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDC1ERKS_ *INTERNAL* " demangled="MDF_OPTO_CNTRL_CMD::MDF_OPTO_CNTRL_CMD(MDF_OPTO_CNTRL_CMD const&amp;)" location="f3:224" file="f3" line="224" endline="224" inline="1">
    <Argument type="_1296" location="f3:222" file="f3" line="222"/>
  </Constructor>
  <Constructor id="_818" name="._20" artificial="1" throw="" context="_255" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDC1Ev *INTERNAL* " demangled="MDF_OPTO_CNTRL_CMD::MDF_OPTO_CNTRL_CMD()" location="f3:224" file="f3" line="224" inline="1"/>
  <Field id="_819" name="id" type="_531" offset="0" context="_257" access="public" location="f3:333" file="f3" line="333"/>
  <Field id="_820" name="rep_num" type="_531" offset="32" context="_257" access="public" location="f3:334" file="f3" line="334"/>
  <Field id="_821" name="use_for_calib" type="_531" offset="64" context="_257" access="public" location="f3:335" file="f3" line="335"/>
  <Field id="_822" name="target_combo_index" type="_531" offset="96" context="_257" access="public" location="f3:336" file="f3" line="336"/>
  <Field id="_823" name="timed_out_conseq" type="_531" offset="128" context="_257" access="public" location="f3:337" file="f3" line="337"/>
  <Field id="_824" name="reach_offset" type="_531" offset="160" context="_257" access="public" location="f3:338" file="f3" line="338"/>
  <Field id="_825" name="relax_arm" type="_531" offset="192" context="_257" access="public" location="f3:339" file="f3" line="339"/>
  <Field id="_826" name="idle_gateable" type="_531" offset="224" context="_257" access="public" location="f3:340" file="f3" line="340"/>
  <Field id="_827" name="force_gateable" type="_531" offset="256" context="_257" access="public" location="f3:341" file="f3" line="341"/>
  <Field id="_828" name="direction" type="_531" offset="288" context="_257" access="public" location="f3:342" file="f3" line="342"/>
  <Field id="_829" name="idle_timeout" type="_449" offset="320" context="_257" access="public" location="f3:343" file="f3" line="343"/>
  <Field id="_830" name="ts_time" type="_449" offset="384" context="_257" access="public" location="f3:344" file="f3" line="344"/>
  <Field id="_831" name="target" type="_1297" offset="448" context="_257" access="public" location="f3:345" file="f3" line="345"/>
  <Field id="_832" name="coriMatrix" type="_1214" offset="2560" context="_257" access="public" location="f3:346" file="f3" line="346"/>
  <Field id="_833" name="idle_target" type="_1203" offset="3136" context="_257" access="public" location="f3:347" file="f3" line="347"/>
  <Field id="_834" name="trans_threshold" type="_449" offset="4288" context="_257" access="public" location="f3:348" file="f3" line="348"/>
  <Field id="_835" name="ori_threshold" type="_449" offset="4352" context="_257" access="public" location="f3:349" file="f3" line="349"/>
  <Field id="_836" name="trans_threshold_f" type="_449" offset="4416" context="_257" access="public" location="f3:350" file="f3" line="350"/>
  <Field id="_837" name="ori_threshold_f" type="_449" offset="4480" context="_257" access="public" location="f3:351" file="f3" line="351"/>
  <Field id="_838" name="sep_threshold" type="_1252" offset="4544" context="_257" access="public" location="f3:352" file="f3" line="352"/>
  <Field id="_839" name="sep_threshold_f" type="_1252" offset="5312" context="_257" access="public" location="f3:353" file="f3" line="353"/>
  <Field id="_840" name="sep_threshold_judging_polarity" type="_1298" offset="6080" context="_257" access="public" location="f3:354" file="f3" line="354"/>
  <Field id="_841" name="sep_threshold_f_judging_polarity" type="_1298" offset="6464" context="_257" access="public" location="f3:355" file="f3" line="355"/>
  <Field id="_842" name="sep_threshold_judging_outcome" type="_1298" offset="6848" context="_257" access="public" location="f3:356" file="f3" line="356"/>
  <Field id="_843" name="trans_threshold_judging_polarity" type="_531" offset="7232" context="_257" access="public" location="f3:357" file="f3" line="357"/>
  <Field id="_844" name="ori_threshold_judging_polarity" type="_531" offset="7264" context="_257" access="public" location="f3:358" file="f3" line="358"/>
  <Field id="_845" name="trans_threshold_f_judging_polarity" type="_531" offset="7296" context="_257" access="public" location="f3:359" file="f3" line="359"/>
  <Field id="_846" name="ori_threshold_f_judging_polarity" type="_531" offset="7328" context="_257" access="public" location="f3:360" file="f3" line="360"/>
  <Field id="_847" name="handle_judging_polarity" type="_531" offset="7360" context="_257" access="public" location="f3:361" file="f3" line="361"/>
  <Field id="_848" name="handle_judging_outcome" type="_531" offset="7392" context="_257" access="public" location="f3:362" file="f3" line="362"/>
  <Field id="_849" name="timeout" type="_449" offset="7424" context="_257" access="public" location="f3:363" file="f3" line="363"/>
  <Field id="_850" name="tags" type="_1205" offset="7488" context="_257" access="public" location="f3:364" file="f3" line="364"/>
  <Field id="_851" name="fdbk_display_color" type="_1205" offset="8000" context="_257" access="public" location="f3:365" file="f3" line="365"/>
  <Field id="_852" name="background_color" type="_1205" offset="8512" context="_257" access="public" location="f3:366" file="f3" line="366"/>
  <Destructor id="_853" name="._35" artificial="1" throw="" context="_257" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGD1Ev *INTERNAL* " demangled="MDF_TASK_STATE_CONFIG::~MDF_TASK_STATE_CONFIG()" location="f3:367" file="f3" line="367" endline="367" inline="1">
  </Destructor>
  <OperatorMethod id="_854" name="=" returns="_1299" artificial="1" throw="" context="_257" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGaSERKS_" demangled="MDF_TASK_STATE_CONFIG::operator=(MDF_TASK_STATE_CONFIG const&amp;)" location="f3:367" file="f3" line="367" endline="367" inline="1">
    <Argument type="_1300" location="f3:332" file="f3" line="332"/>
  </OperatorMethod>
  <Constructor id="_855" name="._35" artificial="1" throw="" context="_257" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_TASK_STATE_CONFIG::MDF_TASK_STATE_CONFIG(MDF_TASK_STATE_CONFIG const&amp;)" location="f3:367" file="f3" line="367" endline="367" inline="1">
    <Argument type="_1300" location="f3:332" file="f3" line="332"/>
  </Constructor>
  <Constructor id="_856" name="._35" artificial="1" throw="" context="_257" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGC1Ev *INTERNAL* " demangled="MDF_TASK_STATE_CONFIG::MDF_TASK_STATE_CONFIG()" location="f3:367" file="f3" line="367" inline="1"/>
  <Field id="_857" name="DOFCommand" type="_1203" offset="0" context="_259" access="public" location="f2:139" file="f2" line="139"/>
  <Field id="_858" name="JposCommand" type="_1290" offset="1152" context="_259" access="public" location="f2:140" file="f2" line="140"/>
  <Field id="_859" name="controllerId" type="_531" offset="1600" context="_259" access="public" location="f2:141" file="f2" line="141"/>
  <Field id="_860" name="j0nks" type="_531" offset="1632" context="_259" access="public" location="f2:142" file="f2" line="142"/>
  <Destructor id="_861" name="._11" artificial="1" throw="" context="_259" access="public" mangled="_ZN16OVERRIDE_COMMANDD1Ev *INTERNAL* " demangled="OVERRIDE_COMMAND::~OVERRIDE_COMMAND()" location="f2:143" file="f2" line="143" endline="143" inline="1">
  </Destructor>
  <OperatorMethod id="_862" name="=" returns="_1301" artificial="1" throw="" context="_259" access="public" mangled="_ZN16OVERRIDE_COMMANDaSERKS_" demangled="OVERRIDE_COMMAND::operator=(OVERRIDE_COMMAND const&amp;)" location="f2:143" file="f2" line="143" endline="143" inline="1">
    <Argument type="_1302" location="f2:138" file="f2" line="138"/>
  </OperatorMethod>
  <Constructor id="_863" name="._11" artificial="1" throw="" context="_259" access="public" mangled="_ZN16OVERRIDE_COMMANDC1ERKS_ *INTERNAL* " demangled="OVERRIDE_COMMAND::OVERRIDE_COMMAND(OVERRIDE_COMMAND const&amp;)" location="f2:143" file="f2" line="143" endline="143" inline="1">
    <Argument type="_1302" location="f2:138" file="f2" line="138"/>
  </Constructor>
  <Constructor id="_864" name="._11" artificial="1" throw="" context="_259" access="public" mangled="_ZN16OVERRIDE_COMMANDC1Ev *INTERNAL* " demangled="OVERRIDE_COMMAND::OVERRIDE_COMMAND()" location="f2:143" file="f2" line="143" inline="1"/>
  <Field id="_865" name="sample_header" type="_187" offset="0" context="_262" access="public" location="f3:514" file="f3" line="514"/>
  <Field id="_866" name="rdt_sequence" type="_676" offset="128" context="_262" access="public" location="f3:515" file="f3" line="515"/>
  <Field id="_867" name="ft_sequence" type="_676" offset="160" context="_262" access="public" location="f3:516" file="f3" line="516"/>
  <Field id="_868" name="status" type="_676" offset="192" context="_262" access="public" location="f3:517" file="f3" line="517"/>
  <Field id="_869" name="reserved" type="_676" offset="224" context="_262" access="public" location="f3:518" file="f3" line="518"/>
  <Field id="_870" name="data" type="_1234" offset="256" context="_262" access="public" location="f3:519" file="f3" line="519"/>
  <Destructor id="_871" name="._59" artificial="1" throw="" context="_262" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAD1Ev *INTERNAL* " demangled="MDF_RAW_FORCE_SENSOR_DATA::~MDF_RAW_FORCE_SENSOR_DATA()" location="f3:520" file="f3" line="520" endline="520" inline="1">
  </Destructor>
  <OperatorMethod id="_872" name="=" returns="_1303" artificial="1" throw="" context="_262" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAaSERKS_" demangled="MDF_RAW_FORCE_SENSOR_DATA::operator=(MDF_RAW_FORCE_SENSOR_DATA const&amp;)" location="f3:520" file="f3" line="520" endline="520" inline="1">
    <Argument type="_1304" location="f3:513" file="f3" line="513"/>
  </OperatorMethod>
  <Constructor id="_873" name="._59" artificial="1" throw="" context="_262" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAC1ERKS_ *INTERNAL* " demangled="MDF_RAW_FORCE_SENSOR_DATA::MDF_RAW_FORCE_SENSOR_DATA(MDF_RAW_FORCE_SENSOR_DATA const&amp;)" location="f3:520" file="f3" line="520" endline="520" inline="1">
    <Argument type="_1304" location="f3:513" file="f3" line="513"/>
  </Constructor>
  <Constructor id="_874" name="._59" artificial="1" throw="" context="_262" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAC1Ev *INTERNAL* " demangled="MDF_RAW_FORCE_SENSOR_DATA::MDF_RAW_FORCE_SENSOR_DATA()" location="f3:520" file="f3" line="520" inline="1"/>
  <Field id="_875" name="sample_header" type="_187" offset="0" context="_265" access="public" location="f3:117" file="f3" line="117"/>
  <Field id="_876" name="tool_pos" type="_1290" offset="128" context="_265" access="public" location="f3:118" file="f3" line="118"/>
  <Field id="_877" name="wrist_pos" type="_1290" offset="576" context="_265" access="public" location="f3:119" file="f3" line="119"/>
  <Destructor id="_878" name="._17" artificial="1" throw="" context="_265" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_PROBOT_FEEDBACK::~MDF_PROBOT_FEEDBACK()" location="f3:120" file="f3" line="120" endline="120" inline="1">
  </Destructor>
  <OperatorMethod id="_879" name="=" returns="_1305" artificial="1" throw="" context="_265" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKaSERKS_" demangled="MDF_PROBOT_FEEDBACK::operator=(MDF_PROBOT_FEEDBACK const&amp;)" location="f3:120" file="f3" line="120" endline="120" inline="1">
    <Argument type="_1306" location="f3:116" file="f3" line="116"/>
  </OperatorMethod>
  <Constructor id="_880" name="._17" artificial="1" throw="" context="_265" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_PROBOT_FEEDBACK::MDF_PROBOT_FEEDBACK(MDF_PROBOT_FEEDBACK const&amp;)" location="f3:120" file="f3" line="120" endline="120" inline="1">
    <Argument type="_1306" location="f3:116" file="f3" line="116"/>
  </Constructor>
  <Constructor id="_881" name="._17" artificial="1" throw="" context="_265" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_PROBOT_FEEDBACK::MDF_PROBOT_FEEDBACK()" location="f3:120" file="f3" line="120" inline="1"/>
  <Field id="_882" name="command" type="_1203" offset="0" context="_271" access="public" location="f3:217" file="f3" line="217"/>
  <Field id="_883" name="mode" type="_531" offset="1152" context="_271" access="public" location="f3:218" file="f3" line="218"/>
  <Field id="_884" name="reserved" type="_531" offset="1184" context="_271" access="public" location="f3:219" file="f3" line="219"/>
  <Destructor id="_885" name="._19" artificial="1" throw="" context="_271" access="public" mangled="_ZN17MDF_GROBOT_BYPASSD1Ev *INTERNAL* " demangled="MDF_GROBOT_BYPASS::~MDF_GROBOT_BYPASS()" location="f3:220" file="f3" line="220" endline="220" inline="1">
  </Destructor>
  <OperatorMethod id="_886" name="=" returns="_1307" artificial="1" throw="" context="_271" access="public" mangled="_ZN17MDF_GROBOT_BYPASSaSERKS_" demangled="MDF_GROBOT_BYPASS::operator=(MDF_GROBOT_BYPASS const&amp;)" location="f3:220" file="f3" line="220" endline="220" inline="1">
    <Argument type="_1308" location="f3:216" file="f3" line="216"/>
  </OperatorMethod>
  <Constructor id="_887" name="._19" artificial="1" throw="" context="_271" access="public" mangled="_ZN17MDF_GROBOT_BYPASSC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_BYPASS::MDF_GROBOT_BYPASS(MDF_GROBOT_BYPASS const&amp;)" location="f3:220" file="f3" line="220" endline="220" inline="1">
    <Argument type="_1308" location="f3:216" file="f3" line="216"/>
  </Constructor>
  <Constructor id="_888" name="._19" artificial="1" throw="" context="_271" access="public" mangled="_ZN17MDF_GROBOT_BYPASSC1Ev *INTERNAL* " demangled="MDF_GROBOT_BYPASS::MDF_GROBOT_BYPASS()" location="f3:220" file="f3" line="220" inline="1"/>
  <Field id="_889" name="state" type="_531" offset="0" context="_272" access="public" location="f3:451" file="f3" line="451"/>
  <Field id="_890" name="reserved" type="_531" offset="32" context="_272" access="public" location="f3:452" file="f3" line="452"/>
  <Destructor id="_891" name="._50" artificial="1" throw="" context="_272" access="public" mangled="_ZN18MDF_IDLY_LABELLINGD1Ev *INTERNAL* " demangled="MDF_IDLY_LABELLING::~MDF_IDLY_LABELLING()" location="f3:453" file="f3" line="453" endline="453" inline="1">
  </Destructor>
  <OperatorMethod id="_892" name="=" returns="_1309" artificial="1" throw="" context="_272" access="public" mangled="_ZN18MDF_IDLY_LABELLINGaSERKS_" demangled="MDF_IDLY_LABELLING::operator=(MDF_IDLY_LABELLING const&amp;)" location="f3:453" file="f3" line="453" endline="453" inline="1">
    <Argument type="_1310" location="f3:450" file="f3" line="450"/>
  </OperatorMethod>
  <Constructor id="_893" name="._50" artificial="1" throw="" context="_272" access="public" mangled="_ZN18MDF_IDLY_LABELLINGC1ERKS_ *INTERNAL* " demangled="MDF_IDLY_LABELLING::MDF_IDLY_LABELLING(MDF_IDLY_LABELLING const&amp;)" location="f3:453" file="f3" line="453" endline="453" inline="1">
    <Argument type="_1310" location="f3:450" file="f3" line="450"/>
  </Constructor>
  <Constructor id="_894" name="._50" artificial="1" throw="" context="_272" access="public" mangled="_ZN18MDF_IDLY_LABELLINGC1Ev *INTERNAL* " demangled="MDF_IDLY_LABELLING::MDF_IDLY_LABELLING()" location="f3:453" file="f3" line="453" inline="1"/>
  <Field id="_895" name="sample_header" type="_187" offset="0" context="_283" access="public" location="f3:288" file="f3" line="288"/>
  <Field id="_896" name="position" type="_1203" offset="128" context="_283" access="public" location="f3:289" file="f3" line="289"/>
  <Field id="_897" name="velocity" type="_1203" offset="1280" context="_283" access="public" location="f3:290" file="f3" line="290"/>
  <Field id="_898" name="force" type="_1203" offset="2432" context="_283" access="public" location="f3:291" file="f3" line="291"/>
  <Field id="_899" name="cori_matrix" type="_1214" offset="3584" context="_283" access="public" location="f3:292" file="f3" line="292"/>
  <Destructor id="_900" name="._28" artificial="1" throw="" context="_283" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_GROBOT_FEEDBACK::~MDF_GROBOT_FEEDBACK()" location="f3:293" file="f3" line="293" endline="293" inline="1">
  </Destructor>
  <OperatorMethod id="_901" name="=" returns="_1311" artificial="1" throw="" context="_283" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKaSERKS_" demangled="MDF_GROBOT_FEEDBACK::operator=(MDF_GROBOT_FEEDBACK const&amp;)" location="f3:293" file="f3" line="293" endline="293" inline="1">
    <Argument type="_1312" location="f3:287" file="f3" line="287"/>
  </OperatorMethod>
  <Constructor id="_902" name="._28" artificial="1" throw="" context="_283" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_FEEDBACK::MDF_GROBOT_FEEDBACK(MDF_GROBOT_FEEDBACK const&amp;)" location="f3:293" file="f3" line="293" endline="293" inline="1">
    <Argument type="_1312" location="f3:287" file="f3" line="287"/>
  </Constructor>
  <Constructor id="_903" name="._28" artificial="1" throw="" context="_283" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_GROBOT_FEEDBACK::MDF_GROBOT_FEEDBACK()" location="f3:293" file="f3" line="293" inline="1"/>
  <Field id="_904" name="channelNum" type="_676" offset="0" context="_284" access="public" location="f3:538" file="f3" line="538"/>
  <Field id="_905" name="reserved" type="_676" offset="32" context="_284" access="public" location="f3:539" file="f3" line="539"/>
  <Field id="_906" name="name" type="_1205" offset="64" context="_284" access="public" location="f3:540" file="f3" line="540"/>
  <Destructor id="_907" name="._62" artificial="1" throw="" context="_284" access="public" mangled="_ZN10MDF_MUSCLED1Ev *INTERNAL* " demangled="MDF_MUSCLE::~MDF_MUSCLE()" location="f3:541" file="f3" line="541" endline="541" inline="1">
  </Destructor>
  <OperatorMethod id="_908" name="=" returns="_1313" artificial="1" throw="" context="_284" access="public" mangled="_ZN10MDF_MUSCLEaSERKS_" demangled="MDF_MUSCLE::operator=(MDF_MUSCLE const&amp;)" location="f3:541" file="f3" line="541" endline="541" inline="1">
    <Argument type="_1314" location="f3:537" file="f3" line="537"/>
  </OperatorMethod>
  <Constructor id="_909" name="._62" artificial="1" throw="" context="_284" access="public" mangled="_ZN10MDF_MUSCLEC1ERKS_ *INTERNAL* " demangled="MDF_MUSCLE::MDF_MUSCLE(MDF_MUSCLE const&amp;)" location="f3:541" file="f3" line="541" endline="541" inline="1">
    <Argument type="_1314" location="f3:537" file="f3" line="537"/>
  </Constructor>
  <Constructor id="_910" name="._62" artificial="1" throw="" context="_284" access="public" mangled="_ZN10MDF_MUSCLEC1Ev *INTERNAL* " demangled="MDF_MUSCLE::MDF_MUSCLE()" location="f3:541" file="f3" line="541" inline="1"/>
  <Field id="_911" name="rep_no" type="_531" offset="0" context="_287" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_912" name="trial_no" type="_531" offset="32" context="_287" access="public" location="f4:103" file="f4" line="103"/>
  <Field id="_913" name="num_reward_states" type="_531" offset="64" context="_287" access="public" location="f4:104" file="f4" line="104"/>
  <Field id="_914" name="reserved" type="_531" offset="96" context="_287" access="public" location="f4:105" file="f4" line="105"/>
  <Destructor id="_915" name="._72" artificial="1" throw="" context="_287" access="public" mangled="_ZN16MDF_TRIAL_CONFIGD1Ev *INTERNAL* " demangled="MDF_TRIAL_CONFIG::~MDF_TRIAL_CONFIG()" location="f4:106" file="f4" line="106" endline="106" inline="1">
  </Destructor>
  <OperatorMethod id="_916" name="=" returns="_1315" artificial="1" throw="" context="_287" access="public" mangled="_ZN16MDF_TRIAL_CONFIGaSERKS_" demangled="MDF_TRIAL_CONFIG::operator=(MDF_TRIAL_CONFIG const&amp;)" location="f4:106" file="f4" line="106" endline="106" inline="1">
    <Argument type="_1316" location="f4:101" file="f4" line="101"/>
  </OperatorMethod>
  <Constructor id="_917" name="._72" artificial="1" throw="" context="_287" access="public" mangled="_ZN16MDF_TRIAL_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_TRIAL_CONFIG::MDF_TRIAL_CONFIG(MDF_TRIAL_CONFIG const&amp;)" location="f4:106" file="f4" line="106" endline="106" inline="1">
    <Argument type="_1316" location="f4:101" file="f4" line="101"/>
  </Constructor>
  <Constructor id="_918" name="._72" artificial="1" throw="" context="_287" access="public" mangled="_ZN16MDF_TRIAL_CONFIGC1Ev *INTERNAL* " demangled="MDF_TRIAL_CONFIG::MDF_TRIAL_CONFIG()" location="f4:106" file="f4" line="106" inline="1"/>
  <Field id="_919" name="sample_header" type="_187" offset="0" context="_293" access="public" location="f3:494" file="f3" line="494"/>
  <Field id="_920" name="pos" type="_1317" offset="128" context="_293" access="public" location="f3:495" file="f3" line="495"/>
  <Field id="_921" name="controlledDims" type="_1318" offset="640" context="_293" access="public" location="f3:496" file="f3" line="496"/>
  <Field id="_922" name="overrideDims" type="_1318" offset="896" context="_293" access="public" location="f3:497" file="f3" line="497"/>
  <Destructor id="_923" name="._56" artificial="1" throw="" context="_293" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDD1Ev *INTERNAL* " demangled="MDF_ROBOT_JOINT_COMMAND::~MDF_ROBOT_JOINT_COMMAND()" location="f3:498" file="f3" line="498" endline="498" inline="1">
  </Destructor>
  <OperatorMethod id="_924" name="=" returns="_1319" artificial="1" throw="" context="_293" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDaSERKS_" demangled="MDF_ROBOT_JOINT_COMMAND::operator=(MDF_ROBOT_JOINT_COMMAND const&amp;)" location="f3:498" file="f3" line="498" endline="498" inline="1">
    <Argument type="_1320" location="f3:493" file="f3" line="493"/>
  </OperatorMethod>
  <Constructor id="_925" name="._56" artificial="1" throw="" context="_293" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDC1ERKS_ *INTERNAL* " demangled="MDF_ROBOT_JOINT_COMMAND::MDF_ROBOT_JOINT_COMMAND(MDF_ROBOT_JOINT_COMMAND const&amp;)" location="f3:498" file="f3" line="498" endline="498" inline="1">
    <Argument type="_1320" location="f3:493" file="f3" line="493"/>
  </Constructor>
  <Constructor id="_926" name="._56" artificial="1" throw="" context="_293" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDC1Ev *INTERNAL* " demangled="MDF_ROBOT_JOINT_COMMAND::MDF_ROBOT_JOINT_COMMAND()" location="f3:498" file="f3" line="498" inline="1"/>
  <Field id="_927" name="next_tool_id" type="_531" offset="0" context="_297" access="public" location="f3:319" file="f3" line="319"/>
  <Field id="_928" name="reserved" type="_531" offset="32" context="_297" access="public" location="f3:320" file="f3" line="320"/>
  <Destructor id="_929" name="._33" artificial="1" throw="" context="_297" access="public" mangled="_ZN15MDF_CHANGE_TOOLD1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL::~MDF_CHANGE_TOOL()" location="f3:321" file="f3" line="321" endline="321" inline="1">
  </Destructor>
  <OperatorMethod id="_930" name="=" returns="_1321" artificial="1" throw="" context="_297" access="public" mangled="_ZN15MDF_CHANGE_TOOLaSERKS_" demangled="MDF_CHANGE_TOOL::operator=(MDF_CHANGE_TOOL const&amp;)" location="f3:321" file="f3" line="321" endline="321" inline="1">
    <Argument type="_1322" location="f3:318" file="f3" line="318"/>
  </OperatorMethod>
  <Constructor id="_931" name="._33" artificial="1" throw="" context="_297" access="public" mangled="_ZN15MDF_CHANGE_TOOLC1ERKS_ *INTERNAL* " demangled="MDF_CHANGE_TOOL::MDF_CHANGE_TOOL(MDF_CHANGE_TOOL const&amp;)" location="f3:321" file="f3" line="321" endline="321" inline="1">
    <Argument type="_1322" location="f3:318" file="f3" line="318"/>
  </Constructor>
  <Constructor id="_932" name="._33" artificial="1" throw="" context="_297" access="public" mangled="_ZN15MDF_CHANGE_TOOLC1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL::MDF_CHANGE_TOOL()" location="f3:321" file="f3" line="321" inline="1"/>
  <Field id="_933" name="sample_header" type="_187" offset="0" context="_301" access="public" location="f3:393" file="f3" line="393"/>
  <Field id="_934" name="source_timestamp" type="_449" offset="128" context="_301" access="public" location="f3:394" file="f3" line="394"/>
  <Field id="_935" name="count_interval" type="_449" offset="192" context="_301" access="public" location="f3:395" file="f3" line="395"/>
  <Field id="_936" name="rates" type="_1323" offset="256" context="_301" access="public" location="f3:396" file="f3" line="396"/>
  <Destructor id="_937" name="._40" artificial="1" throw="" context="_301" access="public" mangled="_ZN18MDF_SPM_FIRINGRATED1Ev *INTERNAL* " demangled="MDF_SPM_FIRINGRATE::~MDF_SPM_FIRINGRATE()" location="f3:397" file="f3" line="397" endline="397" inline="1">
  </Destructor>
  <OperatorMethod id="_938" name="=" returns="_1324" artificial="1" throw="" context="_301" access="public" mangled="_ZN18MDF_SPM_FIRINGRATEaSERKS_" demangled="MDF_SPM_FIRINGRATE::operator=(MDF_SPM_FIRINGRATE const&amp;)" location="f3:397" file="f3" line="397" endline="397" inline="1">
    <Argument type="_1325" location="f3:392" file="f3" line="392"/>
  </OperatorMethod>
  <Constructor id="_939" name="._40" artificial="1" throw="" context="_301" access="public" mangled="_ZN18MDF_SPM_FIRINGRATEC1ERKS_ *INTERNAL* " demangled="MDF_SPM_FIRINGRATE::MDF_SPM_FIRINGRATE(MDF_SPM_FIRINGRATE const&amp;)" location="f3:397" file="f3" line="397" endline="397" inline="1">
    <Argument type="_1325" location="f3:392" file="f3" line="392"/>
  </Constructor>
  <Constructor id="_940" name="._40" artificial="1" throw="" context="_301" access="public" mangled="_ZN18MDF_SPM_FIRINGRATEC1Ev *INTERNAL* " demangled="MDF_SPM_FIRINGRATE::MDF_SPM_FIRINGRATE()" location="f3:397" file="f3" line="397" inline="1"/>
  <Field id="_941" name="distanceFromCenter" type="_449" offset="0" context="_303" access="public" location="f3:584" file="f3" line="584"/>
  <Destructor id="_942" name="._69" artificial="1" throw="" context="_303" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_RT_POSITION_FEEDBACK::~MDF_RT_POSITION_FEEDBACK()" location="f3:585" file="f3" line="585" endline="585" inline="1">
  </Destructor>
  <OperatorMethod id="_943" name="=" returns="_1326" artificial="1" throw="" context="_303" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKaSERKS_" demangled="MDF_RT_POSITION_FEEDBACK::operator=(MDF_RT_POSITION_FEEDBACK const&amp;)" location="f3:585" file="f3" line="585" endline="585" inline="1">
    <Argument type="_1327" location="f3:583" file="f3" line="583"/>
  </OperatorMethod>
  <Constructor id="_944" name="._69" artificial="1" throw="" context="_303" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_RT_POSITION_FEEDBACK::MDF_RT_POSITION_FEEDBACK(MDF_RT_POSITION_FEEDBACK const&amp;)" location="f3:585" file="f3" line="585" endline="585" inline="1">
    <Argument type="_1327" location="f3:583" file="f3" line="583"/>
  </Constructor>
  <Constructor id="_945" name="._69" artificial="1" throw="" context="_303" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_RT_POSITION_FEEDBACK::MDF_RT_POSITION_FEEDBACK()" location="f3:585" file="f3" line="585" inline="1"/>
  <Field id="_946" name="source_index" type="_531" offset="0" context="_312" access="public" location="f3:382" file="f3" line="382"/>
  <Field id="_947" name="reserved" type="_531" offset="32" context="_312" access="public" location="f3:383" file="f3" line="383"/>
  <Field id="_948" name="source_timestamp" type="_449" offset="64" context="_312" access="public" location="f3:384" file="f3" line="384"/>
  <Destructor id="_949" name="._38" artificial="1" throw="" context="_312" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSED1Ev *INTERNAL* " demangled="MDF_RAW_SAMPLE_RESPONSE::~MDF_RAW_SAMPLE_RESPONSE()" location="f3:385" file="f3" line="385" endline="385" inline="1">
  </Destructor>
  <OperatorMethod id="_950" name="=" returns="_1328" artificial="1" throw="" context="_312" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSEaSERKS_" demangled="MDF_RAW_SAMPLE_RESPONSE::operator=(MDF_RAW_SAMPLE_RESPONSE const&amp;)" location="f3:385" file="f3" line="385" endline="385" inline="1">
    <Argument type="_1329" location="f3:381" file="f3" line="381"/>
  </OperatorMethod>
  <Constructor id="_951" name="._38" artificial="1" throw="" context="_312" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSEC1ERKS_ *INTERNAL* " demangled="MDF_RAW_SAMPLE_RESPONSE::MDF_RAW_SAMPLE_RESPONSE(MDF_RAW_SAMPLE_RESPONSE const&amp;)" location="f3:385" file="f3" line="385" endline="385" inline="1">
    <Argument type="_1329" location="f3:381" file="f3" line="381"/>
  </Constructor>
  <Constructor id="_952" name="._38" artificial="1" throw="" context="_312" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSEC1Ev *INTERNAL* " demangled="MDF_RAW_SAMPLE_RESPONSE::MDF_RAW_SAMPLE_RESPONSE()" location="f3:385" file="f3" line="385" inline="1"/>
  <Field id="_953" name="sample_header" type="_187" offset="0" context="_315" access="public" location="f3:210" file="f3" line="210"/>
  <Field id="_954" name="command" type="_1203" offset="128" context="_315" access="public" location="f3:211" file="f3" line="211"/>
  <Field id="_955" name="mode" type="_531" offset="1280" context="_315" access="public" location="f3:212" file="f3" line="212"/>
  <Field id="_956" name="reserved" type="_531" offset="1312" context="_315" access="public" location="f3:213" file="f3" line="213"/>
  <Destructor id="_957" name="._18" artificial="1" throw="" context="_315" access="public" mangled="_ZN18MDF_GROBOT_COMMANDD1Ev *INTERNAL* " demangled="MDF_GROBOT_COMMAND::~MDF_GROBOT_COMMAND()" location="f3:214" file="f3" line="214" endline="214" inline="1">
  </Destructor>
  <OperatorMethod id="_958" name="=" returns="_1330" artificial="1" throw="" context="_315" access="public" mangled="_ZN18MDF_GROBOT_COMMANDaSERKS_" demangled="MDF_GROBOT_COMMAND::operator=(MDF_GROBOT_COMMAND const&amp;)" location="f3:214" file="f3" line="214" endline="214" inline="1">
    <Argument type="_1331" location="f3:209" file="f3" line="209"/>
  </OperatorMethod>
  <Constructor id="_959" name="._18" artificial="1" throw="" context="_315" access="public" mangled="_ZN18MDF_GROBOT_COMMANDC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_COMMAND::MDF_GROBOT_COMMAND(MDF_GROBOT_COMMAND const&amp;)" location="f3:214" file="f3" line="214" endline="214" inline="1">
    <Argument type="_1331" location="f3:209" file="f3" line="209"/>
  </Constructor>
  <Constructor id="_960" name="._18" artificial="1" throw="" context="_315" access="public" mangled="_ZN18MDF_GROBOT_COMMANDC1Ev *INTERNAL* " demangled="MDF_GROBOT_COMMAND::MDF_GROBOT_COMMAND()" location="f3:214" file="f3" line="214" inline="1"/>
  <Field id="_961" name="virtualPadPosition" type="_1203" offset="0" context="_318" access="public" location="f2:75" file="f2" line="75"/>
  <Field id="_962" name="centralPointPosition" type="_1291" offset="1152" context="_318" access="public" location="f2:76" file="f2" line="76"/>
  <Field id="_963" name="posMin" type="_1203" offset="1344" context="_318" access="public" location="f2:77" file="f2" line="77"/>
  <Field id="_964" name="posMax" type="_1203" offset="2496" context="_318" access="public" location="f2:78" file="f2" line="78"/>
  <Field id="_965" name="velMin" type="_1203" offset="3648" context="_318" access="public" location="f2:79" file="f2" line="79"/>
  <Field id="_966" name="velMax" type="_1203" offset="4800" context="_318" access="public" location="f2:80" file="f2" line="80"/>
  <Field id="_967" name="graspingGraspApertureTarget" type="_449" offset="5952" context="_318" access="public" location="f2:81" file="f2" line="81"/>
  <Field id="_968" name="graspingOpenApertureTarget" type="_449" offset="6016" context="_318" access="public" location="f2:82" file="f2" line="82"/>
  <Field id="_969" name="graspingIntermediateApertureTarget" type="_449" offset="6080" context="_318" access="public" location="f2:83" file="f2" line="83"/>
  <Field id="_970" name="maxApproachSwingAngle" type="_449" offset="6144" context="_318" access="public" location="f2:84" file="f2" line="84"/>
  <Field id="_971" name="graspTooCloseIfClosedRadius" type="_449" offset="6208" context="_318" access="public" location="f2:85" file="f2" line="85"/>
  <Destructor id="_972" name="._5" artificial="1" throw="" context="_318" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSD1Ev *INTERNAL* " demangled="AUTOMAGIC_CONTROLLER_PARAMS::~AUTOMAGIC_CONTROLLER_PARAMS()" location="f2:86" file="f2" line="86" endline="86" inline="1">
  </Destructor>
  <OperatorMethod id="_973" name="=" returns="_1332" artificial="1" throw="" context="_318" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSaSERKS_" demangled="AUTOMAGIC_CONTROLLER_PARAMS::operator=(AUTOMAGIC_CONTROLLER_PARAMS const&amp;)" location="f2:86" file="f2" line="86" endline="86" inline="1">
    <Argument type="_1333" location="f2:74" file="f2" line="74"/>
  </OperatorMethod>
  <Constructor id="_974" name="._5" artificial="1" throw="" context="_318" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSC1ERKS_ *INTERNAL* " demangled="AUTOMAGIC_CONTROLLER_PARAMS::AUTOMAGIC_CONTROLLER_PARAMS(AUTOMAGIC_CONTROLLER_PARAMS const&amp;)" location="f2:86" file="f2" line="86" endline="86" inline="1">
    <Argument type="_1333" location="f2:74" file="f2" line="74"/>
  </Constructor>
  <Constructor id="_975" name="._5" artificial="1" throw="" context="_318" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSC1Ev *INTERNAL* " demangled="AUTOMAGIC_CONTROLLER_PARAMS::AUTOMAGIC_CONTROLLER_PARAMS()" location="f2:86" file="f2" line="86" inline="1"/>
  <Field id="_976" name="D" type="_1226" offset="0" context="_326" access="public" location="f2:71" file="f2" line="71"/>
  <Destructor id="_977" name="._4" artificial="1" throw="" context="_326" access="public" mangled="_ZN20PLAN_PROCESSOR_STATED1Ev *INTERNAL* " demangled="PLAN_PROCESSOR_STATE::~PLAN_PROCESSOR_STATE()" location="f2:72" file="f2" line="72" endline="72" inline="1">
  </Destructor>
  <OperatorMethod id="_978" name="=" returns="_1334" artificial="1" throw="" context="_326" access="public" mangled="_ZN20PLAN_PROCESSOR_STATEaSERKS_" demangled="PLAN_PROCESSOR_STATE::operator=(PLAN_PROCESSOR_STATE const&amp;)" location="f2:72" file="f2" line="72" endline="72" inline="1">
    <Argument type="_1335" location="f2:70" file="f2" line="70"/>
  </OperatorMethod>
  <Constructor id="_979" name="._4" artificial="1" throw="" context="_326" access="public" mangled="_ZN20PLAN_PROCESSOR_STATEC1ERKS_ *INTERNAL* " demangled="PLAN_PROCESSOR_STATE::PLAN_PROCESSOR_STATE(PLAN_PROCESSOR_STATE const&amp;)" location="f2:72" file="f2" line="72" endline="72" inline="1">
    <Argument type="_1335" location="f2:70" file="f2" line="70"/>
  </Constructor>
  <Constructor id="_980" name="._4" artificial="1" throw="" context="_326" access="public" mangled="_ZN20PLAN_PROCESSOR_STATEC1Ev *INTERNAL* " demangled="PLAN_PROCESSOR_STATE::PLAN_PROCESSOR_STATE()" location="f2:72" file="f2" line="72" inline="1"/>
  <Field id="_981" name="sample_header" type="_187" offset="0" context="_342" access="public" location="f3:555" file="f3" line="555"/>
  <Field id="_982" name="data" type="_1317" offset="128" context="_342" access="public" location="f3:556" file="f3" line="556"/>
  <Destructor id="_983" name="._65" artificial="1" throw="" context="_342" access="public" mangled="_ZN12MDF_FSR_DATAD1Ev *INTERNAL* " demangled="MDF_FSR_DATA::~MDF_FSR_DATA()" location="f3:557" file="f3" line="557" endline="557" inline="1">
  </Destructor>
  <OperatorMethod id="_984" name="=" returns="_1336" artificial="1" throw="" context="_342" access="public" mangled="_ZN12MDF_FSR_DATAaSERKS_" demangled="MDF_FSR_DATA::operator=(MDF_FSR_DATA const&amp;)" location="f3:557" file="f3" line="557" endline="557" inline="1">
    <Argument type="_1337" location="f3:554" file="f3" line="554"/>
  </OperatorMethod>
  <Constructor id="_985" name="._65" artificial="1" throw="" context="_342" access="public" mangled="_ZN12MDF_FSR_DATAC1ERKS_ *INTERNAL* " demangled="MDF_FSR_DATA::MDF_FSR_DATA(MDF_FSR_DATA const&amp;)" location="f3:557" file="f3" line="557" endline="557" inline="1">
    <Argument type="_1337" location="f3:554" file="f3" line="554"/>
  </Constructor>
  <Constructor id="_986" name="._65" artificial="1" throw="" context="_342" access="public" mangled="_ZN12MDF_FSR_DATAC1Ev *INTERNAL* " demangled="MDF_FSR_DATA::MDF_FSR_DATA()" location="f3:557" file="f3" line="557" inline="1"/>
  <Field id="_987" name="config" type="_1205" offset="0" context="_350" access="public" location="f3:426" file="f3" line="426"/>
  <Destructor id="_988" name="._46" artificial="1" throw="" context="_350" access="public" mangled="_ZN13MDF_APP_STARTD1Ev *INTERNAL* " demangled="MDF_APP_START::~MDF_APP_START()" location="f3:427" file="f3" line="427" endline="427" inline="1">
  </Destructor>
  <OperatorMethod id="_989" name="=" returns="_1338" artificial="1" throw="" context="_350" access="public" mangled="_ZN13MDF_APP_STARTaSERKS_" demangled="MDF_APP_START::operator=(MDF_APP_START const&amp;)" location="f3:427" file="f3" line="427" endline="427" inline="1">
    <Argument type="_1339" location="f3:425" file="f3" line="425"/>
  </OperatorMethod>
  <Constructor id="_990" name="._46" artificial="1" throw="" context="_350" access="public" mangled="_ZN13MDF_APP_STARTC1ERKS_ *INTERNAL* " demangled="MDF_APP_START::MDF_APP_START(MDF_APP_START const&amp;)" location="f3:427" file="f3" line="427" endline="427" inline="1">
    <Argument type="_1339" location="f3:425" file="f3" line="425"/>
  </Constructor>
  <Constructor id="_991" name="._46" artificial="1" throw="" context="_350" access="public" mangled="_ZN13MDF_APP_STARTC1Ev *INTERNAL* " demangled="MDF_APP_START::MDF_APP_START()" location="f3:427" file="f3" line="427" inline="1"/>
  <Field id="_992" name="speed" type="_449" offset="0" context="_352" access="public" location="f4:210" file="f4" line="210"/>
  <Destructor id="_993" name="._79" artificial="1" throw="" context="_352" access="public" mangled="_ZN19MDF_DENSO_SET_SPEEDD1Ev *INTERNAL* " demangled="MDF_DENSO_SET_SPEED::~MDF_DENSO_SET_SPEED()" location="f4:211" file="f4" line="211" endline="211" inline="1">
  </Destructor>
  <OperatorMethod id="_994" name="=" returns="_1340" artificial="1" throw="" context="_352" access="public" mangled="_ZN19MDF_DENSO_SET_SPEEDaSERKS_" demangled="MDF_DENSO_SET_SPEED::operator=(MDF_DENSO_SET_SPEED const&amp;)" location="f4:211" file="f4" line="211" endline="211" inline="1">
    <Argument type="_1341" location="f4:209" file="f4" line="209"/>
  </OperatorMethod>
  <Constructor id="_995" name="._79" artificial="1" throw="" context="_352" access="public" mangled="_ZN19MDF_DENSO_SET_SPEEDC1ERKS_ *INTERNAL* " demangled="MDF_DENSO_SET_SPEED::MDF_DENSO_SET_SPEED(MDF_DENSO_SET_SPEED const&amp;)" location="f4:211" file="f4" line="211" endline="211" inline="1">
    <Argument type="_1341" location="f4:209" file="f4" line="209"/>
  </Constructor>
  <Constructor id="_996" name="._79" artificial="1" throw="" context="_352" access="public" mangled="_ZN19MDF_DENSO_SET_SPEEDC1Ev *INTERNAL* " demangled="MDF_DENSO_SET_SPEED::MDF_DENSO_SET_SPEED()" location="f4:211" file="f4" line="211" inline="1"/>
  <Field id="_997" name="sample_header" type="_187" offset="0" context="_360" access="public" location="f3:456" file="f3" line="456"/>
  <Field id="_998" name="drift_correction" type="_1203" offset="128" context="_360" access="public" location="f3:457" file="f3" line="457"/>
  <Destructor id="_999" name="._51" artificial="1" throw="" context="_360" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIOND1Ev *INTERNAL* " demangled="MDF_EM_DRIFT_CORRECTION::~MDF_EM_DRIFT_CORRECTION()" location="f3:458" file="f3" line="458" endline="458" inline="1">
  </Destructor>
  <OperatorMethod id="_1000" name="=" returns="_1342" artificial="1" throw="" context="_360" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIONaSERKS_" demangled="MDF_EM_DRIFT_CORRECTION::operator=(MDF_EM_DRIFT_CORRECTION const&amp;)" location="f3:458" file="f3" line="458" endline="458" inline="1">
    <Argument type="_1343" location="f3:455" file="f3" line="455"/>
  </OperatorMethod>
  <Constructor id="_1001" name="._51" artificial="1" throw="" context="_360" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIONC1ERKS_ *INTERNAL* " demangled="MDF_EM_DRIFT_CORRECTION::MDF_EM_DRIFT_CORRECTION(MDF_EM_DRIFT_CORRECTION const&amp;)" location="f3:458" file="f3" line="458" endline="458" inline="1">
    <Argument type="_1343" location="f3:455" file="f3" line="455"/>
  </Constructor>
  <Constructor id="_1002" name="._51" artificial="1" throw="" context="_360" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIONC1Ev *INTERNAL* " demangled="MDF_EM_DRIFT_CORRECTION::MDF_EM_DRIFT_CORRECTION()" location="f3:458" file="f3" line="458" inline="1"/>
  <Field id="_1003" name="Cmd" type="_1292" offset="0" context="_361" access="public" location="f3:227" file="f3" line="227"/>
  <Destructor id="_1004" name="._21" artificial="1" throw="" context="_361" access="public" mangled="_ZN16MDF_OPTO_POS_CMDD1Ev *INTERNAL* " demangled="MDF_OPTO_POS_CMD::~MDF_OPTO_POS_CMD()" location="f3:228" file="f3" line="228" endline="228" inline="1">
  </Destructor>
  <OperatorMethod id="_1005" name="=" returns="_1344" artificial="1" throw="" context="_361" access="public" mangled="_ZN16MDF_OPTO_POS_CMDaSERKS_" demangled="MDF_OPTO_POS_CMD::operator=(MDF_OPTO_POS_CMD const&amp;)" location="f3:228" file="f3" line="228" endline="228" inline="1">
    <Argument type="_1345" location="f3:226" file="f3" line="226"/>
  </OperatorMethod>
  <Constructor id="_1006" name="._21" artificial="1" throw="" context="_361" access="public" mangled="_ZN16MDF_OPTO_POS_CMDC1ERKS_ *INTERNAL* " demangled="MDF_OPTO_POS_CMD::MDF_OPTO_POS_CMD(MDF_OPTO_POS_CMD const&amp;)" location="f3:228" file="f3" line="228" endline="228" inline="1">
    <Argument type="_1345" location="f3:226" file="f3" line="226"/>
  </Constructor>
  <Constructor id="_1007" name="._21" artificial="1" throw="" context="_361" access="public" mangled="_ZN16MDF_OPTO_POS_CMDC1Ev *INTERNAL* " demangled="MDF_OPTO_POS_CMD::MDF_OPTO_POS_CMD()" location="f3:228" file="f3" line="228" inline="1"/>
  <Field id="_1008" name="sample_header" type="_187" offset="0" context="_378" access="public" location="f3:308" file="f3" line="308"/>
  <Field id="_1009" name="data" type="_1346" offset="128" context="_378" access="public" location="f3:309" file="f3" line="309"/>
  <Destructor id="_1010" name="._31" artificial="1" throw="" context="_378" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAD1Ev *INTERNAL* " demangled="MDF_MICROSTRAIN_DATA::~MDF_MICROSTRAIN_DATA()" location="f3:310" file="f3" line="310" endline="310" inline="1">
  </Destructor>
  <OperatorMethod id="_1011" name="=" returns="_1347" artificial="1" throw="" context="_378" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAaSERKS_" demangled="MDF_MICROSTRAIN_DATA::operator=(MDF_MICROSTRAIN_DATA const&amp;)" location="f3:310" file="f3" line="310" endline="310" inline="1">
    <Argument type="_1348" location="f3:307" file="f3" line="307"/>
  </OperatorMethod>
  <Constructor id="_1012" name="._31" artificial="1" throw="" context="_378" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAC1ERKS_ *INTERNAL* " demangled="MDF_MICROSTRAIN_DATA::MDF_MICROSTRAIN_DATA(MDF_MICROSTRAIN_DATA const&amp;)" location="f3:310" file="f3" line="310" endline="310" inline="1">
    <Argument type="_1348" location="f3:307" file="f3" line="307"/>
  </Constructor>
  <Constructor id="_1013" name="._31" artificial="1" throw="" context="_378" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAC1Ev *INTERNAL* " demangled="MDF_MICROSTRAIN_DATA::MDF_MICROSTRAIN_DATA()" location="f3:310" file="f3" line="310" inline="1"/>
  <Field id="_1014" name="target" type="_1203" offset="0" context="_382" access="public" location="f3:489" file="f3" line="489"/>
  <Field id="_1015" name="coriMatrix" type="_1214" offset="1152" context="_382" access="public" location="f3:490" file="f3" line="490"/>
  <Destructor id="_1016" name="._55" artificial="1" throw="" context="_382" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGD1Ev *INTERNAL* " demangled="MDF_PLANNER_CONTROL_CONFIG::~MDF_PLANNER_CONTROL_CONFIG()" location="f3:491" file="f3" line="491" endline="491" inline="1">
  </Destructor>
  <OperatorMethod id="_1017" name="=" returns="_1349" artificial="1" throw="" context="_382" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGaSERKS_" demangled="MDF_PLANNER_CONTROL_CONFIG::operator=(MDF_PLANNER_CONTROL_CONFIG const&amp;)" location="f3:491" file="f3" line="491" endline="491" inline="1">
    <Argument type="_1350" location="f3:488" file="f3" line="488"/>
  </OperatorMethod>
  <Constructor id="_1018" name="._55" artificial="1" throw="" context="_382" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_PLANNER_CONTROL_CONFIG::MDF_PLANNER_CONTROL_CONFIG(MDF_PLANNER_CONTROL_CONFIG const&amp;)" location="f3:491" file="f3" line="491" endline="491" inline="1">
    <Argument type="_1350" location="f3:488" file="f3" line="488"/>
  </Constructor>
  <Constructor id="_1019" name="._55" artificial="1" throw="" context="_382" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGC1Ev *INTERNAL* " demangled="MDF_PLANNER_CONTROL_CONFIG::MDF_PLANNER_CONTROL_CONFIG()" location="f3:491" file="f3" line="491" inline="1"/>
  <Field id="_1020" name="id" type="_531" offset="0" context="_383" access="public" location="f3:370" file="f3" line="370"/>
  <Field id="_1021" name="reserved" type="_531" offset="32" context="_383" access="public" location="f3:371" file="f3" line="371"/>
  <Field id="_1022" name="reason" type="_1205" offset="64" context="_383" access="public" location="f3:372" file="f3" line="372"/>
  <Destructor id="_1023" name="._36" artificial="1" throw="" context="_383" access="public" mangled="_ZN17MDF_JUDGE_VERDICTD1Ev *INTERNAL* " demangled="MDF_JUDGE_VERDICT::~MDF_JUDGE_VERDICT()" location="f3:373" file="f3" line="373" endline="373" inline="1">
  </Destructor>
  <OperatorMethod id="_1024" name="=" returns="_1351" artificial="1" throw="" context="_383" access="public" mangled="_ZN17MDF_JUDGE_VERDICTaSERKS_" demangled="MDF_JUDGE_VERDICT::operator=(MDF_JUDGE_VERDICT const&amp;)" location="f3:373" file="f3" line="373" endline="373" inline="1">
    <Argument type="_1352" location="f3:369" file="f3" line="369"/>
  </OperatorMethod>
  <Constructor id="_1025" name="._36" artificial="1" throw="" context="_383" access="public" mangled="_ZN17MDF_JUDGE_VERDICTC1ERKS_ *INTERNAL* " demangled="MDF_JUDGE_VERDICT::MDF_JUDGE_VERDICT(MDF_JUDGE_VERDICT const&amp;)" location="f3:373" file="f3" line="373" endline="373" inline="1">
    <Argument type="_1352" location="f3:369" file="f3" line="369"/>
  </Constructor>
  <Constructor id="_1026" name="._36" artificial="1" throw="" context="_383" access="public" mangled="_ZN17MDF_JUDGE_VERDICTC1Ev *INTERNAL* " demangled="MDF_JUDGE_VERDICT::MDF_JUDGE_VERDICT()" location="f3:373" file="f3" line="373" inline="1"/>
  <Field id="_1027" name="chosen_channel_mask" type="_1353" offset="0" context="_387" access="public" location="f3:315" file="f3" line="315"/>
  <Destructor id="_1028" name="._32" artificial="1" throw="" context="_387" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGD1Ev *INTERNAL* " demangled="MDF_EM_OVERRIDE_CONFIG::~MDF_EM_OVERRIDE_CONFIG()" location="f3:316" file="f3" line="316" endline="316" inline="1">
  </Destructor>
  <OperatorMethod id="_1029" name="=" returns="_1354" artificial="1" throw="" context="_387" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGaSERKS_" demangled="MDF_EM_OVERRIDE_CONFIG::operator=(MDF_EM_OVERRIDE_CONFIG const&amp;)" location="f3:316" file="f3" line="316" endline="316" inline="1">
    <Argument type="_1355" location="f3:314" file="f3" line="314"/>
  </OperatorMethod>
  <Constructor id="_1030" name="._32" artificial="1" throw="" context="_387" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_EM_OVERRIDE_CONFIG::MDF_EM_OVERRIDE_CONFIG(MDF_EM_OVERRIDE_CONFIG const&amp;)" location="f3:316" file="f3" line="316" endline="316" inline="1">
    <Argument type="_1355" location="f3:314" file="f3" line="314"/>
  </Constructor>
  <Constructor id="_1031" name="._32" artificial="1" throw="" context="_387" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGC1Ev *INTERNAL* " demangled="MDF_EM_OVERRIDE_CONFIG::MDF_EM_OVERRIDE_CONFIG()" location="f3:316" file="f3" line="316" inline="1"/>
  <Field id="_1032" name="XorYorZ" type="_531" offset="0" context="_405" access="public" location="f3:575" file="f3" line="575"/>
  <Field id="_1033" name="UpOrDown" type="_531" offset="32" context="_405" access="public" location="f3:576" file="f3" line="576"/>
  <Field id="_1034" name="forceThreshold" type="_449" offset="64" context="_405" access="public" location="f3:577" file="f3" line="577"/>
  <Field id="_1035" name="targetDistance" type="_449" offset="128" context="_405" access="public" location="f3:578" file="f3" line="578"/>
  <Field id="_1036" name="targetError" type="_449" offset="192" context="_405" access="public" location="f3:579" file="f3" line="579"/>
  <Destructor id="_1037" name="._68" artificial="1" throw="" context="_405" access="public" mangled="_ZN15MDF_TRIAL_INPUTD1Ev *INTERNAL* " demangled="MDF_TRIAL_INPUT::~MDF_TRIAL_INPUT()" location="f3:580" file="f3" line="580" endline="580" inline="1">
  </Destructor>
  <OperatorMethod id="_1038" name="=" returns="_1356" artificial="1" throw="" context="_405" access="public" mangled="_ZN15MDF_TRIAL_INPUTaSERKS_" demangled="MDF_TRIAL_INPUT::operator=(MDF_TRIAL_INPUT const&amp;)" location="f3:580" file="f3" line="580" endline="580" inline="1">
    <Argument type="_1357" location="f3:574" file="f3" line="574"/>
  </OperatorMethod>
  <Constructor id="_1039" name="._68" artificial="1" throw="" context="_405" access="public" mangled="_ZN15MDF_TRIAL_INPUTC1ERKS_ *INTERNAL* " demangled="MDF_TRIAL_INPUT::MDF_TRIAL_INPUT(MDF_TRIAL_INPUT const&amp;)" location="f3:580" file="f3" line="580" endline="580" inline="1">
    <Argument type="_1357" location="f3:574" file="f3" line="574"/>
  </Constructor>
  <Constructor id="_1040" name="._68" artificial="1" throw="" context="_405" access="public" mangled="_ZN15MDF_TRIAL_INPUTC1Ev *INTERNAL* " demangled="MDF_TRIAL_INPUT::MDF_TRIAL_INPUT()" location="f3:580" file="f3" line="580" inline="1"/>
  <Field id="_1041" name="sample_header" type="_187" offset="0" context="_406" access="public" location="f3:304" file="f3" line="304"/>
  <Field id="_1042" name="data" type="_1346" offset="128" context="_406" access="public" location="f3:305" file="f3" line="305"/>
  <Destructor id="_1043" name="._30" artificial="1" throw="" context="_406" access="public" mangled="_ZN14MDF_GLOVE_DATAD1Ev *INTERNAL* " demangled="MDF_GLOVE_DATA::~MDF_GLOVE_DATA()" location="f3:306" file="f3" line="306" endline="306" inline="1">
  </Destructor>
  <OperatorMethod id="_1044" name="=" returns="_1358" artificial="1" throw="" context="_406" access="public" mangled="_ZN14MDF_GLOVE_DATAaSERKS_" demangled="MDF_GLOVE_DATA::operator=(MDF_GLOVE_DATA const&amp;)" location="f3:306" file="f3" line="306" endline="306" inline="1">
    <Argument type="_1359" location="f3:303" file="f3" line="303"/>
  </OperatorMethod>
  <Constructor id="_1045" name="._30" artificial="1" throw="" context="_406" access="public" mangled="_ZN14MDF_GLOVE_DATAC1ERKS_ *INTERNAL* " demangled="MDF_GLOVE_DATA::MDF_GLOVE_DATA(MDF_GLOVE_DATA const&amp;)" location="f3:306" file="f3" line="306" endline="306" inline="1">
    <Argument type="_1359" location="f3:303" file="f3" line="303"/>
  </Constructor>
  <Constructor id="_1046" name="._30" artificial="1" throw="" context="_406" access="public" mangled="_ZN14MDF_GLOVE_DATAC1Ev *INTERNAL* " demangled="MDF_GLOVE_DATA::MDF_GLOVE_DATA()" location="f3:306" file="f3" line="306" inline="1"/>
  <Field id="_1047" name="stop" type="_531" offset="0" context="_410" access="public" location="f3:270" file="f3" line="270"/>
  <Field id="_1048" name="group_stimulus" type="_531" offset="32" context="_410" access="public" location="f3:271" file="f3" line="271"/>
  <Field id="_1049" name="group_numChans" type="_531" offset="64" context="_410" access="public" location="f3:272" file="f3" line="272"/>
  <Field id="_1050" name="group_channel" type="_1360" offset="96" context="_410" access="public" location="f3:273" file="f3" line="273"/>
  <Field id="_1051" name="group_pattern" type="_1360" offset="608" context="_410" access="public" location="f3:274" file="f3" line="274"/>
  <Field id="_1052" name="manual_stimulus" type="_531" offset="1120" context="_410" access="public" location="f3:276" file="f3" line="276"/>
  <Field id="_1053" name="manual_channel" type="_531" offset="1152" context="_410" access="public" location="f3:277" file="f3" line="277"/>
  <Field id="_1054" name="manual_pattern" type="_531" offset="1184" context="_410" access="public" location="f3:278" file="f3" line="278"/>
  <Destructor id="_1055" name="._26" artificial="1" throw="" context="_410" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHAND1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_CHAN::~MDF_CERESTIM_CONFIG_CHAN()" location="f3:279" file="f3" line="279" endline="279" inline="1">
  </Destructor>
  <OperatorMethod id="_1056" name="=" returns="_1361" artificial="1" throw="" context="_410" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHANaSERKS_" demangled="MDF_CERESTIM_CONFIG_CHAN::operator=(MDF_CERESTIM_CONFIG_CHAN const&amp;)" location="f3:279" file="f3" line="279" endline="279" inline="1">
    <Argument type="_1362" location="f3:269" file="f3" line="269"/>
  </OperatorMethod>
  <Constructor id="_1057" name="._26" artificial="1" throw="" context="_410" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHANC1ERKS_ *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_CHAN::MDF_CERESTIM_CONFIG_CHAN(MDF_CERESTIM_CONFIG_CHAN const&amp;)" location="f3:279" file="f3" line="279" endline="279" inline="1">
    <Argument type="_1362" location="f3:269" file="f3" line="269"/>
  </Constructor>
  <Constructor id="_1058" name="._26" artificial="1" throw="" context="_410" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHANC1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_CHAN::MDF_CERESTIM_CONFIG_CHAN()" location="f3:279" file="f3" line="279" inline="1"/>
  <Field id="_1059" name="j_ang" type="_1363" offset="0" context="_411" access="public" location="f3:282" file="f3" line="282"/>
  <Field id="_1060" name="j_vel" type="_1363" offset="1792" context="_411" access="public" location="f3:283" file="f3" line="283"/>
  <Field id="_1061" name="j_trq" type="_1363" offset="3584" context="_411" access="public" location="f3:284" file="f3" line="284"/>
  <Destructor id="_1062" name="._27" artificial="1" throw="" context="_411" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_GROBOT_RAW_FEEDBACK::~MDF_GROBOT_RAW_FEEDBACK()" location="f3:285" file="f3" line="285" endline="285" inline="1">
  </Destructor>
  <OperatorMethod id="_1063" name="=" returns="_1364" artificial="1" throw="" context="_411" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKaSERKS_" demangled="MDF_GROBOT_RAW_FEEDBACK::operator=(MDF_GROBOT_RAW_FEEDBACK const&amp;)" location="f3:285" file="f3" line="285" endline="285" inline="1">
    <Argument type="_1365" location="f3:281" file="f3" line="281"/>
  </OperatorMethod>
  <Constructor id="_1064" name="._27" artificial="1" throw="" context="_411" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_RAW_FEEDBACK::MDF_GROBOT_RAW_FEEDBACK(MDF_GROBOT_RAW_FEEDBACK const&amp;)" location="f3:285" file="f3" line="285" endline="285" inline="1">
    <Argument type="_1365" location="f3:281" file="f3" line="281"/>
  </Constructor>
  <Constructor id="_1065" name="._27" artificial="1" throw="" context="_411" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_GROBOT_RAW_FEEDBACK::MDF_GROBOT_RAW_FEEDBACK()" location="f3:285" file="f3" line="285" inline="1"/>
  <Field id="_1066" name="sample_response_timestamp" type="_449" offset="0" context="_415" access="public" location="f5:37" file="f5" line="37"/>
  <Field id="_1067" name="sample_alignment_timestamp" type="_449" offset="64" context="_415" access="public" location="f5:38" file="f5" line="38"/>
  <Field id="_1068" name="sample_response_count" type="_676" offset="128" context="_415" access="public" location="f5:39" file="f5" line="39"/>
  <Field id="_1069" name="sample_alignment_count" type="_676" offset="160" context="_415" access="public" location="f5:40" file="f5" line="40"/>
  <Destructor id="_1070" name="._16" artificial="1" throw="" context="_415" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSED1Ev *INTERNAL* " demangled="MDF_SAMPLE_RESPONSE::~MDF_SAMPLE_RESPONSE()" location="f5:41" file="f5" line="41" endline="41" inline="1">
  </Destructor>
  <OperatorMethod id="_1071" name="=" returns="_1366" artificial="1" throw="" context="_415" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSEaSERKS_" demangled="MDF_SAMPLE_RESPONSE::operator=(MDF_SAMPLE_RESPONSE const&amp;)" location="f5:41" file="f5" line="41" endline="41" inline="1">
    <Argument type="_1367" location="f5:36" file="f5" line="36"/>
  </OperatorMethod>
  <Constructor id="_1072" name="._16" artificial="1" throw="" context="_415" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSEC1ERKS_ *INTERNAL* " demangled="MDF_SAMPLE_RESPONSE::MDF_SAMPLE_RESPONSE(MDF_SAMPLE_RESPONSE const&amp;)" location="f5:41" file="f5" line="41" endline="41" inline="1">
    <Argument type="_1367" location="f5:36" file="f5" line="36"/>
  </Constructor>
  <Constructor id="_1073" name="._16" artificial="1" throw="" context="_415" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSEC1Ev *INTERNAL* " demangled="MDF_SAMPLE_RESPONSE::MDF_SAMPLE_RESPONSE()" location="f5:41" file="f5" line="41" inline="1"/>
  <Field id="_1074" name="trialComplete" type="_531" offset="0" context="_425" access="public" location="f3:589" file="f3" line="589"/>
  <Field id="_1075" name="reserved" type="_531" offset="32" context="_425" access="public" location="f3:590" file="f3" line="590"/>
  <Destructor id="_1076" name="._70" artificial="1" throw="" context="_425" access="public" mangled="_ZN25MDF_TRIAL_STATUS_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_TRIAL_STATUS_FEEDBACK::~MDF_TRIAL_STATUS_FEEDBACK()" location="f3:591" file="f3" line="591" endline="591" inline="1">
  </Destructor>
  <OperatorMethod id="_1077" name="=" returns="_1368" artificial="1" throw="" context="_425" access="public" mangled="_ZN25MDF_TRIAL_STATUS_FEEDBACKaSERKS_" demangled="MDF_TRIAL_STATUS_FEEDBACK::operator=(MDF_TRIAL_STATUS_FEEDBACK const&amp;)" location="f3:591" file="f3" line="591" endline="591" inline="1">
    <Argument type="_1369" location="f3:588" file="f3" line="588"/>
  </OperatorMethod>
  <Constructor id="_1078" name="._70" artificial="1" throw="" context="_425" access="public" mangled="_ZN25MDF_TRIAL_STATUS_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_TRIAL_STATUS_FEEDBACK::MDF_TRIAL_STATUS_FEEDBACK(MDF_TRIAL_STATUS_FEEDBACK const&amp;)" location="f3:591" file="f3" line="591" endline="591" inline="1">
    <Argument type="_1369" location="f3:588" file="f3" line="588"/>
  </Constructor>
  <Constructor id="_1079" name="._70" artificial="1" throw="" context="_425" access="public" mangled="_ZN25MDF_TRIAL_STATUS_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_TRIAL_STATUS_FEEDBACK::MDF_TRIAL_STATUS_FEEDBACK()" location="f3:591" file="f3" line="591" inline="1"/>
  <Field id="_1080" name="module_name" type="_1205" offset="0" context="_426" access="public" location="f3:418" file="f3" line="418"/>
  <Destructor id="_1081" name="._44" artificial="1" throw="" context="_426" access="public" mangled="_ZN12MDF_PING_ACKD1Ev *INTERNAL* " demangled="MDF_PING_ACK::~MDF_PING_ACK()" location="f3:419" file="f3" line="419" endline="419" inline="1">
  </Destructor>
  <OperatorMethod id="_1082" name="=" returns="_1370" artificial="1" throw="" context="_426" access="public" mangled="_ZN12MDF_PING_ACKaSERKS_" demangled="MDF_PING_ACK::operator=(MDF_PING_ACK const&amp;)" location="f3:419" file="f3" line="419" endline="419" inline="1">
    <Argument type="_1371" location="f3:417" file="f3" line="417"/>
  </OperatorMethod>
  <Constructor id="_1083" name="._44" artificial="1" throw="" context="_426" access="public" mangled="_ZN12MDF_PING_ACKC1ERKS_ *INTERNAL* " demangled="MDF_PING_ACK::MDF_PING_ACK(MDF_PING_ACK const&amp;)" location="f3:419" file="f3" line="419" endline="419" inline="1">
    <Argument type="_1371" location="f3:417" file="f3" line="417"/>
  </Constructor>
  <Constructor id="_1084" name="._44" artificial="1" throw="" context="_426" access="public" mangled="_ZN12MDF_PING_ACKC1Ev *INTERNAL* " demangled="MDF_PING_ACK::MDF_PING_ACK()" location="f3:419" file="f3" line="419" inline="1"/>
  <Field id="_1085" name="ind_force" type="_1291" offset="0" context="_428" access="public" location="f3:244" file="f3" line="244"/>
  <Field id="_1086" name="mid_force" type="_1291" offset="192" context="_428" access="public" location="f3:245" file="f3" line="245"/>
  <Field id="_1087" name="rng_force" type="_1291" offset="384" context="_428" access="public" location="f3:246" file="f3" line="246"/>
  <Field id="_1088" name="lit_force" type="_1291" offset="576" context="_428" access="public" location="f3:247" file="f3" line="247"/>
  <Field id="_1089" name="thb_force" type="_1291" offset="768" context="_428" access="public" location="f3:248" file="f3" line="248"/>
  <Field id="_1090" name="ind_accel" type="_1291" offset="960" context="_428" access="public" location="f3:250" file="f3" line="250"/>
  <Field id="_1091" name="mid_accel" type="_1291" offset="1152" context="_428" access="public" location="f3:251" file="f3" line="251"/>
  <Field id="_1092" name="rng_accel" type="_1291" offset="1344" context="_428" access="public" location="f3:252" file="f3" line="252"/>
  <Field id="_1093" name="lit_accel" type="_1291" offset="1536" context="_428" access="public" location="f3:253" file="f3" line="253"/>
  <Field id="_1094" name="thb_accel" type="_1291" offset="1728" context="_428" access="public" location="f3:254" file="f3" line="254"/>
  <Destructor id="_1095" name="._24" artificial="1" throw="" context="_428" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSD1Ev *INTERNAL* " demangled="MDF_GROBOT_SEGMENT_PERCEPTS::~MDF_GROBOT_SEGMENT_PERCEPTS()" location="f3:255" file="f3" line="255" endline="255" inline="1">
  </Destructor>
  <OperatorMethod id="_1096" name="=" returns="_1372" artificial="1" throw="" context="_428" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSaSERKS_" demangled="MDF_GROBOT_SEGMENT_PERCEPTS::operator=(MDF_GROBOT_SEGMENT_PERCEPTS const&amp;)" location="f3:255" file="f3" line="255" endline="255" inline="1">
    <Argument type="_1373" location="f3:243" file="f3" line="243"/>
  </OperatorMethod>
  <Constructor id="_1097" name="._24" artificial="1" throw="" context="_428" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_SEGMENT_PERCEPTS::MDF_GROBOT_SEGMENT_PERCEPTS(MDF_GROBOT_SEGMENT_PERCEPTS const&amp;)" location="f3:255" file="f3" line="255" endline="255" inline="1">
    <Argument type="_1373" location="f3:243" file="f3" line="243"/>
  </Constructor>
  <Constructor id="_1098" name="._24" artificial="1" throw="" context="_428" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSC1Ev *INTERNAL* " demangled="MDF_GROBOT_SEGMENT_PERCEPTS::MDF_GROBOT_SEGMENT_PERCEPTS()" location="f3:255" file="f3" line="255" inline="1"/>
  <Field id="_1099" name="module_name" type="_1205" offset="0" context="_430" access="public" location="f3:414" file="f3" line="414"/>
  <Destructor id="_1100" name="._43" artificial="1" throw="" context="_430" access="public" mangled="_ZN8MDF_PINGD1Ev *INTERNAL* " demangled="MDF_PING::~MDF_PING()" location="f3:415" file="f3" line="415" endline="415" inline="1">
  </Destructor>
  <OperatorMethod id="_1101" name="=" returns="_1374" artificial="1" throw="" context="_430" access="public" mangled="_ZN8MDF_PINGaSERKS_" demangled="MDF_PING::operator=(MDF_PING const&amp;)" location="f3:415" file="f3" line="415" endline="415" inline="1">
    <Argument type="_1375" location="f3:413" file="f3" line="413"/>
  </OperatorMethod>
  <Constructor id="_1102" name="._43" artificial="1" throw="" context="_430" access="public" mangled="_ZN8MDF_PINGC1ERKS_ *INTERNAL* " demangled="MDF_PING::MDF_PING(MDF_PING const&amp;)" location="f3:415" file="f3" line="415" endline="415" inline="1">
    <Argument type="_1375" location="f3:413" file="f3" line="413"/>
  </Constructor>
  <Constructor id="_1103" name="._43" artificial="1" throw="" context="_430" access="public" mangled="_ZN8MDF_PINGC1Ev *INTERNAL* " demangled="MDF_PING::MDF_PING()" location="f3:415" file="f3" line="415" inline="1"/>
  <Field id="_1104" name="duration" type="_676" offset="0" context="_436" access="public" location="f3:544" file="f3" line="544"/>
  <Field id="_1105" name="reserved" type="_676" offset="32" context="_436" access="public" location="f3:545" file="f3" line="545"/>
  <Destructor id="_1106" name="._63" artificial="1" throw="" context="_436" access="public" mangled="_ZN14MDF_COMBO_WAITD1Ev *INTERNAL* " demangled="MDF_COMBO_WAIT::~MDF_COMBO_WAIT()" location="f3:546" file="f3" line="546" endline="546" inline="1">
  </Destructor>
  <OperatorMethod id="_1107" name="=" returns="_1376" artificial="1" throw="" context="_436" access="public" mangled="_ZN14MDF_COMBO_WAITaSERKS_" demangled="MDF_COMBO_WAIT::operator=(MDF_COMBO_WAIT const&amp;)" location="f3:546" file="f3" line="546" endline="546" inline="1">
    <Argument type="_1377" location="f3:543" file="f3" line="543"/>
  </OperatorMethod>
  <Constructor id="_1108" name="._63" artificial="1" throw="" context="_436" access="public" mangled="_ZN14MDF_COMBO_WAITC1ERKS_ *INTERNAL* " demangled="MDF_COMBO_WAIT::MDF_COMBO_WAIT(MDF_COMBO_WAIT const&amp;)" location="f3:546" file="f3" line="546" endline="546" inline="1">
    <Argument type="_1377" location="f3:543" file="f3" line="543"/>
  </Constructor>
  <Constructor id="_1109" name="._63" artificial="1" throw="" context="_436" access="public" mangled="_ZN14MDF_COMBO_WAITC1Ev *INTERNAL* " demangled="MDF_COMBO_WAIT::MDF_COMBO_WAIT()" location="f3:546" file="f3" line="546" inline="1"/>
  <Field id="_1110" name="channelNum" type="_676" offset="0" context="_438" access="public" location="f3:549" file="f3" line="549"/>
  <Field id="_1111" name="reserved" type="_676" offset="32" context="_438" access="public" location="f3:550" file="f3" line="550"/>
  <Field id="_1112" name="name" type="_1205" offset="64" context="_438" access="public" location="f3:551" file="f3" line="551"/>
  <Destructor id="_1113" name="._64" artificial="1" throw="" context="_438" access="public" mangled="_ZN7MDF_FSRD1Ev *INTERNAL* " demangled="MDF_FSR::~MDF_FSR()" location="f3:552" file="f3" line="552" endline="552" inline="1">
  </Destructor>
  <OperatorMethod id="_1114" name="=" returns="_1378" artificial="1" throw="" context="_438" access="public" mangled="_ZN7MDF_FSRaSERKS_" demangled="MDF_FSR::operator=(MDF_FSR const&amp;)" location="f3:552" file="f3" line="552" endline="552" inline="1">
    <Argument type="_1379" location="f3:548" file="f3" line="548"/>
  </OperatorMethod>
  <Constructor id="_1115" name="._64" artificial="1" throw="" context="_438" access="public" mangled="_ZN7MDF_FSRC1ERKS_ *INTERNAL* " demangled="MDF_FSR::MDF_FSR(MDF_FSR const&amp;)" location="f3:552" file="f3" line="552" endline="552" inline="1">
    <Argument type="_1379" location="f3:548" file="f3" line="548"/>
  </Constructor>
  <Constructor id="_1116" name="._64" artificial="1" throw="" context="_438" access="public" mangled="_ZN7MDF_FSRC1Ev *INTERNAL* " demangled="MDF_FSR::MDF_FSR()" location="f3:552" file="f3" line="552" inline="1"/>
  <Field id="_1117" name="x" type="_1380" offset="0" context="_440" access="public" location="f3:235" file="f3" line="235"/>
  <Field id="_1118" name="y" type="_1380" offset="1280" context="_440" access="public" location="f3:236" file="f3" line="236"/>
  <Field id="_1119" name="z" type="_1380" offset="2560" context="_440" access="public" location="f3:237" file="f3" line="237"/>
  <Field id="_1120" name="w" type="_1380" offset="3840" context="_440" access="public" location="f3:238" file="f3" line="238"/>
  <Field id="_1121" name="Which" type="_531" offset="5120" context="_440" access="public" location="f3:239" file="f3" line="239"/>
  <Field id="_1122" name="Reserved" type="_531" offset="5152" context="_440" access="public" location="f3:240" file="f3" line="240"/>
  <Destructor id="_1123" name="._23" artificial="1" throw="" context="_440" access="public" mangled="_ZN19MDF_KINECT_SKELETOND1Ev *INTERNAL* " demangled="MDF_KINECT_SKELETON::~MDF_KINECT_SKELETON()" location="f3:241" file="f3" line="241" endline="241" inline="1">
  </Destructor>
  <OperatorMethod id="_1124" name="=" returns="_1381" artificial="1" throw="" context="_440" access="public" mangled="_ZN19MDF_KINECT_SKELETONaSERKS_" demangled="MDF_KINECT_SKELETON::operator=(MDF_KINECT_SKELETON const&amp;)" location="f3:241" file="f3" line="241" endline="241" inline="1">
    <Argument type="_1382" location="f3:234" file="f3" line="234"/>
  </OperatorMethod>
  <Constructor id="_1125" name="._23" artificial="1" throw="" context="_440" access="public" mangled="_ZN19MDF_KINECT_SKELETONC1ERKS_ *INTERNAL* " demangled="MDF_KINECT_SKELETON::MDF_KINECT_SKELETON(MDF_KINECT_SKELETON const&amp;)" location="f3:241" file="f3" line="241" endline="241" inline="1">
    <Argument type="_1382" location="f3:234" file="f3" line="234"/>
  </Constructor>
  <Constructor id="_1126" name="._23" artificial="1" throw="" context="_440" access="public" mangled="_ZN19MDF_KINECT_SKELETONC1Ev *INTERNAL* " demangled="MDF_KINECT_SKELETON::MDF_KINECT_SKELETON()" location="f3:241" file="f3" line="241" inline="1"/>
  <Field id="_1127" name="time" type="_449" offset="0" context="_465" access="public" location="f3:434" file="f3" line="434"/>
  <Field id="_1128" name="chan" type="_531" offset="64" context="_465" access="public" location="f3:435" file="f3" line="435"/>
  <Field id="_1129" name="unit" type="_531" offset="96" context="_465" access="public" location="f3:436" file="f3" line="436"/>
  <Field id="_1130" name="box_id" type="_531" offset="128" context="_465" access="public" location="f3:437" file="f3" line="437"/>
  <Field id="_1131" name="length" type="_531" offset="160" context="_465" access="public" location="f3:438" file="f3" line="438"/>
  <Field id="_1132" name="snippet" type="_1383" offset="192" context="_465" access="public" location="f3:439" file="f3" line="439"/>
  <Destructor id="_1133" name="._48" artificial="1" throw="" context="_465" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETD1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_SNIPPET::~MDF_SPM_SPIKE_SNIPPET()" location="f3:440" file="f3" line="440" endline="440" inline="1">
  </Destructor>
  <OperatorMethod id="_1134" name="=" returns="_1384" artificial="1" throw="" context="_465" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETaSERKS_" demangled="MDF_SPM_SPIKE_SNIPPET::operator=(MDF_SPM_SPIKE_SNIPPET const&amp;)" location="f3:440" file="f3" line="440" endline="440" inline="1">
    <Argument type="_1385" location="f3:433" file="f3" line="433"/>
  </OperatorMethod>
  <Constructor id="_1135" name="._48" artificial="1" throw="" context="_465" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETC1ERKS_ *INTERNAL* " demangled="MDF_SPM_SPIKE_SNIPPET::MDF_SPM_SPIKE_SNIPPET(MDF_SPM_SPIKE_SNIPPET const&amp;)" location="f3:440" file="f3" line="440" endline="440" inline="1">
    <Argument type="_1385" location="f3:433" file="f3" line="433"/>
  </Constructor>
  <Constructor id="_1136" name="._48" artificial="1" throw="" context="_465" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETC1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_SNIPPET::MDF_SPM_SPIKE_SNIPPET()" location="f3:440" file="f3" line="440" inline="1"/>
  <Field id="_1137" name="data_dir" type="_1231" offset="0" context="_468" access="public" location="f3:298" file="f3" line="298"/>
  <Destructor id="_1138" name="._29" artificial="1" throw="" context="_468" access="public" mangled="_ZN18MDF_SESSION_CONFIGD1Ev *INTERNAL* " demangled="MDF_SESSION_CONFIG::~MDF_SESSION_CONFIG()" location="f3:299" file="f3" line="299" endline="299" inline="1">
  </Destructor>
  <OperatorMethod id="_1139" name="=" returns="_1386" artificial="1" throw="" context="_468" access="public" mangled="_ZN18MDF_SESSION_CONFIGaSERKS_" demangled="MDF_SESSION_CONFIG::operator=(MDF_SESSION_CONFIG const&amp;)" location="f3:299" file="f3" line="299" endline="299" inline="1">
    <Argument type="_1387" location="f3:297" file="f3" line="297"/>
  </OperatorMethod>
  <Constructor id="_1140" name="._29" artificial="1" throw="" context="_468" access="public" mangled="_ZN18MDF_SESSION_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_SESSION_CONFIG::MDF_SESSION_CONFIG(MDF_SESSION_CONFIG const&amp;)" location="f3:299" file="f3" line="299" endline="299" inline="1">
    <Argument type="_1387" location="f3:297" file="f3" line="297"/>
  </Constructor>
  <Constructor id="_1141" name="._29" artificial="1" throw="" context="_468" access="public" mangled="_ZN18MDF_SESSION_CONFIGC1Ev *INTERNAL* " demangled="MDF_SESSION_CONFIG::MDF_SESSION_CONFIG()" location="f3:299" file="f3" line="299" inline="1"/>
  <Field id="_1142" name="Cmd" type="_1292" offset="0" context="_471" access="public" location="f3:231" file="f3" line="231"/>
  <Destructor id="_1143" name="._22" artificial="1" throw="" context="_471" access="public" mangled="_ZN15MDF_KIN_POS_CMDD1Ev *INTERNAL* " demangled="MDF_KIN_POS_CMD::~MDF_KIN_POS_CMD()" location="f3:232" file="f3" line="232" endline="232" inline="1">
  </Destructor>
  <OperatorMethod id="_1144" name="=" returns="_1388" artificial="1" throw="" context="_471" access="public" mangled="_ZN15MDF_KIN_POS_CMDaSERKS_" demangled="MDF_KIN_POS_CMD::operator=(MDF_KIN_POS_CMD const&amp;)" location="f3:232" file="f3" line="232" endline="232" inline="1">
    <Argument type="_1389" location="f3:230" file="f3" line="230"/>
  </OperatorMethod>
  <Constructor id="_1145" name="._22" artificial="1" throw="" context="_471" access="public" mangled="_ZN15MDF_KIN_POS_CMDC1ERKS_ *INTERNAL* " demangled="MDF_KIN_POS_CMD::MDF_KIN_POS_CMD(MDF_KIN_POS_CMD const&amp;)" location="f3:232" file="f3" line="232" endline="232" inline="1">
    <Argument type="_1389" location="f3:230" file="f3" line="230"/>
  </Constructor>
  <Constructor id="_1146" name="._22" artificial="1" throw="" context="_471" access="public" mangled="_ZN15MDF_KIN_POS_CMDC1Ev *INTERNAL* " demangled="MDF_KIN_POS_CMD::MDF_KIN_POS_CMD()" location="f3:232" file="f3" line="232" inline="1"/>
  <Field id="_1147" name="load_calibration" type="_531" offset="0" context="_476" access="public" location="f3:406" file="f3" line="406"/>
  <Field id="_1148" name="calib_session_id" type="_531" offset="32" context="_476" access="public" location="f3:407" file="f3" line="407"/>
  <Field id="_1149" name="num_reps" type="_531" offset="64" context="_476" access="public" location="f3:408" file="f3" line="408"/>
  <Field id="_1150" name="reserved" type="_531" offset="96" context="_476" access="public" location="f3:409" file="f3" line="409"/>
  <Field id="_1151" name="subject_name" type="_1205" offset="128" context="_476" access="public" location="f3:410" file="f3" line="410"/>
  <Destructor id="_1152" name="._42" artificial="1" throw="" context="_476" access="public" mangled="_ZN20MDF_XM_START_SESSIOND1Ev *INTERNAL* " demangled="MDF_XM_START_SESSION::~MDF_XM_START_SESSION()" location="f3:411" file="f3" line="411" endline="411" inline="1">
  </Destructor>
  <OperatorMethod id="_1153" name="=" returns="_1390" artificial="1" throw="" context="_476" access="public" mangled="_ZN20MDF_XM_START_SESSIONaSERKS_" demangled="MDF_XM_START_SESSION::operator=(MDF_XM_START_SESSION const&amp;)" location="f3:411" file="f3" line="411" endline="411" inline="1">
    <Argument type="_1391" location="f3:405" file="f3" line="405"/>
  </OperatorMethod>
  <Constructor id="_1154" name="._42" artificial="1" throw="" context="_476" access="public" mangled="_ZN20MDF_XM_START_SESSIONC1ERKS_ *INTERNAL* " demangled="MDF_XM_START_SESSION::MDF_XM_START_SESSION(MDF_XM_START_SESSION const&amp;)" location="f3:411" file="f3" line="411" endline="411" inline="1">
    <Argument type="_1391" location="f3:405" file="f3" line="405"/>
  </Constructor>
  <Constructor id="_1155" name="._42" artificial="1" throw="" context="_476" access="public" mangled="_ZN20MDF_XM_START_SESSIONC1Ev *INTERNAL* " demangled="MDF_XM_START_SESSION::MDF_XM_START_SESSION()" location="f3:411" file="f3" line="411" inline="1"/>
  <Field id="_1156" name="sample_header" type="_187" offset="0" context="_480" access="public" location="f3:478" file="f3" line="478"/>
  <Field id="_1157" name="score" type="_449" offset="128" context="_480" access="public" location="f3:479" file="f3" line="479"/>
  <Field id="_1158" name="gain" type="_449" offset="192" context="_480" access="public" location="f3:480" file="f3" line="480"/>
  <Field id="_1159" name="idle" type="_531" offset="256" context="_480" access="public" location="f3:481" file="f3" line="481"/>
  <Field id="_1160" name="reserved" type="_531" offset="288" context="_480" access="public" location="f3:482" file="f3" line="482"/>
  <Destructor id="_1161" name="._54" artificial="1" throw="" context="_480" access="public" mangled="_ZN8MDF_IDLED1Ev *INTERNAL* " demangled="MDF_IDLE::~MDF_IDLE()" location="f3:483" file="f3" line="483" endline="483" inline="1">
  </Destructor>
  <OperatorMethod id="_1162" name="=" returns="_1392" artificial="1" throw="" context="_480" access="public" mangled="_ZN8MDF_IDLEaSERKS_" demangled="MDF_IDLE::operator=(MDF_IDLE const&amp;)" location="f3:483" file="f3" line="483" endline="483" inline="1">
    <Argument type="_1393" location="f3:477" file="f3" line="477"/>
  </OperatorMethod>
  <Constructor id="_1163" name="._54" artificial="1" throw="" context="_480" access="public" mangled="_ZN8MDF_IDLEC1ERKS_ *INTERNAL* " demangled="MDF_IDLE::MDF_IDLE(MDF_IDLE const&amp;)" location="f3:483" file="f3" line="483" endline="483" inline="1">
    <Argument type="_1393" location="f3:477" file="f3" line="477"/>
  </Constructor>
  <Constructor id="_1164" name="._54" artificial="1" throw="" context="_480" access="public" mangled="_ZN8MDF_IDLEC1Ev *INTERNAL* " demangled="MDF_IDLE::MDF_IDLE()" location="f3:483" file="f3" line="483" inline="1"/>
  <Field id="_1165" name="dof_vals" type="_1237" offset="0" context="_481" access="public" location="f3:503" file="f3" line="503"/>
  <Field id="_1166" name="tag" type="_1205" offset="1344" context="_481" access="public" location="f3:504" file="f3" line="504"/>
  <Destructor id="_1167" name="._57" artificial="1" throw="" context="_481" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAD1Ev *INTERNAL* " demangled="MDF_OUTPUT_DOF_DATA::~MDF_OUTPUT_DOF_DATA()" location="f3:505" file="f3" line="505" endline="505" inline="1">
  </Destructor>
  <OperatorMethod id="_1168" name="=" returns="_1394" artificial="1" throw="" context="_481" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAaSERKS_" demangled="MDF_OUTPUT_DOF_DATA::operator=(MDF_OUTPUT_DOF_DATA const&amp;)" location="f3:505" file="f3" line="505" endline="505" inline="1">
    <Argument type="_1395" location="f3:502" file="f3" line="502"/>
  </OperatorMethod>
  <Constructor id="_1169" name="._57" artificial="1" throw="" context="_481" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAC1ERKS_ *INTERNAL* " demangled="MDF_OUTPUT_DOF_DATA::MDF_OUTPUT_DOF_DATA(MDF_OUTPUT_DOF_DATA const&amp;)" location="f3:505" file="f3" line="505" endline="505" inline="1">
    <Argument type="_1395" location="f3:502" file="f3" line="502"/>
  </Constructor>
  <Constructor id="_1170" name="._57" artificial="1" throw="" context="_481" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAC1Ev *INTERNAL* " demangled="MDF_OUTPUT_DOF_DATA::MDF_OUTPUT_DOF_DATA()" location="f3:505" file="f3" line="505" inline="1"/>
  <Field id="_1171" name="sample_header" type="_187" offset="0" context="_482" access="public" location="f3:523" file="f3" line="523"/>
  <Field id="_1172" name="rdt_sequence" type="_676" offset="128" context="_482" access="public" location="f3:524" file="f3" line="524"/>
  <Field id="_1173" name="ft_sequence" type="_676" offset="160" context="_482" access="public" location="f3:525" file="f3" line="525"/>
  <Field id="_1174" name="status" type="_676" offset="192" context="_482" access="public" location="f3:526" file="f3" line="526"/>
  <Field id="_1175" name="reserved" type="_676" offset="224" context="_482" access="public" location="f3:527" file="f3" line="527"/>
  <Field id="_1176" name="data" type="_1234" offset="256" context="_482" access="public" location="f3:528" file="f3" line="528"/>
  <Field id="_1177" name="offset" type="_1234" offset="640" context="_482" access="public" location="f3:529" file="f3" line="529"/>
  <Destructor id="_1178" name="._60" artificial="1" throw="" context="_482" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAD1Ev *INTERNAL* " demangled="MDF_FORCE_SENSOR_DATA::~MDF_FORCE_SENSOR_DATA()" location="f3:530" file="f3" line="530" endline="530" inline="1">
  </Destructor>
  <OperatorMethod id="_1179" name="=" returns="_1396" artificial="1" throw="" context="_482" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAaSERKS_" demangled="MDF_FORCE_SENSOR_DATA::operator=(MDF_FORCE_SENSOR_DATA const&amp;)" location="f3:530" file="f3" line="530" endline="530" inline="1">
    <Argument type="_1397" location="f3:522" file="f3" line="522"/>
  </OperatorMethod>
  <Constructor id="_1180" name="._60" artificial="1" throw="" context="_482" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAC1ERKS_ *INTERNAL* " demangled="MDF_FORCE_SENSOR_DATA::MDF_FORCE_SENSOR_DATA(MDF_FORCE_SENSOR_DATA const&amp;)" location="f3:530" file="f3" line="530" endline="530" inline="1">
    <Argument type="_1397" location="f3:522" file="f3" line="522"/>
  </Constructor>
  <Constructor id="_1181" name="._60" artificial="1" throw="" context="_482" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAC1Ev *INTERNAL* " demangled="MDF_FORCE_SENSOR_DATA::MDF_FORCE_SENSOR_DATA()" location="f3:530" file="f3" line="530" inline="1"/>
  <Field id="_1182" name="success" type="_531" offset="0" context="_486" access="public" location="f4:110" file="f4" line="110"/>
  <Field id="_1183" name="reserved" type="_531" offset="32" context="_486" access="public" location="f4:111" file="f4" line="111"/>
  <Destructor id="_1184" name="._73" artificial="1" throw="" context="_486" access="public" mangled="_ZN16MDF_TRIAL_STATUSD1Ev *INTERNAL* " demangled="MDF_TRIAL_STATUS::~MDF_TRIAL_STATUS()" location="f4:112" file="f4" line="112" endline="112" inline="1">
  </Destructor>
  <OperatorMethod id="_1185" name="=" returns="_1398" artificial="1" throw="" context="_486" access="public" mangled="_ZN16MDF_TRIAL_STATUSaSERKS_" demangled="MDF_TRIAL_STATUS::operator=(MDF_TRIAL_STATUS const&amp;)" location="f4:112" file="f4" line="112" endline="112" inline="1">
    <Argument type="_1399" location="f4:109" file="f4" line="109"/>
  </OperatorMethod>
  <Constructor id="_1186" name="._73" artificial="1" throw="" context="_486" access="public" mangled="_ZN16MDF_TRIAL_STATUSC1ERKS_ *INTERNAL* " demangled="MDF_TRIAL_STATUS::MDF_TRIAL_STATUS(MDF_TRIAL_STATUS const&amp;)" location="f4:112" file="f4" line="112" endline="112" inline="1">
    <Argument type="_1399" location="f4:109" file="f4" line="109"/>
  </Constructor>
  <Constructor id="_1187" name="._73" artificial="1" throw="" context="_486" access="public" mangled="_ZN16MDF_TRIAL_STATUSC1Ev *INTERNAL* " demangled="MDF_TRIAL_STATUS::MDF_TRIAL_STATUS()" location="f4:112" file="f4" line="112" inline="1"/>
  <Field id="_1188" name="duration_ms" type="_449" offset="0" context="_487" access="public" location="f4:136" file="f4" line="136"/>
  <Field id="_1189" name="num_clicks" type="_449" offset="64" context="_487" access="public" location="f4:137" file="f4" line="137"/>
  <Destructor id="_1190" name="._74" artificial="1" throw="" context="_487" access="public" mangled="_ZN15MDF_GIVE_REWARDD1Ev *INTERNAL* " demangled="MDF_GIVE_REWARD::~MDF_GIVE_REWARD()" location="f4:138" file="f4" line="138" endline="138" inline="1">
  </Destructor>
  <OperatorMethod id="_1191" name="=" returns="_1400" artificial="1" throw="" context="_487" access="public" mangled="_ZN15MDF_GIVE_REWARDaSERKS_" demangled="MDF_GIVE_REWARD::operator=(MDF_GIVE_REWARD const&amp;)" location="f4:138" file="f4" line="138" endline="138" inline="1">
    <Argument type="_1401" location="f4:135" file="f4" line="135"/>
  </OperatorMethod>
  <Constructor id="_1192" name="._74" artificial="1" throw="" context="_487" access="public" mangled="_ZN15MDF_GIVE_REWARDC1ERKS_ *INTERNAL* " demangled="MDF_GIVE_REWARD::MDF_GIVE_REWARD(MDF_GIVE_REWARD const&amp;)" location="f4:138" file="f4" line="138" endline="138" inline="1">
    <Argument type="_1401" location="f4:135" file="f4" line="135"/>
  </Constructor>
  <Constructor id="_1193" name="._74" artificial="1" throw="" context="_487" access="public" mangled="_ZN15MDF_GIVE_REWARDC1Ev *INTERNAL* " demangled="MDF_GIVE_REWARD::MDF_GIVE_REWARD()" location="f4:138" file="f4" line="138" inline="1"/>
  <Field id="_1194" name="id" type="_531" offset="0" context="_489" access="public" location="f3:376" file="f3" line="376"/>
  <Field id="_1195" name="outcome" type="_531" offset="32" context="_489" access="public" location="f3:377" file="f3" line="377"/>
  <Field id="_1196" name="reason" type="_1205" offset="64" context="_489" access="public" location="f3:378" file="f3" line="378"/>
  <Destructor id="_1197" name="._37" artificial="1" throw="" context="_489" access="public" mangled="_ZN18MDF_END_TASK_STATED1Ev *INTERNAL* " demangled="MDF_END_TASK_STATE::~MDF_END_TASK_STATE()" location="f3:379" file="f3" line="379" endline="379" inline="1">
  </Destructor>
  <OperatorMethod id="_1198" name="=" returns="_1402" artificial="1" throw="" context="_489" access="public" mangled="_ZN18MDF_END_TASK_STATEaSERKS_" demangled="MDF_END_TASK_STATE::operator=(MDF_END_TASK_STATE const&amp;)" location="f3:379" file="f3" line="379" endline="379" inline="1">
    <Argument type="_1403" location="f3:375" file="f3" line="375"/>
  </OperatorMethod>
  <Constructor id="_1199" name="._37" artificial="1" throw="" context="_489" access="public" mangled="_ZN18MDF_END_TASK_STATEC1ERKS_ *INTERNAL* " demangled="MDF_END_TASK_STATE::MDF_END_TASK_STATE(MDF_END_TASK_STATE const&amp;)" location="f3:379" file="f3" line="379" endline="379" inline="1">
    <Argument type="_1403" location="f3:375" file="f3" line="375"/>
  </Constructor>
  <Constructor id="_1200" name="._37" artificial="1" throw="" context="_489" access="public" mangled="_ZN18MDF_END_TASK_STATEC1Ev *INTERNAL* " demangled="MDF_END_TASK_STATE::MDF_END_TASK_STATE()" location="f3:379" file="f3" line="379" inline="1"/>
  <CvQualifiedType id="_449c" type="_449" const="1"/>
  <ArrayType id="_1203" min="0" max="17u" type="_449" size="1152" align="64"/>
  <ArrayType id="_1204" min="0" max="17u" type="_531" size="576" align="32"/>
  <ArrayType id="_1205" min="0" max="63u" type="_547" size="512" align="8"/>
  <ReferenceType id="_1206" type="_14" size="64" align="64"/>
  <ReferenceType id="_1207" type="_14c" size="64" align="64"/>
  <ReferenceType id="_1208" type="_28" size="64" align="64"/>
  <ReferenceType id="_1209" type="_28c" size="64" align="64"/>
  <ReferenceType id="_1210" type="_37" size="64" align="64"/>
  <ReferenceType id="_1211" type="_37c" size="64" align="64"/>
  <ReferenceType id="_1212" type="_50" size="64" align="64"/>
  <ReferenceType id="_1213" type="_50c" size="64" align="64"/>
  <ArrayType id="_1214" min="0" max="8u" type="_449" size="576" align="64"/>
  <ReferenceType id="_1215" type="_69" size="64" align="64"/>
  <ReferenceType id="_1216" type="_69c" size="64" align="64"/>
  <ArrayType id="_1217" min="0" max="255u" type="_449" size="16384" align="64"/>
  <ArrayType id="_1218" min="0" max="255u" type="_1409" size="4096" align="16"/>
  <ArrayType id="_1219" min="0" max="255u" type="_547" size="2048" align="8"/>
  <ReferenceType id="_1220" type="_86" size="64" align="64"/>
  <ReferenceType id="_1221" type="_86c" size="64" align="64"/>
  <ReferenceType id="_1222" type="_89" size="64" align="64"/>
  <ReferenceType id="_1223" type="_89c" size="64" align="64"/>
  <ReferenceType id="_1224" type="_96" size="64" align="64"/>
  <ReferenceType id="_1225" type="_96c" size="64" align="64"/>
  <ArrayType id="_1226" min="0" max="575u" type="_449" size="36864" align="64"/>
  <ReferenceType id="_1227" type="_101" size="64" align="64"/>
  <ReferenceType id="_1228" type="_101c" size="64" align="64"/>
  <ReferenceType id="_1229" type="_105" size="64" align="64"/>
  <ReferenceType id="_1230" type="_105c" size="64" align="64"/>
  <ArrayType id="_1231" min="0" max="127u" type="_547" size="1024" align="8"/>
  <ReferenceType id="_1232" type="_113" size="64" align="64"/>
  <ReferenceType id="_1233" type="_113c" size="64" align="64"/>
  <ArrayType id="_1234" min="0" max="5u" type="_449" size="384" align="64"/>
  <ReferenceType id="_1235" type="_116" size="64" align="64"/>
  <ReferenceType id="_1236" type="_116c" size="64" align="64"/>
  <ArrayType id="_1237" min="0" max="20u" type="_449" size="1344" align="64"/>
  <ReferenceType id="_1238" type="_126" size="64" align="64"/>
  <ReferenceType id="_1239" type="_126c" size="64" align="64"/>
  <ReferenceType id="_1240" type="_128" size="64" align="64"/>
  <ReferenceType id="_1241" type="_128c" size="64" align="64"/>
  <ArrayType id="_1242" min="0" max="575u" type="_499" size="4608" align="8"/>
  <ReferenceType id="_1243" type="_131" size="64" align="64"/>
  <ReferenceType id="_1244" type="_131c" size="64" align="64"/>
  <ArrayType id="_1245" min="0" max="31u" type="_449" size="2048" align="64"/>
  <ReferenceType id="_1246" type="_133" size="64" align="64"/>
  <ReferenceType id="_1247" type="_133c" size="64" align="64"/>
  <ReferenceType id="_1248" type="_141" size="64" align="64"/>
  <ReferenceType id="_1249" type="_141c" size="64" align="64"/>
  <ReferenceType id="_1250" type="_147" size="64" align="64"/>
  <ReferenceType id="_1251" type="_147c" size="64" align="64"/>
  <ArrayType id="_1252" min="0" max="11u" type="_449" size="768" align="64"/>
  <ReferenceType id="_1253" type="_153" size="64" align="64"/>
  <ReferenceType id="_1254" type="_153c" size="64" align="64"/>
  <Field id="_1256" name="high" type="_1252" offset="0" context="_681" access="public" location="f4:157" file="f4" line="157"/>
  <Field id="_1257" name="low" type="_1252" offset="768" context="_681" access="public" location="f4:158" file="f4" line="158"/>
  <Destructor id="_1258" name="._76" artificial="1" throw="" context="_681" access="public" mangled="_ZN19MDF_IO_START_STREAM4._76D1Ev *INTERNAL* " demangled="MDF_IO_START_STREAM::._76::~._76()" location="f4:156" file="f4" line="156" endline="156" inline="1">
  </Destructor>
  <OperatorMethod id="_1259" name="=" returns="_1424" artificial="1" throw="" context="_681" access="public" mangled="_ZN19MDF_IO_START_STREAM4._76aSERKS0_" demangled="MDF_IO_START_STREAM::._76::operator=(MDF_IO_START_STREAM::._76 const&amp;)" location="f4:156" file="f4" line="156" endline="156" inline="1">
    <Argument type="_1425" location="f4:156" file="f4" line="156"/>
  </OperatorMethod>
  <Constructor id="_1260" artificial="1" throw="" context="_681" access="public" mangled="_ZN19MDF_IO_START_STREAM4._76C1ERKS0_ *INTERNAL* " demangled="MDF_IO_START_STREAM::._76::._76(MDF_IO_START_STREAM::._76 const&amp;)" location="f4:156" file="f4" line="156" endline="156" inline="1">
    <Argument type="_1425" location="f4:156" file="f4" line="156"/>
  </Constructor>
  <Constructor id="_1261" artificial="1" throw="" context="_681" access="public" mangled="_ZN19MDF_IO_START_STREAM4._76C1Ev *INTERNAL* " demangled="MDF_IO_START_STREAM::._76::._76()" location="f4:156" file="f4" line="156" inline="1"/>
  <ReferenceType id="_1262" type="_167" size="64" align="64"/>
  <ReferenceType id="_1263" type="_167c" size="64" align="64"/>
  <ArrayType id="_1264" min="0" max="10u" type="_449" size="704" align="64"/>
  <ReferenceType id="_1265" type="_183" size="64" align="64"/>
  <ReferenceType id="_1266" type="_183c" size="64" align="64"/>
  <ReferenceType id="_1267" type="_187" size="64" align="64"/>
  <ReferenceType id="_1268" type="_187c" size="64" align="64"/>
  <ReferenceType id="_1269" type="_192" size="64" align="64"/>
  <ReferenceType id="_1270" type="_192c" size="64" align="64"/>
  <ReferenceType id="_1271" type="_207" size="64" align="64"/>
  <ReferenceType id="_1272" type="_207c" size="64" align="64"/>
  <ReferenceType id="_1273" type="_214" size="64" align="64"/>
  <ReferenceType id="_1274" type="_214c" size="64" align="64"/>
  <ReferenceType id="_1275" type="_217" size="64" align="64"/>
  <ReferenceType id="_1276" type="_217c" size="64" align="64"/>
  <ReferenceType id="_1277" type="_219" size="64" align="64"/>
  <ReferenceType id="_1278" type="_219c" size="64" align="64"/>
  <ArrayType id="_1279" min="0" max="1727u" type="_500" size="13824" align="8"/>
  <ReferenceType id="_1280" type="_222" size="64" align="64"/>
  <ReferenceType id="_1281" type="_222c" size="64" align="64"/>
  <ReferenceType id="_1282" type="_223" size="64" align="64"/>
  <ReferenceType id="_1283" type="_223c" size="64" align="64"/>
  <ReferenceType id="_1284" type="_231" size="64" align="64"/>
  <ReferenceType id="_1285" type="_231c" size="64" align="64"/>
  <ReferenceType id="_1286" type="_232" size="64" align="64"/>
  <ReferenceType id="_1287" type="_232c" size="64" align="64"/>
  <ReferenceType id="_1288" type="_242" size="64" align="64"/>
  <ReferenceType id="_1289" type="_242c" size="64" align="64"/>
  <ArrayType id="_1290" min="0" max="6u" type="_449" size="448" align="64"/>
  <ArrayType id="_1291" min="0" max="2u" type="_449" size="192" align="64"/>
  <ArrayType id="_1292" min="0" max="3u" type="_449" size="256" align="64"/>
  <ReferenceType id="_1293" type="_245" size="64" align="64"/>
  <ReferenceType id="_1294" type="_245c" size="64" align="64"/>
  <ReferenceType id="_1295" type="_255" size="64" align="64"/>
  <ReferenceType id="_1296" type="_255c" size="64" align="64"/>
  <ArrayType id="_1297" min="0" max="32u" type="_449" size="2112" align="64"/>
  <ArrayType id="_1298" min="0" max="11u" type="_531" size="384" align="32"/>
  <ReferenceType id="_1299" type="_257" size="64" align="64"/>
  <ReferenceType id="_1300" type="_257c" size="64" align="64"/>
