<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Function id="_355" name="__builtin_csinh" returns="_411" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_411" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_356" name="__builtin_csinl" returns="_404" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_404" location="f0:116" file="f0" line="116"/>
  </Function>
  <Variable id="_357" name="cpp_sym_MT_START_DATA_COLLECT" type="_387c" init="2360" context="_1" location="f1:133" file="f1" line="133" static="1"/>
  <Function id="_358" name="__builtin_acos" returns="_385" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_385" location="f0:24" file="f0" line="24"/>
  </Function>
  <Function id="_359" name="__builtin_ctzll" returns="_387" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_392" location="f0:98" file="f0" line="98"/>
  </Function>
  <Variable id="_360" name="cpp_sym_MPL_AT_ARM_JV_FING_JP" type="_387c" init="2" context="_1" location="f1:131" file="f1" line="131" static="1"/>
  <Function id="_361" name="__builtin_cargf" returns="_389" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_403" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_362" name="__builtin_cargl" returns="_390" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_404" location="f0:95" file="f0" line="95"/>
  </Function>
  <FundamentalType id="_363" name="unsigned char" size="8" align="8"/>
  <Typedef id="_364" name="SPIKE_COUNT_DATA_TYPE" type="_363" context="_1" location="f4:24" file="f4" line="24"/>
  <Variable id="_365" name="cpp_sym_MAX_SPIKE_SOURCES" type="_387c" init="3" context="_1" location="f1:159" file="f1" line="159" static="1"/>
  <Function id="_366" name="__builtin_cosf" returns="_389" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_389" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_367" name="__builtin_cosh" returns="_385" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_385" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_368" name="__builtin_cosl" returns="_390" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_390" location="f0:44" file="f0" line="44"/>
  </Function>
  <Variable id="_369" name="cpp_sym_MT_COMMANDSPACE_FEEDBACK" type="_387c" init="1703" context="_1" location="f1:136" file="f1" line="136" static="1"/>
  <Variable id="_370" name="cpp_sym_MT_SPM_SPIKE_TIMES" type="_387c" init="2171" context="_1" location="f1:69" file="f1" line="69" static="1"/>
  <Variable id="_371" name="cpp_sym_SAMPLE_DT" type="_385c" init="2.99999999999999988897769753748434595763683319091796875e-2" context="_1" location="f1:99" file="f1" line="99" static="1"/>
  <Variable id="_372" name="cpp_sym_MAX_GROBOT_FEEDBACK_DIMS" type="_387c" init="18" context="_1" location="f1:155" file="f1" line="155" static="1"/>
  <Variable id="_373" name="cpp_sym_MAX_FINGER_DIMS" type="_387c" init="10" context="_1" location="f1:93" file="f1" line="93" static="1"/>
  <Function id="_374" name="__builtin_isgreater" returns="_391" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Variable id="_375" name="cpp_sym_MT_CERESTIM_CONFIG_CHAN" type="_387c" init="1890" context="_1" location="f1:64" file="f1" line="64" static="1"/>
  <Variable id="_376" name="cpp_sym_MID_VIRTUAL_FIXTURING" type="_387c" init="28" context="_1" location="f1:61" file="f1" line="61" static="1"/>
  <Variable id="_377" name="cpp_sym_MT_IDLE_DETECTION_ENDED" type="_387c" init="2251" context="_1" location="f1:150" file="f1" line="150" static="1"/>
  <Function id="_378" name="__builtin_sinf" returns="_389" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_389" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_379" name="__builtin_sinh" returns="_385" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_385" location="f0:77" file="f0" line="77"/>
  </Function>
  <Variable id="_380" name="cpp_sym_NUM_D_COLS" type="_387c" init="16" context="_1" location="f1:126" file="f1" line="126" static="1"/>
  <Function id="_381" name="__builtin_sinl" returns="_390" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_390" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_382" name="__builtin_csin" returns="_411" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_411" location="f0:115" file="f0" line="115"/>
  </Function>
  <Variable id="_383" name="cpp_sym_MT_FSR_DATA" type="_387c" init="2421" context="_1" location="f1:88" file="f1" line="88" static="1"/>
  <Variable id="_384" name="cpp_sym_MT_PING" type="_387c" init="2140" context="_1" location="f1:102" file="f1" line="102" static="1"/>
  <FundamentalType id="_385" name="double" size="64" align="64"/>
  <PointerType id="_386" type="_975c" size="64" align="64"/>
  <FundamentalType id="_387" name="int" size="32" align="32"/>
  <CvQualifiedType id="_387c" type="_387" const="1"/>
  <FundamentalType id="_389" name="float" size="32" align="32"/>
  <FundamentalType id="_390" name="long double" size="128" align="128"/>
  <FundamentalType id="_391" name="bool" size="8" align="8"/>
  <FundamentalType id="_392" name="long long int" size="64" align="64"/>
  <Field id="_393" name="sample_header" type="_134" offset="0" context="_13" access="public" location="f2:46" file="f2" line="46"/>
  <Field id="_394" name="sample_interval" type="_385" offset="128" context="_13" access="public" location="f2:47" file="f2" line="47"/>
  <Field id="_395" name="pos" type="_977" offset="192" context="_13" access="public" location="f2:48" file="f2" line="48"/>
  <Field id="_396" name="vel" type="_977" offset="1344" context="_13" access="public" location="f2:49" file="f2" line="49"/>
  <Field id="_397" name="controlledDims" type="_978" offset="2496" context="_13" access="public" location="f2:50" file="f2" line="50"/>
  <Field id="_398" name="tag" type="_979" offset="3072" context="_13" access="public" location="f2:51" file="f2" line="51"/>
  <Destructor id="_399" name="._1" artificial="1" throw="" context="_13" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAD1Ev *INTERNAL* " demangled="MOVEMENT_COMMAND_DATA::~MOVEMENT_COMMAND_DATA()" location="f2:52" file="f2" line="52" endline="52" inline="1">
  </Destructor>
  <OperatorMethod id="_400" name="=" returns="_980" artificial="1" throw="" context="_13" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAaSERKS_" demangled="MOVEMENT_COMMAND_DATA::operator=(MOVEMENT_COMMAND_DATA const&amp;)" location="f2:52" file="f2" line="52" endline="52" inline="1">
    <Argument type="_981" location="f2:45" file="f2" line="45"/>
  </OperatorMethod>
  <Constructor id="_401" name="._1" artificial="1" throw="" context="_13" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAC1ERKS_ *INTERNAL* " demangled="MOVEMENT_COMMAND_DATA::MOVEMENT_COMMAND_DATA(MOVEMENT_COMMAND_DATA const&amp;)" location="f2:52" file="f2" line="52" endline="52" inline="1">
    <Argument type="_981" location="f2:45" file="f2" line="45"/>
  </Constructor>
  <Constructor id="_402" name="._1" artificial="1" throw="" context="_13" access="public" mangled="_ZN21MOVEMENT_COMMAND_DATAC1Ev *INTERNAL* " demangled="MOVEMENT_COMMAND_DATA::MOVEMENT_COMMAND_DATA()" location="f2:52" file="f2" line="52" inline="1"/>
  <FundamentalType id="_403" name="complex float" size="64" align="32"/>
  <FundamentalType id="_404" name="complex long double" size="256" align="128"/>
  <Field id="_405" name="sample_header" type="_134" offset="0" context="_22" access="public" location="f4:32" file="f4" line="32"/>
  <Field id="_406" name="source_timestamp" type="_385" offset="128" context="_22" access="public" location="f4:33" file="f4" line="33"/>
  <Destructor id="_407" name="._15" artificial="1" throw="" context="_22" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDD1Ev *INTERNAL* " demangled="MDF_SAMPLE_GENERATED::~MDF_SAMPLE_GENERATED()" location="f4:34" file="f4" line="34" endline="34" inline="1">
  </Destructor>
  <OperatorMethod id="_408" name="=" returns="_982" artificial="1" throw="" context="_22" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDaSERKS_" demangled="MDF_SAMPLE_GENERATED::operator=(MDF_SAMPLE_GENERATED const&amp;)" location="f4:34" file="f4" line="34" endline="34" inline="1">
    <Argument type="_983" location="f4:31" file="f4" line="31"/>
  </OperatorMethod>
  <Constructor id="_409" name="._15" artificial="1" throw="" context="_22" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDC1ERKS_ *INTERNAL* " demangled="MDF_SAMPLE_GENERATED::MDF_SAMPLE_GENERATED(MDF_SAMPLE_GENERATED const&amp;)" location="f4:34" file="f4" line="34" endline="34" inline="1">
    <Argument type="_983" location="f4:31" file="f4" line="31"/>
  </Constructor>
  <Constructor id="_410" name="._15" artificial="1" throw="" context="_22" access="public" mangled="_ZN20MDF_SAMPLE_GENERATEDC1Ev *INTERNAL* " demangled="MDF_SAMPLE_GENERATED::MDF_SAMPLE_GENERATED()" location="f4:34" file="f4" line="34" inline="1"/>
  <FundamentalType id="_411" name="complex double" size="128" align="64"/>
  <Field id="_412" name="sample_header" type="_134" offset="0" context="_45" access="public" location="f2:122" file="f2" line="122"/>
  <Field id="_413" name="RTMA_received_time" type="_385" offset="128" context="_45" access="public" location="f2:123" file="f2" line="123"/>
  <Field id="_414" name="pos" type="_977" offset="192" context="_45" access="public" location="f2:124" file="f2" line="124"/>
  <Field id="_415" name="vel" type="_977" offset="1344" context="_45" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_416" name="CoriMatrix" type="_984" offset="2496" context="_45" access="public" location="f2:126" file="f2" line="126"/>
  <Destructor id="_417" name="._8" artificial="1" throw="" context="_45" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATED1Ev *INTERNAL* " demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::~ROBOT_CONTROL_SPACE_ACTUAL_STATE()" location="f2:127" file="f2" line="127" endline="127" inline="1">
  </Destructor>
  <OperatorMethod id="_418" name="=" returns="_985" artificial="1" throw="" context="_45" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATEaSERKS_" demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::operator=(ROBOT_CONTROL_SPACE_ACTUAL_STATE const&amp;)" location="f2:127" file="f2" line="127" endline="127" inline="1">
    <Argument type="_986" location="f2:121" file="f2" line="121"/>
  </OperatorMethod>
  <Constructor id="_419" name="._8" artificial="1" throw="" context="_45" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATEC1ERKS_ *INTERNAL* " demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::ROBOT_CONTROL_SPACE_ACTUAL_STATE(ROBOT_CONTROL_SPACE_ACTUAL_STATE const&amp;)" location="f2:127" file="f2" line="127" endline="127" inline="1">
    <Argument type="_986" location="f2:121" file="f2" line="121"/>
  </Constructor>
  <Constructor id="_420" name="._8" artificial="1" throw="" context="_45" access="public" mangled="_ZN32ROBOT_CONTROL_SPACE_ACTUAL_STATEC1Ev *INTERNAL* " demangled="ROBOT_CONTROL_SPACE_ACTUAL_STATE::ROBOT_CONTROL_SPACE_ACTUAL_STATE()" location="f2:127" file="f2" line="127" inline="1"/>
  <Field id="_421" name="time" type="_987" offset="0" context="_58" access="public" location="f3:441" file="f3" line="441"/>
  <Field id="_422" name="chan" type="_988" offset="16384" context="_58" access="public" location="f3:442" file="f3" line="442"/>
  <Field id="_423" name="unit" type="_989" offset="20480" context="_58" access="public" location="f3:443" file="f3" line="443"/>
  <Field id="_424" name="box_id" type="_989" offset="22528" context="_58" access="public" location="f3:444" file="f3" line="444"/>
  <Destructor id="_425" name="._49" artificial="1" throw="" context="_58" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESD1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_TIMES::~MDF_SPM_SPIKE_TIMES()" location="f3:445" file="f3" line="445" endline="445" inline="1">
  </Destructor>
  <OperatorMethod id="_426" name="=" returns="_990" artificial="1" throw="" context="_58" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESaSERKS_" demangled="MDF_SPM_SPIKE_TIMES::operator=(MDF_SPM_SPIKE_TIMES const&amp;)" location="f3:445" file="f3" line="445" endline="445" inline="1">
    <Argument type="_991" location="f3:440" file="f3" line="440"/>
  </OperatorMethod>
  <Constructor id="_427" name="._49" artificial="1" throw="" context="_58" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESC1ERKS_ *INTERNAL* " demangled="MDF_SPM_SPIKE_TIMES::MDF_SPM_SPIKE_TIMES(MDF_SPM_SPIKE_TIMES const&amp;)" location="f3:445" file="f3" line="445" endline="445" inline="1">
    <Argument type="_991" location="f3:440" file="f3" line="440"/>
  </Constructor>
  <Constructor id="_428" name="._49" artificial="1" throw="" context="_58" access="public" mangled="_ZN19MDF_SPM_SPIKE_TIMESC1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_TIMES::MDF_SPM_SPIKE_TIMES()" location="f3:445" file="f3" line="445" inline="1"/>
  <Field id="_429" name="module" type="_979" offset="0" context="_60" access="public" location="f3:427" file="f3" line="427"/>
  <Destructor id="_430" name="._47" artificial="1" throw="" context="_60" access="public" mangled="_ZN16MDF_MODULE_STARTD1Ev *INTERNAL* " demangled="MDF_MODULE_START::~MDF_MODULE_START()" location="f3:428" file="f3" line="428" endline="428" inline="1">
  </Destructor>
  <OperatorMethod id="_431" name="=" returns="_992" artificial="1" throw="" context="_60" access="public" mangled="_ZN16MDF_MODULE_STARTaSERKS_" demangled="MDF_MODULE_START::operator=(MDF_MODULE_START const&amp;)" location="f3:428" file="f3" line="428" endline="428" inline="1">
    <Argument type="_993" location="f3:426" file="f3" line="426"/>
  </OperatorMethod>
  <Constructor id="_432" name="._47" artificial="1" throw="" context="_60" access="public" mangled="_ZN16MDF_MODULE_STARTC1ERKS_ *INTERNAL* " demangled="MDF_MODULE_START::MDF_MODULE_START(MDF_MODULE_START const&amp;)" location="f3:428" file="f3" line="428" endline="428" inline="1">
    <Argument type="_993" location="f3:426" file="f3" line="426"/>
  </Constructor>
  <Constructor id="_433" name="._47" artificial="1" throw="" context="_60" access="public" mangled="_ZN16MDF_MODULE_STARTC1Ev *INTERNAL* " demangled="MDF_MODULE_START::MDF_MODULE_START()" location="f3:428" file="f3" line="428" inline="1"/>
  <Field id="_434" name="x" type="_385" offset="0" context="_67" access="public" location="f3:565" file="f3" line="565"/>
  <Field id="_435" name="y" type="_385" offset="64" context="_67" access="public" location="f3:566" file="f3" line="566"/>
  <Field id="_436" name="z" type="_385" offset="128" context="_67" access="public" location="f3:567" file="f3" line="567"/>
  <Destructor id="_437" name="._67" artificial="1" throw="" context="_67" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_POSITION_FEEDBACK::~MDF_POSITION_FEEDBACK()" location="f3:568" file="f3" line="568" endline="568" inline="1">
  </Destructor>
  <OperatorMethod id="_438" name="=" returns="_994" artificial="1" throw="" context="_67" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKaSERKS_" demangled="MDF_POSITION_FEEDBACK::operator=(MDF_POSITION_FEEDBACK const&amp;)" location="f3:568" file="f3" line="568" endline="568" inline="1">
    <Argument type="_995" location="f3:564" file="f3" line="564"/>
  </OperatorMethod>
  <Constructor id="_439" name="._67" artificial="1" throw="" context="_67" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_POSITION_FEEDBACK::MDF_POSITION_FEEDBACK(MDF_POSITION_FEEDBACK const&amp;)" location="f3:568" file="f3" line="568" endline="568" inline="1">
    <Argument type="_995" location="f3:564" file="f3" line="564"/>
  </Constructor>
  <Constructor id="_440" name="._67" artificial="1" throw="" context="_67" access="public" mangled="_ZN21MDF_POSITION_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_POSITION_FEEDBACK::MDF_POSITION_FEEDBACK()" location="f3:568" file="f3" line="568" inline="1"/>
  <Field id="_441" name="x" type="_385" offset="0" context="_73" access="public" location="f3:558" file="f3" line="558"/>
  <Field id="_442" name="y" type="_385" offset="64" context="_73" access="public" location="f3:559" file="f3" line="559"/>
  <Field id="_443" name="z" type="_385" offset="128" context="_73" access="public" location="f3:560" file="f3" line="560"/>
  <Destructor id="_444" name="._66" artificial="1" throw="" context="_73" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_FORCE_FEEDBACK::~MDF_FORCE_FEEDBACK()" location="f3:561" file="f3" line="561" endline="561" inline="1">
  </Destructor>
  <OperatorMethod id="_445" name="=" returns="_996" artificial="1" throw="" context="_73" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKaSERKS_" demangled="MDF_FORCE_FEEDBACK::operator=(MDF_FORCE_FEEDBACK const&amp;)" location="f3:561" file="f3" line="561" endline="561" inline="1">
    <Argument type="_997" location="f3:557" file="f3" line="557"/>
  </OperatorMethod>
  <Constructor id="_446" name="._66" artificial="1" throw="" context="_73" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_FORCE_FEEDBACK::MDF_FORCE_FEEDBACK(MDF_FORCE_FEEDBACK const&amp;)" location="f3:561" file="f3" line="561" endline="561" inline="1">
    <Argument type="_997" location="f3:557" file="f3" line="557"/>
  </Constructor>
  <Constructor id="_447" name="._66" artificial="1" throw="" context="_73" access="public" mangled="_ZN18MDF_FORCE_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_FORCE_FEEDBACK::MDF_FORCE_FEEDBACK()" location="f3:561" file="f3" line="561" inline="1"/>
  <Field id="_448" name="full_path" type="_998" offset="0" context="_81" access="public" location="f3:399" file="f3" line="399"/>
  <Destructor id="_449" name="._41" artificial="1" throw="" context="_81" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGD1Ev *INTERNAL* " demangled="MDF_LOAD_DECODER_CONFIG::~MDF_LOAD_DECODER_CONFIG()" location="f3:400" file="f3" line="400" endline="400" inline="1">
  </Destructor>
  <OperatorMethod id="_450" name="=" returns="_999" artificial="1" throw="" context="_81" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGaSERKS_" demangled="MDF_LOAD_DECODER_CONFIG::operator=(MDF_LOAD_DECODER_CONFIG const&amp;)" location="f3:400" file="f3" line="400" endline="400" inline="1">
    <Argument type="_1000" location="f3:398" file="f3" line="398"/>
  </OperatorMethod>
  <Constructor id="_451" name="._41" artificial="1" throw="" context="_81" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_LOAD_DECODER_CONFIG::MDF_LOAD_DECODER_CONFIG(MDF_LOAD_DECODER_CONFIG const&amp;)" location="f3:400" file="f3" line="400" endline="400" inline="1">
    <Argument type="_1000" location="f3:398" file="f3" line="398"/>
  </Constructor>
  <Constructor id="_452" name="._41" artificial="1" throw="" context="_81" access="public" mangled="_ZN23MDF_LOAD_DECODER_CONFIGC1Ev *INTERNAL* " demangled="MDF_LOAD_DECODER_CONFIG::MDF_LOAD_DECODER_CONFIG()" location="f3:400" file="f3" line="400" inline="1"/>
  <FundamentalType id="_453" name="void" align="8"/>
  <PointerType id="_454" type="_453" size="64" align="64"/>
  <Field id="_455" name="sample_header" type="_134" offset="0" context="_89" access="public" location="f2:57" file="f2" line="57"/>
  <Field id="_456" name="dof_vals" type="_1001" offset="128" context="_89" access="public" location="f2:58" file="f2" line="58"/>
  <Field id="_457" name="tag" type="_979" offset="1472" context="_89" access="public" location="f2:59" file="f2" line="59"/>
  <Destructor id="_458" name="._2" artificial="1" throw="" context="_89" access="public" mangled="_ZN14INPUT_DOF_DATAD1Ev *INTERNAL* " demangled="INPUT_DOF_DATA::~INPUT_DOF_DATA()" location="f2:60" file="f2" line="60" endline="60" inline="1">
  </Destructor>
  <OperatorMethod id="_459" name="=" returns="_1002" artificial="1" throw="" context="_89" access="public" mangled="_ZN14INPUT_DOF_DATAaSERKS_" demangled="INPUT_DOF_DATA::operator=(INPUT_DOF_DATA const&amp;)" location="f2:60" file="f2" line="60" endline="60" inline="1">
    <Argument type="_1003" location="f2:56" file="f2" line="56"/>
  </OperatorMethod>
  <Constructor id="_460" name="._2" artificial="1" throw="" context="_89" access="public" mangled="_ZN14INPUT_DOF_DATAC1ERKS_ *INTERNAL* " demangled="INPUT_DOF_DATA::INPUT_DOF_DATA(INPUT_DOF_DATA const&amp;)" location="f2:60" file="f2" line="60" endline="60" inline="1">
    <Argument type="_1003" location="f2:56" file="f2" line="56"/>
  </Constructor>
  <Constructor id="_461" name="._2" artificial="1" throw="" context="_89" access="public" mangled="_ZN14INPUT_DOF_DATAC1Ev *INTERNAL* " demangled="INPUT_DOF_DATA::INPUT_DOF_DATA()" location="f2:60" file="f2" line="60" inline="1"/>
  <Field id="_462" name="event_time" type="_385" offset="0" context="_91" access="public" location="f2:64" file="f2" line="64"/>
  <Field id="_463" name="event_code" type="_387" offset="64" context="_91" access="public" location="f2:65" file="f2" line="65"/>
  <Field id="_464" name="reserved" type="_387" offset="96" context="_91" access="public" location="f2:66" file="f2" line="66"/>
  <Destructor id="_465" name="._3" artificial="1" throw="" context="_91" access="public" mangled="_ZN11TRIAL_EVENTD1Ev *INTERNAL* " demangled="TRIAL_EVENT::~TRIAL_EVENT()" location="f2:67" file="f2" line="67" endline="67" inline="1">
  </Destructor>
  <OperatorMethod id="_466" name="=" returns="_1004" artificial="1" throw="" context="_91" access="public" mangled="_ZN11TRIAL_EVENTaSERKS_" demangled="TRIAL_EVENT::operator=(TRIAL_EVENT const&amp;)" location="f2:67" file="f2" line="67" endline="67" inline="1">
    <Argument type="_1005" location="f2:63" file="f2" line="63"/>
  </OperatorMethod>
  <Constructor id="_467" name="._3" artificial="1" throw="" context="_91" access="public" mangled="_ZN11TRIAL_EVENTC1ERKS_ *INTERNAL* " demangled="TRIAL_EVENT::TRIAL_EVENT(TRIAL_EVENT const&amp;)" location="f2:67" file="f2" line="67" endline="67" inline="1">
    <Argument type="_1005" location="f2:63" file="f2" line="63"/>
  </Constructor>
  <Constructor id="_468" name="._3" artificial="1" throw="" context="_91" access="public" mangled="_ZN11TRIAL_EVENTC1Ev *INTERNAL* " demangled="TRIAL_EVENT::TRIAL_EVENT()" location="f2:67" file="f2" line="67" inline="1"/>
  <Field id="_469" name="source_index" type="_387" offset="0" context="_94" access="public" location="f4:17" file="f4" line="17"/>
  <Field id="_470" name="reserved" type="_387" offset="32" context="_94" access="public" location="f4:18" file="f4" line="18"/>
  <Field id="_471" name="source_timestamp" type="_385" offset="64" context="_94" access="public" location="f4:19" file="f4" line="19"/>
  <Field id="_472" name="count_interval" type="_385" offset="128" context="_94" access="public" location="f4:20" file="f4" line="20"/>
  <Field id="_473" name="counts" type="_1006" offset="192" context="_94" access="public" location="f4:21" file="f4" line="21"/>
  <Destructor id="_474" name="._13" artificial="1" throw="" context="_94" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTD1Ev *INTERNAL* " demangled="MDF_RAW_SPIKECOUNT::~MDF_RAW_SPIKECOUNT()" location="f4:22" file="f4" line="22" endline="22" inline="1">
  </Destructor>
  <OperatorMethod id="_475" name="=" returns="_1007" artificial="1" throw="" context="_94" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTaSERKS_" demangled="MDF_RAW_SPIKECOUNT::operator=(MDF_RAW_SPIKECOUNT const&amp;)" location="f4:22" file="f4" line="22" endline="22" inline="1">
    <Argument type="_1008" location="f4:16" file="f4" line="16"/>
  </OperatorMethod>
  <Constructor id="_476" name="._13" artificial="1" throw="" context="_94" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTC1ERKS_ *INTERNAL* " demangled="MDF_RAW_SPIKECOUNT::MDF_RAW_SPIKECOUNT(MDF_RAW_SPIKECOUNT const&amp;)" location="f4:22" file="f4" line="22" endline="22" inline="1">
    <Argument type="_1008" location="f4:16" file="f4" line="16"/>
  </Constructor>
  <Constructor id="_477" name="._13" artificial="1" throw="" context="_94" access="public" mangled="_ZN18MDF_RAW_SPIKECOUNTC1Ev *INTERNAL* " demangled="MDF_RAW_SPIKECOUNT::MDF_RAW_SPIKECOUNT()" location="f4:22" file="f4" line="22" inline="1"/>
  <Field id="_478" name="state" type="_387" offset="0" context="_95" access="public" location="f3:448" file="f3" line="448"/>
  <Field id="_479" name="reserved" type="_387" offset="32" context="_95" access="public" location="f3:449" file="f3" line="449"/>
  <Destructor id="_480" name="._50" artificial="1" throw="" context="_95" access="public" mangled="_ZN18MDF_IDLY_LABELLINGD1Ev *INTERNAL* " demangled="MDF_IDLY_LABELLING::~MDF_IDLY_LABELLING()" location="f3:450" file="f3" line="450" endline="450" inline="1">
  </Destructor>
  <OperatorMethod id="_481" name="=" returns="_1009" artificial="1" throw="" context="_95" access="public" mangled="_ZN18MDF_IDLY_LABELLINGaSERKS_" demangled="MDF_IDLY_LABELLING::operator=(MDF_IDLY_LABELLING const&amp;)" location="f3:450" file="f3" line="450" endline="450" inline="1">
    <Argument type="_1010" location="f3:447" file="f3" line="447"/>
  </OperatorMethod>
  <Constructor id="_482" name="._50" artificial="1" throw="" context="_95" access="public" mangled="_ZN18MDF_IDLY_LABELLINGC1ERKS_ *INTERNAL* " demangled="MDF_IDLY_LABELLING::MDF_IDLY_LABELLING(MDF_IDLY_LABELLING const&amp;)" location="f3:450" file="f3" line="450" endline="450" inline="1">
    <Argument type="_1010" location="f3:447" file="f3" line="447"/>
  </Constructor>
  <Constructor id="_483" name="._50" artificial="1" throw="" context="_95" access="public" mangled="_ZN18MDF_IDLY_LABELLINGC1Ev *INTERNAL* " demangled="MDF_IDLY_LABELLING::MDF_IDLY_LABELLING()" location="f3:450" file="f3" line="450" inline="1"/>
  <Field id="_484" name="data" type="_1011" offset="0" context="_97" access="public" location="f3:419" file="f3" line="419"/>
  <Destructor id="_485" name="._45" artificial="1" throw="" context="_97" access="public" mangled="_ZN16MDF_DEBUG_VECTORD1Ev *INTERNAL* " demangled="MDF_DEBUG_VECTOR::~MDF_DEBUG_VECTOR()" location="f3:420" file="f3" line="420" endline="420" inline="1">
  </Destructor>
  <OperatorMethod id="_486" name="=" returns="_1012" artificial="1" throw="" context="_97" access="public" mangled="_ZN16MDF_DEBUG_VECTORaSERKS_" demangled="MDF_DEBUG_VECTOR::operator=(MDF_DEBUG_VECTOR const&amp;)" location="f3:420" file="f3" line="420" endline="420" inline="1">
    <Argument type="_1013" location="f3:418" file="f3" line="418"/>
  </OperatorMethod>
  <Constructor id="_487" name="._45" artificial="1" throw="" context="_97" access="public" mangled="_ZN16MDF_DEBUG_VECTORC1ERKS_ *INTERNAL* " demangled="MDF_DEBUG_VECTOR::MDF_DEBUG_VECTOR(MDF_DEBUG_VECTOR const&amp;)" location="f3:420" file="f3" line="420" endline="420" inline="1">
    <Argument type="_1013" location="f3:418" file="f3" line="418"/>
  </Constructor>
  <Constructor id="_488" name="._45" artificial="1" throw="" context="_97" access="public" mangled="_ZN16MDF_DEBUG_VECTORC1Ev *INTERNAL* " demangled="MDF_DEBUG_VECTOR::MDF_DEBUG_VECTOR()" location="f3:420" file="f3" line="420" inline="1"/>
  <Field id="_489" name="module_name" type="_979" offset="0" context="_104" access="public" location="f3:385" file="f3" line="385"/>
  <Field id="_490" name="version" type="_979" offset="512" context="_104" access="public" location="f3:386" file="f3" line="386"/>
  <Destructor id="_491" name="._39" artificial="1" throw="" context="_104" access="public" mangled="_ZN16MDF_CODE_VERSIOND1Ev *INTERNAL* " demangled="MDF_CODE_VERSION::~MDF_CODE_VERSION()" location="f3:387" file="f3" line="387" endline="387" inline="1">
  </Destructor>
  <OperatorMethod id="_492" name="=" returns="_1014" artificial="1" throw="" context="_104" access="public" mangled="_ZN16MDF_CODE_VERSIONaSERKS_" demangled="MDF_CODE_VERSION::operator=(MDF_CODE_VERSION const&amp;)" location="f3:387" file="f3" line="387" endline="387" inline="1">
    <Argument type="_1015" location="f3:384" file="f3" line="384"/>
  </OperatorMethod>
  <Constructor id="_493" name="._39" artificial="1" throw="" context="_104" access="public" mangled="_ZN16MDF_CODE_VERSIONC1ERKS_ *INTERNAL* " demangled="MDF_CODE_VERSION::MDF_CODE_VERSION(MDF_CODE_VERSION const&amp;)" location="f3:387" file="f3" line="387" endline="387" inline="1">
    <Argument type="_1015" location="f3:384" file="f3" line="384"/>
  </Constructor>
  <Constructor id="_494" name="._39" artificial="1" throw="" context="_104" access="public" mangled="_ZN16MDF_CODE_VERSIONC1Ev *INTERNAL* " demangled="MDF_CODE_VERSION::MDF_CODE_VERSION()" location="f3:387" file="f3" line="387" inline="1"/>
  <PointerType id="_495" type="_453c" size="64" align="64"/>
  <FundamentalType id="_496" name="unsigned int" size="32" align="32"/>
  <PointerType id="_497" type="_387" size="64" align="64"/>
  <Field id="_498" name="SerialNo" type="_387" offset="0" context="_134" access="public" location="f2:23" file="f2" line="23"/>
  <Field id="_499" name="Flags" type="_387" offset="32" context="_134" access="public" location="f2:24" file="f2" line="24"/>
  <Field id="_500" name="DeltaTime" type="_385" offset="64" context="_134" access="public" location="f2:25" file="f2" line="25"/>
  <Destructor id="_501" name="._0" artificial="1" throw="" context="_134" access="public" mangled="_ZN13SAMPLE_HEADERD1Ev *INTERNAL* " demangled="SAMPLE_HEADER::~SAMPLE_HEADER()" location="f2:26" file="f2" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_502" name="=" returns="_1017" artificial="1" throw="" context="_134" access="public" mangled="_ZN13SAMPLE_HEADERaSERKS_" demangled="SAMPLE_HEADER::operator=(SAMPLE_HEADER const&amp;)" location="f2:26" file="f2" line="26" endline="26" inline="1">
    <Argument type="_1018" location="f2:22" file="f2" line="22"/>
  </OperatorMethod>
  <Constructor id="_503" name="._0" artificial="1" throw="" context="_134" access="public" mangled="_ZN13SAMPLE_HEADERC1ERKS_ *INTERNAL* " demangled="SAMPLE_HEADER::SAMPLE_HEADER(SAMPLE_HEADER const&amp;)" location="f2:26" file="f2" line="26" endline="26" inline="1">
    <Argument type="_1018" location="f2:22" file="f2" line="22"/>
  </Constructor>
  <Constructor id="_504" name="._0" artificial="1" throw="" context="_134" access="public" mangled="_ZN13SAMPLE_HEADERC1Ev *INTERNAL* " demangled="SAMPLE_HEADER::SAMPLE_HEADER()" location="f2:26" file="f2" line="26" inline="1"/>
  <Field id="_505" name="configID" type="_387" offset="0" context="_138" access="public" location="f3:255" file="f3" line="255"/>
  <Field id="_506" name="afcf" type="_387" offset="32" context="_138" access="public" location="f3:256" file="f3" line="256"/>
  <Field id="_507" name="pulses" type="_385" offset="64" context="_138" access="public" location="f3:257" file="f3" line="257"/>
  <Field id="_508" name="amp1" type="_385" offset="128" context="_138" access="public" location="f3:258" file="f3" line="258"/>
  <Field id="_509" name="amp2" type="_385" offset="192" context="_138" access="public" location="f3:259" file="f3" line="259"/>
  <Field id="_510" name="width1" type="_385" offset="256" context="_138" access="public" location="f3:260" file="f3" line="260"/>
  <Field id="_511" name="width2" type="_385" offset="320" context="_138" access="public" location="f3:261" file="f3" line="261"/>
  <Field id="_512" name="frequency" type="_385" offset="384" context="_138" access="public" location="f3:262" file="f3" line="262"/>
  <Field id="_513" name="interphase" type="_385" offset="448" context="_138" access="public" location="f3:263" file="f3" line="263"/>
  <Destructor id="_514" name="._25" artificial="1" throw="" context="_138" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULED1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_MODULE::~MDF_CERESTIM_CONFIG_MODULE()" location="f3:264" file="f3" line="264" endline="264" inline="1">
  </Destructor>
  <OperatorMethod id="_515" name="=" returns="_1019" artificial="1" throw="" context="_138" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULEaSERKS_" demangled="MDF_CERESTIM_CONFIG_MODULE::operator=(MDF_CERESTIM_CONFIG_MODULE const&amp;)" location="f3:264" file="f3" line="264" endline="264" inline="1">
    <Argument type="_1020" location="f3:254" file="f3" line="254"/>
  </OperatorMethod>
  <Constructor id="_516" name="._25" artificial="1" throw="" context="_138" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULEC1ERKS_ *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_MODULE::MDF_CERESTIM_CONFIG_MODULE(MDF_CERESTIM_CONFIG_MODULE const&amp;)" location="f3:264" file="f3" line="264" endline="264" inline="1">
    <Argument type="_1020" location="f3:254" file="f3" line="254"/>
  </Constructor>
  <Constructor id="_517" name="._25" artificial="1" throw="" context="_138" access="public" mangled="_ZN26MDF_CERESTIM_CONFIG_MODULEC1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_MODULE::MDF_CERESTIM_CONFIG_MODULE()" location="f3:264" file="f3" line="264" inline="1"/>
  <Field id="_518" name="id" type="_387" offset="0" context="_142" access="public" location="f3:466" file="f3" line="466"/>
  <Field id="_519" name="reserved" type="_387" offset="32" context="_142" access="public" location="f3:467" file="f3" line="467"/>
  <Destructor id="_520" name="._52" artificial="1" throw="" context="_142" access="public" mangled="_ZN14MDF_PLAY_SOUNDD1Ev *INTERNAL* " demangled="MDF_PLAY_SOUND::~MDF_PLAY_SOUND()" location="f3:468" file="f3" line="468" endline="468" inline="1">
  </Destructor>
  <OperatorMethod id="_521" name="=" returns="_1021" artificial="1" throw="" context="_142" access="public" mangled="_ZN14MDF_PLAY_SOUNDaSERKS_" demangled="MDF_PLAY_SOUND::operator=(MDF_PLAY_SOUND const&amp;)" location="f3:468" file="f3" line="468" endline="468" inline="1">
    <Argument type="_1022" location="f3:465" file="f3" line="465"/>
  </OperatorMethod>
  <Constructor id="_522" name="._52" artificial="1" throw="" context="_142" access="public" mangled="_ZN14MDF_PLAY_SOUNDC1ERKS_ *INTERNAL* " demangled="MDF_PLAY_SOUND::MDF_PLAY_SOUND(MDF_PLAY_SOUND const&amp;)" location="f3:468" file="f3" line="468" endline="468" inline="1">
    <Argument type="_1022" location="f3:465" file="f3" line="465"/>
  </Constructor>
  <Constructor id="_523" name="._52" artificial="1" throw="" context="_142" access="public" mangled="_ZN14MDF_PLAY_SOUNDC1Ev *INTERNAL* " demangled="MDF_PLAY_SOUND::MDF_PLAY_SOUND()" location="f3:468" file="f3" line="468" inline="1"/>
  <FundamentalType id="_524" name="long int" size="64" align="64"/>
  <Field id="_525" name="SerialNo" type="_496" offset="0" context="_148" access="public" location="f3:530" file="f3" line="530"/>
  <Field id="_526" name="reserved" type="_496" offset="32" context="_148" access="public" location="f3:531" file="f3" line="531"/>
  <Destructor id="_527" name="._61" artificial="1" throw="" context="_148" access="public" mangled="_ZN14MDF_SYNC_PULSED1Ev *INTERNAL* " demangled="MDF_SYNC_PULSE::~MDF_SYNC_PULSE()" location="f3:532" file="f3" line="532" endline="532" inline="1">
  </Destructor>
  <OperatorMethod id="_528" name="=" returns="_1023" artificial="1" throw="" context="_148" access="public" mangled="_ZN14MDF_SYNC_PULSEaSERKS_" demangled="MDF_SYNC_PULSE::operator=(MDF_SYNC_PULSE const&amp;)" location="f3:532" file="f3" line="532" endline="532" inline="1">
    <Argument type="_1024" location="f3:529" file="f3" line="529"/>
  </OperatorMethod>
  <Constructor id="_529" name="._61" artificial="1" throw="" context="_148" access="public" mangled="_ZN14MDF_SYNC_PULSEC1ERKS_ *INTERNAL* " demangled="MDF_SYNC_PULSE::MDF_SYNC_PULSE(MDF_SYNC_PULSE const&amp;)" location="f3:532" file="f3" line="532" endline="532" inline="1">
    <Argument type="_1024" location="f3:529" file="f3" line="529"/>
  </Constructor>
  <Constructor id="_530" name="._61" artificial="1" throw="" context="_148" access="public" mangled="_ZN14MDF_SYNC_PULSEC1Ev *INTERNAL* " demangled="MDF_SYNC_PULSE::MDF_SYNC_PULSE()" location="f3:532" file="f3" line="532" inline="1"/>
  <Field id="_531" name="time" type="_385" offset="0" context="_152" access="public" location="f3:471" file="f3" line="471"/>
  <Destructor id="_532" name="._53" artificial="1" throw="" context="_152" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDD1Ev *INTERNAL* " demangled="MDF_ARTIFACT_REJECTED::~MDF_ARTIFACT_REJECTED()" location="f3:472" file="f3" line="472" endline="472" inline="1">
  </Destructor>
  <OperatorMethod id="_533" name="=" returns="_1025" artificial="1" throw="" context="_152" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDaSERKS_" demangled="MDF_ARTIFACT_REJECTED::operator=(MDF_ARTIFACT_REJECTED const&amp;)" location="f3:472" file="f3" line="472" endline="472" inline="1">
    <Argument type="_1026" location="f3:470" file="f3" line="470"/>
  </OperatorMethod>
  <Constructor id="_534" name="._53" artificial="1" throw="" context="_152" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDC1ERKS_ *INTERNAL* " demangled="MDF_ARTIFACT_REJECTED::MDF_ARTIFACT_REJECTED(MDF_ARTIFACT_REJECTED const&amp;)" location="f3:472" file="f3" line="472" endline="472" inline="1">
    <Argument type="_1026" location="f3:470" file="f3" line="470"/>
  </Constructor>
  <Constructor id="_535" name="._53" artificial="1" throw="" context="_152" access="public" mangled="_ZN21MDF_ARTIFACT_REJECTEDC1Ev *INTERNAL* " demangled="MDF_ARTIFACT_REJECTED::MDF_ARTIFACT_REJECTED()" location="f3:472" file="f3" line="472" inline="1"/>
  <PointerType id="_536" type="_389" size="64" align="64"/>
  <Field id="_537" name="tool_id" type="_387" offset="0" context="_155" access="public" location="f3:321" file="f3" line="321"/>
  <Field id="_538" name="reserved" type="_387" offset="32" context="_155" access="public" location="f3:322" file="f3" line="322"/>
  <Destructor id="_539" name="._34" artificial="1" throw="" context="_155" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETED1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL_COMPLETE::~MDF_CHANGE_TOOL_COMPLETE()" location="f3:323" file="f3" line="323" endline="323" inline="1">
  </Destructor>
  <OperatorMethod id="_540" name="=" returns="_1027" artificial="1" throw="" context="_155" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETEaSERKS_" demangled="MDF_CHANGE_TOOL_COMPLETE::operator=(MDF_CHANGE_TOOL_COMPLETE const&amp;)" location="f3:323" file="f3" line="323" endline="323" inline="1">
    <Argument type="_1028" location="f3:320" file="f3" line="320"/>
  </OperatorMethod>
  <Constructor id="_541" name="._34" artificial="1" throw="" context="_155" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETEC1ERKS_ *INTERNAL* " demangled="MDF_CHANGE_TOOL_COMPLETE::MDF_CHANGE_TOOL_COMPLETE(MDF_CHANGE_TOOL_COMPLETE const&amp;)" location="f3:323" file="f3" line="323" endline="323" inline="1">
    <Argument type="_1028" location="f3:320" file="f3" line="320"/>
  </Constructor>
  <Constructor id="_542" name="._34" artificial="1" throw="" context="_155" access="public" mangled="_ZN24MDF_CHANGE_TOOL_COMPLETEC1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL_COMPLETE::MDF_CHANGE_TOOL_COMPLETE()" location="f3:323" file="f3" line="323" inline="1"/>
  <PointerType id="_543" type="_390" size="64" align="64"/>
  <Field id="_544" name="sample_header" type="_134" offset="0" context="_158" access="public" location="f4:26" file="f4" line="26"/>
  <Field id="_545" name="source_timestamp" type="_385" offset="128" context="_158" access="public" location="f4:27" file="f4" line="27"/>
  <Field id="_546" name="count_interval" type="_385" offset="192" context="_158" access="public" location="f4:28" file="f4" line="28"/>
  <Field id="_547" name="counts" type="_1029" offset="256" context="_158" access="public" location="f4:29" file="f4" line="29"/>
  <Destructor id="_548" name="._14" artificial="1" throw="" context="_158" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTD1Ev *INTERNAL* " demangled="MDF_SPM_SPIKECOUNT::~MDF_SPM_SPIKECOUNT()" location="f4:30" file="f4" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_549" name="=" returns="_1030" artificial="1" throw="" context="_158" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTaSERKS_" demangled="MDF_SPM_SPIKECOUNT::operator=(MDF_SPM_SPIKECOUNT const&amp;)" location="f4:30" file="f4" line="30" endline="30" inline="1">
    <Argument type="_1031" location="f4:25" file="f4" line="25"/>
  </OperatorMethod>
  <Constructor id="_550" name="._14" artificial="1" throw="" context="_158" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTC1ERKS_ *INTERNAL* " demangled="MDF_SPM_SPIKECOUNT::MDF_SPM_SPIKECOUNT(MDF_SPM_SPIKECOUNT const&amp;)" location="f4:30" file="f4" line="30" endline="30" inline="1">
    <Argument type="_1031" location="f4:25" file="f4" line="25"/>
  </Constructor>
  <Constructor id="_551" name="._14" artificial="1" throw="" context="_158" access="public" mangled="_ZN18MDF_SPM_SPIKECOUNTC1Ev *INTERNAL* " demangled="MDF_SPM_SPIKECOUNT::MDF_SPM_SPIKECOUNT()" location="f4:30" file="f4" line="30" inline="1"/>
  <Field id="_552" name="sample_header" type="_134" offset="0" context="_164" access="public" location="f3:505" file="f3" line="505"/>
  <Field id="_553" name="applied" type="_387" offset="128" context="_164" access="public" location="f3:506" file="f3" line="506"/>
  <Field id="_554" name="reserved" type="_387" offset="160" context="_164" access="public" location="f3:507" file="f3" line="507"/>
  <Destructor id="_555" name="._58" artificial="1" throw="" context="_164" access="public" mangled="_ZN17MDF_FORCE_APPLIEDD1Ev *INTERNAL* " demangled="MDF_FORCE_APPLIED::~MDF_FORCE_APPLIED()" location="f3:508" file="f3" line="508" endline="508" inline="1">
  </Destructor>
  <OperatorMethod id="_556" name="=" returns="_1032" artificial="1" throw="" context="_164" access="public" mangled="_ZN17MDF_FORCE_APPLIEDaSERKS_" demangled="MDF_FORCE_APPLIED::operator=(MDF_FORCE_APPLIED const&amp;)" location="f3:508" file="f3" line="508" endline="508" inline="1">
    <Argument type="_1033" location="f3:504" file="f3" line="504"/>
  </OperatorMethod>
  <Constructor id="_557" name="._58" artificial="1" throw="" context="_164" access="public" mangled="_ZN17MDF_FORCE_APPLIEDC1ERKS_ *INTERNAL* " demangled="MDF_FORCE_APPLIED::MDF_FORCE_APPLIED(MDF_FORCE_APPLIED const&amp;)" location="f3:508" file="f3" line="508" endline="508" inline="1">
    <Argument type="_1033" location="f3:504" file="f3" line="504"/>
  </Constructor>
  <Constructor id="_558" name="._58" artificial="1" throw="" context="_164" access="public" mangled="_ZN17MDF_FORCE_APPLIEDC1Ev *INTERNAL* " demangled="MDF_FORCE_APPLIED::MDF_FORCE_APPLIED()" location="f3:508" file="f3" line="508" inline="1"/>
  <Field id="_559" name="cmd" type="_1034" offset="0" context="_170" access="public" location="f2:135" file="f2" line="135"/>
  <Destructor id="_560" name="._10" artificial="1" throw="" context="_170" access="public" mangled="_ZN12JVEL_COMMANDD1Ev *INTERNAL* " demangled="JVEL_COMMAND::~JVEL_COMMAND()" location="f2:136" file="f2" line="136" endline="136" inline="1">
  </Destructor>
  <OperatorMethod id="_561" name="=" returns="_1035" artificial="1" throw="" context="_170" access="public" mangled="_ZN12JVEL_COMMANDaSERKS_" demangled="JVEL_COMMAND::operator=(JVEL_COMMAND const&amp;)" location="f2:136" file="f2" line="136" endline="136" inline="1">
    <Argument type="_1036" location="f2:134" file="f2" line="134"/>
  </OperatorMethod>
  <Constructor id="_562" name="._10" artificial="1" throw="" context="_170" access="public" mangled="_ZN12JVEL_COMMANDC1ERKS_ *INTERNAL* " demangled="JVEL_COMMAND::JVEL_COMMAND(JVEL_COMMAND const&amp;)" location="f2:136" file="f2" line="136" endline="136" inline="1">
    <Argument type="_1036" location="f2:134" file="f2" line="134"/>
  </Constructor>
  <Constructor id="_563" name="._10" artificial="1" throw="" context="_170" access="public" mangled="_ZN12JVEL_COMMANDC1Ev *INTERNAL* " demangled="JVEL_COMMAND::JVEL_COMMAND()" location="f2:136" file="f2" line="136" inline="1"/>
  <Field id="_564" name="sample_header" type="_134" offset="0" context="_172" access="public" location="f2:147" file="f2" line="147"/>
  <Field id="_565" name="autoControl" type="_234" offset="128" context="_172" access="public" location="f2:148" file="f2" line="148"/>
  <Field id="_566" name="overrideCommand" type="_186" offset="1408" context="_172" access="public" location="f2:149" file="f2" line="149"/>
  <Field id="_567" name="RTMA_received_time" type="_385" offset="3072" context="_172" access="public" location="f2:150" file="f2" line="150"/>
  <Field id="_568" name="actualControlPos" type="_977" offset="3136" context="_172" access="public" location="f2:151" file="f2" line="151"/>
  <Field id="_569" name="actualControlVel" type="_977" offset="4288" context="_172" access="public" location="f2:152" file="f2" line="152"/>
  <Field id="_570" name="autoControlPos" type="_977" offset="5440" context="_172" access="public" location="f2:153" file="f2" line="153"/>
  <Field id="_571" name="autoControlVel" type="_977" offset="6592" context="_172" access="public" location="f2:154" file="f2" line="154"/>
  <Field id="_572" name="autoPosControlFraction" type="_977" offset="7744" context="_172" access="public" location="f2:155" file="f2" line="155"/>
  <Field id="_573" name="autoVelControlFraction" type="_977" offset="8896" context="_172" access="public" location="f2:156" file="f2" line="156"/>
  <Field id="_574" name="orthPosImpedance" type="_977" offset="10048" context="_172" access="public" location="f2:157" file="f2" line="157"/>
  <Field id="_575" name="orthVelImpedance" type="_977" offset="11200" context="_172" access="public" location="f2:158" file="f2" line="158"/>
  <Field id="_576" name="intrinsicVelControlled" type="_978" offset="12352" context="_172" access="public" location="f2:159" file="f2" line="159"/>
  <Field id="_577" name="intrinsicPosControlled" type="_978" offset="12928" context="_172" access="public" location="f2:160" file="f2" line="160"/>
  <Field id="_578" name="extrinsicVelControlled" type="_978" offset="13504" context="_172" access="public" location="f2:161" file="f2" line="161"/>
  <Field id="_579" name="extrinsicPosControlled" type="_978" offset="14080" context="_172" access="public" location="f2:162" file="f2" line="162"/>
  <Field id="_580" name="overrideDimensions" type="_978" offset="14656" context="_172" access="public" location="f2:163" file="f2" line="163"/>
  <Field id="_581" name="actualCommandComposition" type="_496" offset="15232" context="_172" access="public" location="f2:164" file="f2" line="164"/>
  <Field id="_582" name="blank" type="_387" offset="15264" context="_172" access="public" location="f2:165" file="f2" line="165"/>
  <Destructor id="_583" name="._12" artificial="1" throw="" context="_172" access="public" mangled="_ZN19ROBOT_CONTROL_STATED1Ev *INTERNAL* " demangled="ROBOT_CONTROL_STATE::~ROBOT_CONTROL_STATE()" location="f2:166" file="f2" line="166" endline="166" inline="1">
  </Destructor>
  <OperatorMethod id="_584" name="=" returns="_1037" artificial="1" throw="" context="_172" access="public" mangled="_ZN19ROBOT_CONTROL_STATEaSERKS_" demangled="ROBOT_CONTROL_STATE::operator=(ROBOT_CONTROL_STATE const&amp;)" location="f2:166" file="f2" line="166" endline="166" inline="1">
    <Argument type="_1038" location="f2:146" file="f2" line="146"/>
  </OperatorMethod>
  <Constructor id="_585" name="._12" artificial="1" throw="" context="_172" access="public" mangled="_ZN19ROBOT_CONTROL_STATEC1ERKS_ *INTERNAL* " demangled="ROBOT_CONTROL_STATE::ROBOT_CONTROL_STATE(ROBOT_CONTROL_STATE const&amp;)" location="f2:166" file="f2" line="166" endline="166" inline="1">
    <Argument type="_1038" location="f2:146" file="f2" line="146"/>
  </Constructor>
  <Constructor id="_586" name="._12" artificial="1" throw="" context="_172" access="public" mangled="_ZN19ROBOT_CONTROL_STATEC1Ev *INTERNAL* " demangled="ROBOT_CONTROL_STATE::ROBOT_CONTROL_STATE()" location="f2:166" file="f2" line="166" inline="1"/>
  <Field id="_587" name="Cmd" type="_1039" offset="0" context="_181" access="public" location="f3:220" file="f3" line="220"/>
  <Destructor id="_588" name="._20" artificial="1" throw="" context="_181" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDD1Ev *INTERNAL* " demangled="MDF_OPTO_CNTRL_CMD::~MDF_OPTO_CNTRL_CMD()" location="f3:221" file="f3" line="221" endline="221" inline="1">
  </Destructor>
  <OperatorMethod id="_589" name="=" returns="_1040" artificial="1" throw="" context="_181" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDaSERKS_" demangled="MDF_OPTO_CNTRL_CMD::operator=(MDF_OPTO_CNTRL_CMD const&amp;)" location="f3:221" file="f3" line="221" endline="221" inline="1">
    <Argument type="_1041" location="f3:219" file="f3" line="219"/>
  </OperatorMethod>
  <Constructor id="_590" name="._20" artificial="1" throw="" context="_181" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDC1ERKS_ *INTERNAL* " demangled="MDF_OPTO_CNTRL_CMD::MDF_OPTO_CNTRL_CMD(MDF_OPTO_CNTRL_CMD const&amp;)" location="f3:221" file="f3" line="221" endline="221" inline="1">
    <Argument type="_1041" location="f3:219" file="f3" line="219"/>
  </Constructor>
  <Constructor id="_591" name="._20" artificial="1" throw="" context="_181" access="public" mangled="_ZN18MDF_OPTO_CNTRL_CMDC1Ev *INTERNAL* " demangled="MDF_OPTO_CNTRL_CMD::MDF_OPTO_CNTRL_CMD()" location="f3:221" file="f3" line="221" inline="1"/>
  <Field id="_592" name="id" type="_387" offset="0" context="_183" access="public" location="f3:330" file="f3" line="330"/>
  <Field id="_593" name="rep_num" type="_387" offset="32" context="_183" access="public" location="f3:331" file="f3" line="331"/>
  <Field id="_594" name="use_for_calib" type="_387" offset="64" context="_183" access="public" location="f3:332" file="f3" line="332"/>
  <Field id="_595" name="target_combo_index" type="_387" offset="96" context="_183" access="public" location="f3:333" file="f3" line="333"/>
  <Field id="_596" name="timed_out_conseq" type="_387" offset="128" context="_183" access="public" location="f3:334" file="f3" line="334"/>
  <Field id="_597" name="reach_offset" type="_387" offset="160" context="_183" access="public" location="f3:335" file="f3" line="335"/>
  <Field id="_598" name="relax_arm" type="_387" offset="192" context="_183" access="public" location="f3:336" file="f3" line="336"/>
  <Field id="_599" name="idle_gateable" type="_387" offset="224" context="_183" access="public" location="f3:337" file="f3" line="337"/>
  <Field id="_600" name="force_gateable" type="_387" offset="256" context="_183" access="public" location="f3:338" file="f3" line="338"/>
  <Field id="_601" name="direction" type="_387" offset="288" context="_183" access="public" location="f3:339" file="f3" line="339"/>
  <Field id="_602" name="idle_timeout" type="_385" offset="320" context="_183" access="public" location="f3:340" file="f3" line="340"/>
  <Field id="_603" name="ts_time" type="_385" offset="384" context="_183" access="public" location="f3:341" file="f3" line="341"/>
  <Field id="_604" name="target" type="_1042" offset="448" context="_183" access="public" location="f3:342" file="f3" line="342"/>
  <Field id="_605" name="coriMatrix" type="_984" offset="2560" context="_183" access="public" location="f3:343" file="f3" line="343"/>
  <Field id="_606" name="idle_target" type="_977" offset="3136" context="_183" access="public" location="f3:344" file="f3" line="344"/>
  <Field id="_607" name="trans_threshold" type="_385" offset="4288" context="_183" access="public" location="f3:345" file="f3" line="345"/>
  <Field id="_608" name="ori_threshold" type="_385" offset="4352" context="_183" access="public" location="f3:346" file="f3" line="346"/>
  <Field id="_609" name="trans_threshold_f" type="_385" offset="4416" context="_183" access="public" location="f3:347" file="f3" line="347"/>
  <Field id="_610" name="ori_threshold_f" type="_385" offset="4480" context="_183" access="public" location="f3:348" file="f3" line="348"/>
  <Field id="_611" name="sep_threshold" type="_1043" offset="4544" context="_183" access="public" location="f3:349" file="f3" line="349"/>
  <Field id="_612" name="sep_threshold_f" type="_1043" offset="5312" context="_183" access="public" location="f3:350" file="f3" line="350"/>
  <Field id="_613" name="sep_threshold_judging_polarity" type="_1044" offset="6080" context="_183" access="public" location="f3:351" file="f3" line="351"/>
  <Field id="_614" name="sep_threshold_f_judging_polarity" type="_1044" offset="6464" context="_183" access="public" location="f3:352" file="f3" line="352"/>
  <Field id="_615" name="sep_threshold_judging_outcome" type="_1044" offset="6848" context="_183" access="public" location="f3:353" file="f3" line="353"/>
  <Field id="_616" name="trans_threshold_judging_polarity" type="_387" offset="7232" context="_183" access="public" location="f3:354" file="f3" line="354"/>
  <Field id="_617" name="ori_threshold_judging_polarity" type="_387" offset="7264" context="_183" access="public" location="f3:355" file="f3" line="355"/>
  <Field id="_618" name="trans_threshold_f_judging_polarity" type="_387" offset="7296" context="_183" access="public" location="f3:356" file="f3" line="356"/>
  <Field id="_619" name="ori_threshold_f_judging_polarity" type="_387" offset="7328" context="_183" access="public" location="f3:357" file="f3" line="357"/>
  <Field id="_620" name="handle_judging_polarity" type="_387" offset="7360" context="_183" access="public" location="f3:358" file="f3" line="358"/>
  <Field id="_621" name="handle_judging_outcome" type="_387" offset="7392" context="_183" access="public" location="f3:359" file="f3" line="359"/>
  <Field id="_622" name="timeout" type="_385" offset="7424" context="_183" access="public" location="f3:360" file="f3" line="360"/>
  <Field id="_623" name="tags" type="_979" offset="7488" context="_183" access="public" location="f3:361" file="f3" line="361"/>
  <Field id="_624" name="fdbk_display_color" type="_979" offset="8000" context="_183" access="public" location="f3:362" file="f3" line="362"/>
  <Field id="_625" name="background_color" type="_979" offset="8512" context="_183" access="public" location="f3:363" file="f3" line="363"/>
  <Destructor id="_626" name="._35" artificial="1" throw="" context="_183" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGD1Ev *INTERNAL* " demangled="MDF_TASK_STATE_CONFIG::~MDF_TASK_STATE_CONFIG()" location="f3:364" file="f3" line="364" endline="364" inline="1">
  </Destructor>
  <OperatorMethod id="_627" name="=" returns="_1045" artificial="1" throw="" context="_183" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGaSERKS_" demangled="MDF_TASK_STATE_CONFIG::operator=(MDF_TASK_STATE_CONFIG const&amp;)" location="f3:364" file="f3" line="364" endline="364" inline="1">
    <Argument type="_1046" location="f3:329" file="f3" line="329"/>
  </OperatorMethod>
  <Constructor id="_628" name="._35" artificial="1" throw="" context="_183" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_TASK_STATE_CONFIG::MDF_TASK_STATE_CONFIG(MDF_TASK_STATE_CONFIG const&amp;)" location="f3:364" file="f3" line="364" endline="364" inline="1">
    <Argument type="_1046" location="f3:329" file="f3" line="329"/>
  </Constructor>
  <Constructor id="_629" name="._35" artificial="1" throw="" context="_183" access="public" mangled="_ZN21MDF_TASK_STATE_CONFIGC1Ev *INTERNAL* " demangled="MDF_TASK_STATE_CONFIG::MDF_TASK_STATE_CONFIG()" location="f3:364" file="f3" line="364" inline="1"/>
  <Field id="_630" name="sample_header" type="_134" offset="0" context="_185" access="public" location="f3:511" file="f3" line="511"/>
  <Field id="_631" name="rdt_sequence" type="_496" offset="128" context="_185" access="public" location="f3:512" file="f3" line="512"/>
  <Field id="_632" name="ft_sequence" type="_496" offset="160" context="_185" access="public" location="f3:513" file="f3" line="513"/>
  <Field id="_633" name="status" type="_496" offset="192" context="_185" access="public" location="f3:514" file="f3" line="514"/>
  <Field id="_634" name="reserved" type="_496" offset="224" context="_185" access="public" location="f3:515" file="f3" line="515"/>
  <Field id="_635" name="data" type="_1039" offset="256" context="_185" access="public" location="f3:516" file="f3" line="516"/>
  <Destructor id="_636" name="._59" artificial="1" throw="" context="_185" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAD1Ev *INTERNAL* " demangled="MDF_RAW_FORCE_SENSOR_DATA::~MDF_RAW_FORCE_SENSOR_DATA()" location="f3:517" file="f3" line="517" endline="517" inline="1">
  </Destructor>
  <OperatorMethod id="_637" name="=" returns="_1047" artificial="1" throw="" context="_185" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAaSERKS_" demangled="MDF_RAW_FORCE_SENSOR_DATA::operator=(MDF_RAW_FORCE_SENSOR_DATA const&amp;)" location="f3:517" file="f3" line="517" endline="517" inline="1">
    <Argument type="_1048" location="f3:510" file="f3" line="510"/>
  </OperatorMethod>
  <Constructor id="_638" name="._59" artificial="1" throw="" context="_185" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAC1ERKS_ *INTERNAL* " demangled="MDF_RAW_FORCE_SENSOR_DATA::MDF_RAW_FORCE_SENSOR_DATA(MDF_RAW_FORCE_SENSOR_DATA const&amp;)" location="f3:517" file="f3" line="517" endline="517" inline="1">
    <Argument type="_1048" location="f3:510" file="f3" line="510"/>
  </Constructor>
  <Constructor id="_639" name="._59" artificial="1" throw="" context="_185" access="public" mangled="_ZN25MDF_RAW_FORCE_SENSOR_DATAC1Ev *INTERNAL* " demangled="MDF_RAW_FORCE_SENSOR_DATA::MDF_RAW_FORCE_SENSOR_DATA()" location="f3:517" file="f3" line="517" inline="1"/>
  <Field id="_640" name="DOFCommand" type="_977" offset="0" context="_186" access="public" location="f2:139" file="f2" line="139"/>
  <Field id="_641" name="JposCommand" type="_1049" offset="1152" context="_186" access="public" location="f2:140" file="f2" line="140"/>
  <Field id="_642" name="controllerId" type="_387" offset="1600" context="_186" access="public" location="f2:141" file="f2" line="141"/>
  <Field id="_643" name="j0nks" type="_387" offset="1632" context="_186" access="public" location="f2:142" file="f2" line="142"/>
  <Destructor id="_644" name="._11" artificial="1" throw="" context="_186" access="public" mangled="_ZN16OVERRIDE_COMMANDD1Ev *INTERNAL* " demangled="OVERRIDE_COMMAND::~OVERRIDE_COMMAND()" location="f2:143" file="f2" line="143" endline="143" inline="1">
  </Destructor>
  <OperatorMethod id="_645" name="=" returns="_1050" artificial="1" throw="" context="_186" access="public" mangled="_ZN16OVERRIDE_COMMANDaSERKS_" demangled="OVERRIDE_COMMAND::operator=(OVERRIDE_COMMAND const&amp;)" location="f2:143" file="f2" line="143" endline="143" inline="1">
    <Argument type="_1051" location="f2:138" file="f2" line="138"/>
  </OperatorMethod>
  <Constructor id="_646" name="._11" artificial="1" throw="" context="_186" access="public" mangled="_ZN16OVERRIDE_COMMANDC1ERKS_ *INTERNAL* " demangled="OVERRIDE_COMMAND::OVERRIDE_COMMAND(OVERRIDE_COMMAND const&amp;)" location="f2:143" file="f2" line="143" endline="143" inline="1">
    <Argument type="_1051" location="f2:138" file="f2" line="138"/>
  </Constructor>
  <Constructor id="_647" name="._11" artificial="1" throw="" context="_186" access="public" mangled="_ZN16OVERRIDE_COMMANDC1Ev *INTERNAL* " demangled="OVERRIDE_COMMAND::OVERRIDE_COMMAND()" location="f2:143" file="f2" line="143" inline="1"/>
  <Field id="_648" name="sample_header" type="_134" offset="0" context="_188" access="public" location="f3:116" file="f3" line="116"/>
  <Field id="_649" name="tool_pos" type="_1049" offset="128" context="_188" access="public" location="f3:117" file="f3" line="117"/>
  <Field id="_650" name="wrist_pos" type="_1049" offset="576" context="_188" access="public" location="f3:118" file="f3" line="118"/>
  <Destructor id="_651" name="._17" artificial="1" throw="" context="_188" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_PROBOT_FEEDBACK::~MDF_PROBOT_FEEDBACK()" location="f3:119" file="f3" line="119" endline="119" inline="1">
  </Destructor>
  <OperatorMethod id="_652" name="=" returns="_1052" artificial="1" throw="" context="_188" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKaSERKS_" demangled="MDF_PROBOT_FEEDBACK::operator=(MDF_PROBOT_FEEDBACK const&amp;)" location="f3:119" file="f3" line="119" endline="119" inline="1">
    <Argument type="_1053" location="f3:115" file="f3" line="115"/>
  </OperatorMethod>
  <Constructor id="_653" name="._17" artificial="1" throw="" context="_188" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_PROBOT_FEEDBACK::MDF_PROBOT_FEEDBACK(MDF_PROBOT_FEEDBACK const&amp;)" location="f3:119" file="f3" line="119" endline="119" inline="1">
    <Argument type="_1053" location="f3:115" file="f3" line="115"/>
  </Constructor>
  <Constructor id="_654" name="._17" artificial="1" throw="" context="_188" access="public" mangled="_ZN19MDF_PROBOT_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_PROBOT_FEEDBACK::MDF_PROBOT_FEEDBACK()" location="f3:119" file="f3" line="119" inline="1"/>
  <Field id="_655" name="command" type="_977" offset="0" context="_192" access="public" location="f3:214" file="f3" line="214"/>
  <Field id="_656" name="mode" type="_387" offset="1152" context="_192" access="public" location="f3:215" file="f3" line="215"/>
  <Field id="_657" name="reserved" type="_387" offset="1184" context="_192" access="public" location="f3:216" file="f3" line="216"/>
  <Destructor id="_658" name="._19" artificial="1" throw="" context="_192" access="public" mangled="_ZN17MDF_GROBOT_BYPASSD1Ev *INTERNAL* " demangled="MDF_GROBOT_BYPASS::~MDF_GROBOT_BYPASS()" location="f3:217" file="f3" line="217" endline="217" inline="1">
  </Destructor>
  <OperatorMethod id="_659" name="=" returns="_1054" artificial="1" throw="" context="_192" access="public" mangled="_ZN17MDF_GROBOT_BYPASSaSERKS_" demangled="MDF_GROBOT_BYPASS::operator=(MDF_GROBOT_BYPASS const&amp;)" location="f3:217" file="f3" line="217" endline="217" inline="1">
    <Argument type="_1055" location="f3:213" file="f3" line="213"/>
  </OperatorMethod>
  <Constructor id="_660" name="._19" artificial="1" throw="" context="_192" access="public" mangled="_ZN17MDF_GROBOT_BYPASSC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_BYPASS::MDF_GROBOT_BYPASS(MDF_GROBOT_BYPASS const&amp;)" location="f3:217" file="f3" line="217" endline="217" inline="1">
    <Argument type="_1055" location="f3:213" file="f3" line="213"/>
  </Constructor>
  <Constructor id="_661" name="._19" artificial="1" throw="" context="_192" access="public" mangled="_ZN17MDF_GROBOT_BYPASSC1Ev *INTERNAL* " demangled="MDF_GROBOT_BYPASS::MDF_GROBOT_BYPASS()" location="f3:217" file="f3" line="217" inline="1"/>
  <Field id="_662" name="sample_header" type="_134" offset="0" context="_198" access="public" location="f3:285" file="f3" line="285"/>
  <Field id="_663" name="position" type="_977" offset="128" context="_198" access="public" location="f3:286" file="f3" line="286"/>
  <Field id="_664" name="velocity" type="_977" offset="1280" context="_198" access="public" location="f3:287" file="f3" line="287"/>
  <Field id="_665" name="force" type="_977" offset="2432" context="_198" access="public" location="f3:288" file="f3" line="288"/>
  <Field id="_666" name="cori_matrix" type="_984" offset="3584" context="_198" access="public" location="f3:289" file="f3" line="289"/>
  <Destructor id="_667" name="._28" artificial="1" throw="" context="_198" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_GROBOT_FEEDBACK::~MDF_GROBOT_FEEDBACK()" location="f3:290" file="f3" line="290" endline="290" inline="1">
  </Destructor>
  <OperatorMethod id="_668" name="=" returns="_1056" artificial="1" throw="" context="_198" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKaSERKS_" demangled="MDF_GROBOT_FEEDBACK::operator=(MDF_GROBOT_FEEDBACK const&amp;)" location="f3:290" file="f3" line="290" endline="290" inline="1">
    <Argument type="_1057" location="f3:284" file="f3" line="284"/>
  </OperatorMethod>
  <Constructor id="_669" name="._28" artificial="1" throw="" context="_198" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_FEEDBACK::MDF_GROBOT_FEEDBACK(MDF_GROBOT_FEEDBACK const&amp;)" location="f3:290" file="f3" line="290" endline="290" inline="1">
    <Argument type="_1057" location="f3:284" file="f3" line="284"/>
  </Constructor>
  <Constructor id="_670" name="._28" artificial="1" throw="" context="_198" access="public" mangled="_ZN19MDF_GROBOT_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_GROBOT_FEEDBACK::MDF_GROBOT_FEEDBACK()" location="f3:290" file="f3" line="290" inline="1"/>
  <Field id="_671" name="channelNum" type="_496" offset="0" context="_199" access="public" location="f3:535" file="f3" line="535"/>
  <Field id="_672" name="reserved" type="_496" offset="32" context="_199" access="public" location="f3:536" file="f3" line="536"/>
  <Field id="_673" name="name" type="_979" offset="64" context="_199" access="public" location="f3:537" file="f3" line="537"/>
  <Destructor id="_674" name="._62" artificial="1" throw="" context="_199" access="public" mangled="_ZN10MDF_MUSCLED1Ev *INTERNAL* " demangled="MDF_MUSCLE::~MDF_MUSCLE()" location="f3:538" file="f3" line="538" endline="538" inline="1">
  </Destructor>
  <OperatorMethod id="_675" name="=" returns="_1058" artificial="1" throw="" context="_199" access="public" mangled="_ZN10MDF_MUSCLEaSERKS_" demangled="MDF_MUSCLE::operator=(MDF_MUSCLE const&amp;)" location="f3:538" file="f3" line="538" endline="538" inline="1">
    <Argument type="_1059" location="f3:534" file="f3" line="534"/>
  </OperatorMethod>
  <Constructor id="_676" name="._62" artificial="1" throw="" context="_199" access="public" mangled="_ZN10MDF_MUSCLEC1ERKS_ *INTERNAL* " demangled="MDF_MUSCLE::MDF_MUSCLE(MDF_MUSCLE const&amp;)" location="f3:538" file="f3" line="538" endline="538" inline="1">
    <Argument type="_1059" location="f3:534" file="f3" line="534"/>
  </Constructor>
  <Constructor id="_677" name="._62" artificial="1" throw="" context="_199" access="public" mangled="_ZN10MDF_MUSCLEC1Ev *INTERNAL* " demangled="MDF_MUSCLE::MDF_MUSCLE()" location="f3:538" file="f3" line="538" inline="1"/>
  <Field id="_678" name="sample_header" type="_134" offset="0" context="_203" access="public" location="f3:491" file="f3" line="491"/>
  <Field id="_679" name="pos" type="_1060" offset="128" context="_203" access="public" location="f3:492" file="f3" line="492"/>
  <Field id="_680" name="controlledDims" type="_1061" offset="640" context="_203" access="public" location="f3:493" file="f3" line="493"/>
  <Field id="_681" name="overrideDims" type="_1061" offset="896" context="_203" access="public" location="f3:494" file="f3" line="494"/>
  <Destructor id="_682" name="._56" artificial="1" throw="" context="_203" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDD1Ev *INTERNAL* " demangled="MDF_ROBOT_JOINT_COMMAND::~MDF_ROBOT_JOINT_COMMAND()" location="f3:495" file="f3" line="495" endline="495" inline="1">
  </Destructor>
  <OperatorMethod id="_683" name="=" returns="_1062" artificial="1" throw="" context="_203" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDaSERKS_" demangled="MDF_ROBOT_JOINT_COMMAND::operator=(MDF_ROBOT_JOINT_COMMAND const&amp;)" location="f3:495" file="f3" line="495" endline="495" inline="1">
    <Argument type="_1063" location="f3:490" file="f3" line="490"/>
  </OperatorMethod>
  <Constructor id="_684" name="._56" artificial="1" throw="" context="_203" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDC1ERKS_ *INTERNAL* " demangled="MDF_ROBOT_JOINT_COMMAND::MDF_ROBOT_JOINT_COMMAND(MDF_ROBOT_JOINT_COMMAND const&amp;)" location="f3:495" file="f3" line="495" endline="495" inline="1">
    <Argument type="_1063" location="f3:490" file="f3" line="490"/>
  </Constructor>
  <Constructor id="_685" name="._56" artificial="1" throw="" context="_203" access="public" mangled="_ZN23MDF_ROBOT_JOINT_COMMANDC1Ev *INTERNAL* " demangled="MDF_ROBOT_JOINT_COMMAND::MDF_ROBOT_JOINT_COMMAND()" location="f3:495" file="f3" line="495" inline="1"/>
  <Field id="_686" name="next_tool_id" type="_387" offset="0" context="_206" access="public" location="f3:316" file="f3" line="316"/>
  <Field id="_687" name="reserved" type="_387" offset="32" context="_206" access="public" location="f3:317" file="f3" line="317"/>
  <Destructor id="_688" name="._33" artificial="1" throw="" context="_206" access="public" mangled="_ZN15MDF_CHANGE_TOOLD1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL::~MDF_CHANGE_TOOL()" location="f3:318" file="f3" line="318" endline="318" inline="1">
  </Destructor>
  <OperatorMethod id="_689" name="=" returns="_1064" artificial="1" throw="" context="_206" access="public" mangled="_ZN15MDF_CHANGE_TOOLaSERKS_" demangled="MDF_CHANGE_TOOL::operator=(MDF_CHANGE_TOOL const&amp;)" location="f3:318" file="f3" line="318" endline="318" inline="1">
    <Argument type="_1065" location="f3:315" file="f3" line="315"/>
  </OperatorMethod>
  <Constructor id="_690" name="._33" artificial="1" throw="" context="_206" access="public" mangled="_ZN15MDF_CHANGE_TOOLC1ERKS_ *INTERNAL* " demangled="MDF_CHANGE_TOOL::MDF_CHANGE_TOOL(MDF_CHANGE_TOOL const&amp;)" location="f3:318" file="f3" line="318" endline="318" inline="1">
    <Argument type="_1065" location="f3:315" file="f3" line="315"/>
  </Constructor>
  <Constructor id="_691" name="._33" artificial="1" throw="" context="_206" access="public" mangled="_ZN15MDF_CHANGE_TOOLC1Ev *INTERNAL* " demangled="MDF_CHANGE_TOOL::MDF_CHANGE_TOOL()" location="f3:318" file="f3" line="318" inline="1"/>
  <Field id="_692" name="sample_header" type="_134" offset="0" context="_210" access="public" location="f3:390" file="f3" line="390"/>
  <Field id="_693" name="source_timestamp" type="_385" offset="128" context="_210" access="public" location="f3:391" file="f3" line="391"/>
  <Field id="_694" name="count_interval" type="_385" offset="192" context="_210" access="public" location="f3:392" file="f3" line="392"/>
  <Field id="_695" name="rates" type="_1066" offset="256" context="_210" access="public" location="f3:393" file="f3" line="393"/>
  <Destructor id="_696" name="._40" artificial="1" throw="" context="_210" access="public" mangled="_ZN18MDF_SPM_FIRINGRATED1Ev *INTERNAL* " demangled="MDF_SPM_FIRINGRATE::~MDF_SPM_FIRINGRATE()" location="f3:394" file="f3" line="394" endline="394" inline="1">
  </Destructor>
  <OperatorMethod id="_697" name="=" returns="_1067" artificial="1" throw="" context="_210" access="public" mangled="_ZN18MDF_SPM_FIRINGRATEaSERKS_" demangled="MDF_SPM_FIRINGRATE::operator=(MDF_SPM_FIRINGRATE const&amp;)" location="f3:394" file="f3" line="394" endline="394" inline="1">
    <Argument type="_1068" location="f3:389" file="f3" line="389"/>
  </OperatorMethod>
  <Constructor id="_698" name="._40" artificial="1" throw="" context="_210" access="public" mangled="_ZN18MDF_SPM_FIRINGRATEC1ERKS_ *INTERNAL* " demangled="MDF_SPM_FIRINGRATE::MDF_SPM_FIRINGRATE(MDF_SPM_FIRINGRATE const&amp;)" location="f3:394" file="f3" line="394" endline="394" inline="1">
    <Argument type="_1068" location="f3:389" file="f3" line="389"/>
  </Constructor>
  <Constructor id="_699" name="._40" artificial="1" throw="" context="_210" access="public" mangled="_ZN18MDF_SPM_FIRINGRATEC1Ev *INTERNAL* " demangled="MDF_SPM_FIRINGRATE::MDF_SPM_FIRINGRATE()" location="f3:394" file="f3" line="394" inline="1"/>
  <Field id="_700" name="distanceFromCenter" type="_385" offset="0" context="_212" access="public" location="f3:580" file="f3" line="580"/>
  <Destructor id="_701" name="._69" artificial="1" throw="" context="_212" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_RT_POSITION_FEEDBACK::~MDF_RT_POSITION_FEEDBACK()" location="f3:581" file="f3" line="581" endline="581" inline="1">
  </Destructor>
  <OperatorMethod id="_702" name="=" returns="_1069" artificial="1" throw="" context="_212" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKaSERKS_" demangled="MDF_RT_POSITION_FEEDBACK::operator=(MDF_RT_POSITION_FEEDBACK const&amp;)" location="f3:581" file="f3" line="581" endline="581" inline="1">
    <Argument type="_1070" location="f3:579" file="f3" line="579"/>
  </OperatorMethod>
  <Constructor id="_703" name="._69" artificial="1" throw="" context="_212" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_RT_POSITION_FEEDBACK::MDF_RT_POSITION_FEEDBACK(MDF_RT_POSITION_FEEDBACK const&amp;)" location="f3:581" file="f3" line="581" endline="581" inline="1">
    <Argument type="_1070" location="f3:579" file="f3" line="579"/>
  </Constructor>
  <Constructor id="_704" name="._69" artificial="1" throw="" context="_212" access="public" mangled="_ZN24MDF_RT_POSITION_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_RT_POSITION_FEEDBACK::MDF_RT_POSITION_FEEDBACK()" location="f3:581" file="f3" line="581" inline="1"/>
  <Field id="_705" name="source_index" type="_387" offset="0" context="_220" access="public" location="f3:379" file="f3" line="379"/>
  <Field id="_706" name="reserved" type="_387" offset="32" context="_220" access="public" location="f3:380" file="f3" line="380"/>
  <Field id="_707" name="source_timestamp" type="_385" offset="64" context="_220" access="public" location="f3:381" file="f3" line="381"/>
  <Destructor id="_708" name="._38" artificial="1" throw="" context="_220" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSED1Ev *INTERNAL* " demangled="MDF_RAW_SAMPLE_RESPONSE::~MDF_RAW_SAMPLE_RESPONSE()" location="f3:382" file="f3" line="382" endline="382" inline="1">
  </Destructor>
  <OperatorMethod id="_709" name="=" returns="_1071" artificial="1" throw="" context="_220" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSEaSERKS_" demangled="MDF_RAW_SAMPLE_RESPONSE::operator=(MDF_RAW_SAMPLE_RESPONSE const&amp;)" location="f3:382" file="f3" line="382" endline="382" inline="1">
    <Argument type="_1072" location="f3:378" file="f3" line="378"/>
  </OperatorMethod>
  <Constructor id="_710" name="._38" artificial="1" throw="" context="_220" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSEC1ERKS_ *INTERNAL* " demangled="MDF_RAW_SAMPLE_RESPONSE::MDF_RAW_SAMPLE_RESPONSE(MDF_RAW_SAMPLE_RESPONSE const&amp;)" location="f3:382" file="f3" line="382" endline="382" inline="1">
    <Argument type="_1072" location="f3:378" file="f3" line="378"/>
  </Constructor>
  <Constructor id="_711" name="._38" artificial="1" throw="" context="_220" access="public" mangled="_ZN23MDF_RAW_SAMPLE_RESPONSEC1Ev *INTERNAL* " demangled="MDF_RAW_SAMPLE_RESPONSE::MDF_RAW_SAMPLE_RESPONSE()" location="f3:382" file="f3" line="382" inline="1"/>
  <Field id="_712" name="sample_header" type="_134" offset="0" context="_223" access="public" location="f3:207" file="f3" line="207"/>
  <Field id="_713" name="command" type="_977" offset="128" context="_223" access="public" location="f3:208" file="f3" line="208"/>
  <Field id="_714" name="mode" type="_387" offset="1280" context="_223" access="public" location="f3:209" file="f3" line="209"/>
  <Field id="_715" name="reserved" type="_387" offset="1312" context="_223" access="public" location="f3:210" file="f3" line="210"/>
  <Destructor id="_716" name="._18" artificial="1" throw="" context="_223" access="public" mangled="_ZN18MDF_GROBOT_COMMANDD1Ev *INTERNAL* " demangled="MDF_GROBOT_COMMAND::~MDF_GROBOT_COMMAND()" location="f3:211" file="f3" line="211" endline="211" inline="1">
  </Destructor>
  <OperatorMethod id="_717" name="=" returns="_1073" artificial="1" throw="" context="_223" access="public" mangled="_ZN18MDF_GROBOT_COMMANDaSERKS_" demangled="MDF_GROBOT_COMMAND::operator=(MDF_GROBOT_COMMAND const&amp;)" location="f3:211" file="f3" line="211" endline="211" inline="1">
    <Argument type="_1074" location="f3:206" file="f3" line="206"/>
  </OperatorMethod>
  <Constructor id="_718" name="._18" artificial="1" throw="" context="_223" access="public" mangled="_ZN18MDF_GROBOT_COMMANDC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_COMMAND::MDF_GROBOT_COMMAND(MDF_GROBOT_COMMAND const&amp;)" location="f3:211" file="f3" line="211" endline="211" inline="1">
    <Argument type="_1074" location="f3:206" file="f3" line="206"/>
  </Constructor>
  <Constructor id="_719" name="._18" artificial="1" throw="" context="_223" access="public" mangled="_ZN18MDF_GROBOT_COMMANDC1Ev *INTERNAL* " demangled="MDF_GROBOT_COMMAND::MDF_GROBOT_COMMAND()" location="f3:211" file="f3" line="211" inline="1"/>
  <Field id="_720" name="virtualPadPosition" type="_977" offset="0" context="_226" access="public" location="f2:75" file="f2" line="75"/>
  <Field id="_721" name="centralPointPosition" type="_1075" offset="1152" context="_226" access="public" location="f2:76" file="f2" line="76"/>
  <Field id="_722" name="posMin" type="_977" offset="1344" context="_226" access="public" location="f2:77" file="f2" line="77"/>
  <Field id="_723" name="posMax" type="_977" offset="2496" context="_226" access="public" location="f2:78" file="f2" line="78"/>
  <Field id="_724" name="velMin" type="_977" offset="3648" context="_226" access="public" location="f2:79" file="f2" line="79"/>
  <Field id="_725" name="velMax" type="_977" offset="4800" context="_226" access="public" location="f2:80" file="f2" line="80"/>
  <Field id="_726" name="graspingGraspApertureTarget" type="_385" offset="5952" context="_226" access="public" location="f2:81" file="f2" line="81"/>
  <Field id="_727" name="graspingOpenApertureTarget" type="_385" offset="6016" context="_226" access="public" location="f2:82" file="f2" line="82"/>
  <Field id="_728" name="graspingIntermediateApertureTarget" type="_385" offset="6080" context="_226" access="public" location="f2:83" file="f2" line="83"/>
  <Field id="_729" name="maxApproachSwingAngle" type="_385" offset="6144" context="_226" access="public" location="f2:84" file="f2" line="84"/>
  <Field id="_730" name="graspTooCloseIfClosedRadius" type="_385" offset="6208" context="_226" access="public" location="f2:85" file="f2" line="85"/>
  <Destructor id="_731" name="._5" artificial="1" throw="" context="_226" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSD1Ev *INTERNAL* " demangled="AUTOMAGIC_CONTROLLER_PARAMS::~AUTOMAGIC_CONTROLLER_PARAMS()" location="f2:86" file="f2" line="86" endline="86" inline="1">
  </Destructor>
  <OperatorMethod id="_732" name="=" returns="_1076" artificial="1" throw="" context="_226" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSaSERKS_" demangled="AUTOMAGIC_CONTROLLER_PARAMS::operator=(AUTOMAGIC_CONTROLLER_PARAMS const&amp;)" location="f2:86" file="f2" line="86" endline="86" inline="1">
    <Argument type="_1077" location="f2:74" file="f2" line="74"/>
  </OperatorMethod>
  <Constructor id="_733" name="._5" artificial="1" throw="" context="_226" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSC1ERKS_ *INTERNAL* " demangled="AUTOMAGIC_CONTROLLER_PARAMS::AUTOMAGIC_CONTROLLER_PARAMS(AUTOMAGIC_CONTROLLER_PARAMS const&amp;)" location="f2:86" file="f2" line="86" endline="86" inline="1">
    <Argument type="_1077" location="f2:74" file="f2" line="74"/>
  </Constructor>
  <Constructor id="_734" name="._5" artificial="1" throw="" context="_226" access="public" mangled="_ZN27AUTOMAGIC_CONTROLLER_PARAMSC1Ev *INTERNAL* " demangled="AUTOMAGIC_CONTROLLER_PARAMS::AUTOMAGIC_CONTROLLER_PARAMS()" location="f2:86" file="f2" line="86" inline="1"/>
  <Field id="_735" name="target" type="_977" offset="0" context="_227" access="public" location="f2:89" file="f2" line="89"/>
  <Field id="_736" name="coriMatrix" type="_984" offset="1152" context="_227" access="public" location="f2:90" file="f2" line="90"/>
  <Field id="_737" name="trialEvent" type="_91" offset="1728" context="_227" access="public" location="f2:92" file="f2" line="92"/>
  <Field id="_738" name="autoControlParams" type="_226" offset="1856" context="_227" access="public" location="f2:93" file="f2" line="93"/>
  <Field id="_739" name="autoPosControlFraction" type="_977" offset="8128" context="_227" access="public" location="f2:94" file="f2" line="94"/>
  <Field id="_740" name="autoVelControlFraction" type="_977" offset="9280" context="_227" access="public" location="f2:95" file="f2" line="95"/>
  <Field id="_741" name="orthPosImpedance" type="_977" offset="10432" context="_227" access="public" location="f2:96" file="f2" line="96"/>
  <Field id="_742" name="orthVelImpedance" type="_977" offset="11584" context="_227" access="public" location="f2:97" file="f2" line="97"/>
  <Field id="_743" name="extrinsicVelControlled" type="_978" offset="12736" context="_227" access="public" location="f2:98" file="f2" line="98"/>
  <Field id="_744" name="extrinsicPosControlled" type="_978" offset="13312" context="_227" access="public" location="f2:99" file="f2" line="99"/>
  <Field id="_745" name="importantDOF" type="_978" offset="13888" context="_227" access="public" location="f2:100" file="f2" line="100"/>
  <Destructor id="_746" name="._6" artificial="1" throw="" context="_227" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGD1Ev *INTERNAL* " demangled="ROBOT_CONTROL_CONFIG::~ROBOT_CONTROL_CONFIG()" location="f2:102" file="f2" line="102" endline="102" inline="1">
  </Destructor>
  <OperatorMethod id="_747" name="=" returns="_1078" artificial="1" throw="" context="_227" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGaSERKS_" demangled="ROBOT_CONTROL_CONFIG::operator=(ROBOT_CONTROL_CONFIG const&amp;)" location="f2:102" file="f2" line="102" endline="102" inline="1">
    <Argument type="_1079" location="f2:88" file="f2" line="88"/>
  </OperatorMethod>
  <Constructor id="_748" name="._6" artificial="1" throw="" context="_227" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGC1ERKS_ *INTERNAL* " demangled="ROBOT_CONTROL_CONFIG::ROBOT_CONTROL_CONFIG(ROBOT_CONTROL_CONFIG const&amp;)" location="f2:102" file="f2" line="102" endline="102" inline="1">
    <Argument type="_1079" location="f2:88" file="f2" line="88"/>
  </Constructor>
  <Constructor id="_749" name="._6" artificial="1" throw="" context="_227" access="public" mangled="_ZN20ROBOT_CONTROL_CONFIGC1Ev *INTERNAL* " demangled="ROBOT_CONTROL_CONFIG::ROBOT_CONTROL_CONFIG()" location="f2:102" file="f2" line="102" inline="1"/>
  <Field id="_750" name="D" type="_1080" offset="0" context="_232" access="public" location="f2:71" file="f2" line="71"/>
  <Destructor id="_751" name="._4" artificial="1" throw="" context="_232" access="public" mangled="_ZN20PLAN_PROCESSOR_STATED1Ev *INTERNAL* " demangled="PLAN_PROCESSOR_STATE::~PLAN_PROCESSOR_STATE()" location="f2:72" file="f2" line="72" endline="72" inline="1">
  </Destructor>
  <OperatorMethod id="_752" name="=" returns="_1081" artificial="1" throw="" context="_232" access="public" mangled="_ZN20PLAN_PROCESSOR_STATEaSERKS_" demangled="PLAN_PROCESSOR_STATE::operator=(PLAN_PROCESSOR_STATE const&amp;)" location="f2:72" file="f2" line="72" endline="72" inline="1">
    <Argument type="_1082" location="f2:70" file="f2" line="70"/>
  </OperatorMethod>
  <Constructor id="_753" name="._4" artificial="1" throw="" context="_232" access="public" mangled="_ZN20PLAN_PROCESSOR_STATEC1ERKS_ *INTERNAL* " demangled="PLAN_PROCESSOR_STATE::PLAN_PROCESSOR_STATE(PLAN_PROCESSOR_STATE const&amp;)" location="f2:72" file="f2" line="72" endline="72" inline="1">
    <Argument type="_1082" location="f2:70" file="f2" line="70"/>
  </Constructor>
  <Constructor id="_754" name="._4" artificial="1" throw="" context="_232" access="public" mangled="_ZN20PLAN_PROCESSOR_STATEC1Ev *INTERNAL* " demangled="PLAN_PROCESSOR_STATE::PLAN_PROCESSOR_STATE()" location="f2:72" file="f2" line="72" inline="1"/>
  <Field id="_755" name="sample_header" type="_134" offset="0" context="_233" access="public" location="f2:106" file="f2" line="106"/>
  <Field id="_756" name="RTMA_received_time" type="_385" offset="128" context="_233" access="public" location="f2:107" file="f2" line="107"/>
  <Field id="_757" name="Jpos" type="_1049" offset="192" context="_233" access="public" location="f2:108" file="f2" line="108"/>
  <Field id="_758" name="Jvel" type="_1049" offset="640" context="_233" access="public" location="f2:109" file="f2" line="109"/>
  <Field id="_759" name="Cpos" type="_1075" offset="1088" context="_233" access="public" location="f2:110" file="f2" line="110"/>
  <Field id="_760" name="Cori" type="_1075" offset="1280" context="_233" access="public" location="f2:111" file="f2" line="111"/>
  <Field id="_761" name="Cforce" type="_1075" offset="1472" context="_233" access="public" location="f2:112" file="f2" line="112"/>
  <Field id="_762" name="Ctrq" type="_1075" offset="1664" context="_233" access="public" location="f2:113" file="f2" line="113"/>
  <Field id="_763" name="Cvel" type="_1075" offset="1856" context="_233" access="public" location="f2:114" file="f2" line="114"/>
  <Field id="_764" name="CangVel" type="_1075" offset="2048" context="_233" access="public" location="f2:115" file="f2" line="115"/>
  <Field id="_765" name="Hpos" type="_1083" offset="2240" context="_233" access="public" location="f2:116" file="f2" line="116"/>
  <Field id="_766" name="Hstrain" type="_1083" offset="2496" context="_233" access="public" location="f2:117" file="f2" line="117"/>
  <Field id="_767" name="Jtrq" type="_1075" offset="2752" context="_233" access="public" location="f2:118" file="f2" line="118"/>
  <Destructor id="_768" name="._7" artificial="1" throw="" context="_233" access="public" mangled="_ZN18ROBOT_ACTUAL_STATED1Ev *INTERNAL* " demangled="ROBOT_ACTUAL_STATE::~ROBOT_ACTUAL_STATE()" location="f2:119" file="f2" line="119" endline="119" inline="1">
  </Destructor>
  <OperatorMethod id="_769" name="=" returns="_1084" artificial="1" throw="" context="_233" access="public" mangled="_ZN18ROBOT_ACTUAL_STATEaSERKS_" demangled="ROBOT_ACTUAL_STATE::operator=(ROBOT_ACTUAL_STATE const&amp;)" location="f2:119" file="f2" line="119" endline="119" inline="1">
    <Argument type="_1085" location="f2:105" file="f2" line="105"/>
  </OperatorMethod>
  <Constructor id="_770" name="._7" artificial="1" throw="" context="_233" access="public" mangled="_ZN18ROBOT_ACTUAL_STATEC1ERKS_ *INTERNAL* " demangled="ROBOT_ACTUAL_STATE::ROBOT_ACTUAL_STATE(ROBOT_ACTUAL_STATE const&amp;)" location="f2:119" file="f2" line="119" endline="119" inline="1">
    <Argument type="_1085" location="f2:105" file="f2" line="105"/>
  </Constructor>
  <Constructor id="_771" name="._7" artificial="1" throw="" context="_233" access="public" mangled="_ZN18ROBOT_ACTUAL_STATEC1Ev *INTERNAL* " demangled="ROBOT_ACTUAL_STATE::ROBOT_ACTUAL_STATE()" location="f2:119" file="f2" line="119" inline="1"/>
  <Field id="_772" name="sample_header" type="_134" offset="0" context="_234" access="public" location="f2:130" file="f2" line="130"/>
  <Field id="_773" name="targetPos" type="_977" offset="128" context="_234" access="public" location="f2:131" file="f2" line="131"/>
  <Destructor id="_774" name="._9" artificial="1" throw="" context="_234" access="public" mangled="_ZN13PLANNER_STATED1Ev *INTERNAL* " demangled="PLANNER_STATE::~PLANNER_STATE()" location="f2:132" file="f2" line="132" endline="132" inline="1">
  </Destructor>
  <OperatorMethod id="_775" name="=" returns="_1086" artificial="1" throw="" context="_234" access="public" mangled="_ZN13PLANNER_STATEaSERKS_" demangled="PLANNER_STATE::operator=(PLANNER_STATE const&amp;)" location="f2:132" file="f2" line="132" endline="132" inline="1">
    <Argument type="_1087" location="f2:129" file="f2" line="129"/>
  </OperatorMethod>
  <Constructor id="_776" name="._9" artificial="1" throw="" context="_234" access="public" mangled="_ZN13PLANNER_STATEC1ERKS_ *INTERNAL* " demangled="PLANNER_STATE::PLANNER_STATE(PLANNER_STATE const&amp;)" location="f2:132" file="f2" line="132" endline="132" inline="1">
    <Argument type="_1087" location="f2:129" file="f2" line="129"/>
  </Constructor>
  <Constructor id="_777" name="._9" artificial="1" throw="" context="_234" access="public" mangled="_ZN13PLANNER_STATEC1Ev *INTERNAL* " demangled="PLANNER_STATE::PLANNER_STATE()" location="f2:132" file="f2" line="132" inline="1"/>
  <Field id="_778" name="sample_header" type="_134" offset="0" context="_247" access="public" location="f3:552" file="f3" line="552"/>
  <Field id="_779" name="data" type="_1060" offset="128" context="_247" access="public" location="f3:553" file="f3" line="553"/>
  <Destructor id="_780" name="._65" artificial="1" throw="" context="_247" access="public" mangled="_ZN12MDF_FSR_DATAD1Ev *INTERNAL* " demangled="MDF_FSR_DATA::~MDF_FSR_DATA()" location="f3:554" file="f3" line="554" endline="554" inline="1">
  </Destructor>
  <OperatorMethod id="_781" name="=" returns="_1088" artificial="1" throw="" context="_247" access="public" mangled="_ZN12MDF_FSR_DATAaSERKS_" demangled="MDF_FSR_DATA::operator=(MDF_FSR_DATA const&amp;)" location="f3:554" file="f3" line="554" endline="554" inline="1">
    <Argument type="_1089" location="f3:551" file="f3" line="551"/>
  </OperatorMethod>
  <Constructor id="_782" name="._65" artificial="1" throw="" context="_247" access="public" mangled="_ZN12MDF_FSR_DATAC1ERKS_ *INTERNAL* " demangled="MDF_FSR_DATA::MDF_FSR_DATA(MDF_FSR_DATA const&amp;)" location="f3:554" file="f3" line="554" endline="554" inline="1">
    <Argument type="_1089" location="f3:551" file="f3" line="551"/>
  </Constructor>
  <Constructor id="_783" name="._65" artificial="1" throw="" context="_247" access="public" mangled="_ZN12MDF_FSR_DATAC1Ev *INTERNAL* " demangled="MDF_FSR_DATA::MDF_FSR_DATA()" location="f3:554" file="f3" line="554" inline="1"/>
  <Field id="_784" name="config" type="_979" offset="0" context="_254" access="public" location="f3:423" file="f3" line="423"/>
  <Destructor id="_785" name="._46" artificial="1" throw="" context="_254" access="public" mangled="_ZN13MDF_APP_STARTD1Ev *INTERNAL* " demangled="MDF_APP_START::~MDF_APP_START()" location="f3:424" file="f3" line="424" endline="424" inline="1">
  </Destructor>
  <OperatorMethod id="_786" name="=" returns="_1090" artificial="1" throw="" context="_254" access="public" mangled="_ZN13MDF_APP_STARTaSERKS_" demangled="MDF_APP_START::operator=(MDF_APP_START const&amp;)" location="f3:424" file="f3" line="424" endline="424" inline="1">
    <Argument type="_1091" location="f3:422" file="f3" line="422"/>
  </OperatorMethod>
  <Constructor id="_787" name="._46" artificial="1" throw="" context="_254" access="public" mangled="_ZN13MDF_APP_STARTC1ERKS_ *INTERNAL* " demangled="MDF_APP_START::MDF_APP_START(MDF_APP_START const&amp;)" location="f3:424" file="f3" line="424" endline="424" inline="1">
    <Argument type="_1091" location="f3:422" file="f3" line="422"/>
  </Constructor>
  <Constructor id="_788" name="._46" artificial="1" throw="" context="_254" access="public" mangled="_ZN13MDF_APP_STARTC1Ev *INTERNAL* " demangled="MDF_APP_START::MDF_APP_START()" location="f3:424" file="f3" line="424" inline="1"/>
  <Field id="_789" name="sample_header" type="_134" offset="0" context="_258" access="public" location="f3:453" file="f3" line="453"/>
  <Field id="_790" name="drift_correction" type="_977" offset="128" context="_258" access="public" location="f3:454" file="f3" line="454"/>
  <Destructor id="_791" name="._51" artificial="1" throw="" context="_258" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIOND1Ev *INTERNAL* " demangled="MDF_EM_DRIFT_CORRECTION::~MDF_EM_DRIFT_CORRECTION()" location="f3:455" file="f3" line="455" endline="455" inline="1">
  </Destructor>
  <OperatorMethod id="_792" name="=" returns="_1092" artificial="1" throw="" context="_258" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIONaSERKS_" demangled="MDF_EM_DRIFT_CORRECTION::operator=(MDF_EM_DRIFT_CORRECTION const&amp;)" location="f3:455" file="f3" line="455" endline="455" inline="1">
    <Argument type="_1093" location="f3:452" file="f3" line="452"/>
  </OperatorMethod>
  <Constructor id="_793" name="._51" artificial="1" throw="" context="_258" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIONC1ERKS_ *INTERNAL* " demangled="MDF_EM_DRIFT_CORRECTION::MDF_EM_DRIFT_CORRECTION(MDF_EM_DRIFT_CORRECTION const&amp;)" location="f3:455" file="f3" line="455" endline="455" inline="1">
    <Argument type="_1093" location="f3:452" file="f3" line="452"/>
  </Constructor>
  <Constructor id="_794" name="._51" artificial="1" throw="" context="_258" access="public" mangled="_ZN23MDF_EM_DRIFT_CORRECTIONC1Ev *INTERNAL* " demangled="MDF_EM_DRIFT_CORRECTION::MDF_EM_DRIFT_CORRECTION()" location="f3:455" file="f3" line="455" inline="1"/>
  <Field id="_795" name="Cmd" type="_1083" offset="0" context="_259" access="public" location="f3:224" file="f3" line="224"/>
  <Destructor id="_796" name="._21" artificial="1" throw="" context="_259" access="public" mangled="_ZN16MDF_OPTO_POS_CMDD1Ev *INTERNAL* " demangled="MDF_OPTO_POS_CMD::~MDF_OPTO_POS_CMD()" location="f3:225" file="f3" line="225" endline="225" inline="1">
  </Destructor>
  <OperatorMethod id="_797" name="=" returns="_1094" artificial="1" throw="" context="_259" access="public" mangled="_ZN16MDF_OPTO_POS_CMDaSERKS_" demangled="MDF_OPTO_POS_CMD::operator=(MDF_OPTO_POS_CMD const&amp;)" location="f3:225" file="f3" line="225" endline="225" inline="1">
    <Argument type="_1095" location="f3:223" file="f3" line="223"/>
  </OperatorMethod>
  <Constructor id="_798" name="._21" artificial="1" throw="" context="_259" access="public" mangled="_ZN16MDF_OPTO_POS_CMDC1ERKS_ *INTERNAL* " demangled="MDF_OPTO_POS_CMD::MDF_OPTO_POS_CMD(MDF_OPTO_POS_CMD const&amp;)" location="f3:225" file="f3" line="225" endline="225" inline="1">
    <Argument type="_1095" location="f3:223" file="f3" line="223"/>
  </Constructor>
  <Constructor id="_799" name="._21" artificial="1" throw="" context="_259" access="public" mangled="_ZN16MDF_OPTO_POS_CMDC1Ev *INTERNAL* " demangled="MDF_OPTO_POS_CMD::MDF_OPTO_POS_CMD()" location="f3:225" file="f3" line="225" inline="1"/>
  <Field id="_800" name="sample_header" type="_134" offset="0" context="_272" access="public" location="f3:305" file="f3" line="305"/>
  <Field id="_801" name="data" type="_1096" offset="128" context="_272" access="public" location="f3:306" file="f3" line="306"/>
  <Destructor id="_802" name="._31" artificial="1" throw="" context="_272" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAD1Ev *INTERNAL* " demangled="MDF_MICROSTRAIN_DATA::~MDF_MICROSTRAIN_DATA()" location="f3:307" file="f3" line="307" endline="307" inline="1">
  </Destructor>
  <OperatorMethod id="_803" name="=" returns="_1097" artificial="1" throw="" context="_272" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAaSERKS_" demangled="MDF_MICROSTRAIN_DATA::operator=(MDF_MICROSTRAIN_DATA const&amp;)" location="f3:307" file="f3" line="307" endline="307" inline="1">
    <Argument type="_1098" location="f3:304" file="f3" line="304"/>
  </OperatorMethod>
  <Constructor id="_804" name="._31" artificial="1" throw="" context="_272" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAC1ERKS_ *INTERNAL* " demangled="MDF_MICROSTRAIN_DATA::MDF_MICROSTRAIN_DATA(MDF_MICROSTRAIN_DATA const&amp;)" location="f3:307" file="f3" line="307" endline="307" inline="1">
    <Argument type="_1098" location="f3:304" file="f3" line="304"/>
  </Constructor>
  <Constructor id="_805" name="._31" artificial="1" throw="" context="_272" access="public" mangled="_ZN20MDF_MICROSTRAIN_DATAC1Ev *INTERNAL* " demangled="MDF_MICROSTRAIN_DATA::MDF_MICROSTRAIN_DATA()" location="f3:307" file="f3" line="307" inline="1"/>
  <Field id="_806" name="target" type="_977" offset="0" context="_274" access="public" location="f3:486" file="f3" line="486"/>
  <Field id="_807" name="coriMatrix" type="_984" offset="1152" context="_274" access="public" location="f3:487" file="f3" line="487"/>
  <Destructor id="_808" name="._55" artificial="1" throw="" context="_274" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGD1Ev *INTERNAL* " demangled="MDF_PLANNER_CONTROL_CONFIG::~MDF_PLANNER_CONTROL_CONFIG()" location="f3:488" file="f3" line="488" endline="488" inline="1">
  </Destructor>
  <OperatorMethod id="_809" name="=" returns="_1099" artificial="1" throw="" context="_274" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGaSERKS_" demangled="MDF_PLANNER_CONTROL_CONFIG::operator=(MDF_PLANNER_CONTROL_CONFIG const&amp;)" location="f3:488" file="f3" line="488" endline="488" inline="1">
    <Argument type="_1100" location="f3:485" file="f3" line="485"/>
  </OperatorMethod>
  <Constructor id="_810" name="._55" artificial="1" throw="" context="_274" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_PLANNER_CONTROL_CONFIG::MDF_PLANNER_CONTROL_CONFIG(MDF_PLANNER_CONTROL_CONFIG const&amp;)" location="f3:488" file="f3" line="488" endline="488" inline="1">
    <Argument type="_1100" location="f3:485" file="f3" line="485"/>
  </Constructor>
  <Constructor id="_811" name="._55" artificial="1" throw="" context="_274" access="public" mangled="_ZN26MDF_PLANNER_CONTROL_CONFIGC1Ev *INTERNAL* " demangled="MDF_PLANNER_CONTROL_CONFIG::MDF_PLANNER_CONTROL_CONFIG()" location="f3:488" file="f3" line="488" inline="1"/>
  <Field id="_812" name="id" type="_387" offset="0" context="_275" access="public" location="f3:367" file="f3" line="367"/>
  <Field id="_813" name="reserved" type="_387" offset="32" context="_275" access="public" location="f3:368" file="f3" line="368"/>
  <Field id="_814" name="reason" type="_979" offset="64" context="_275" access="public" location="f3:369" file="f3" line="369"/>
  <Destructor id="_815" name="._36" artificial="1" throw="" context="_275" access="public" mangled="_ZN17MDF_JUDGE_VERDICTD1Ev *INTERNAL* " demangled="MDF_JUDGE_VERDICT::~MDF_JUDGE_VERDICT()" location="f3:370" file="f3" line="370" endline="370" inline="1">
  </Destructor>
  <OperatorMethod id="_816" name="=" returns="_1101" artificial="1" throw="" context="_275" access="public" mangled="_ZN17MDF_JUDGE_VERDICTaSERKS_" demangled="MDF_JUDGE_VERDICT::operator=(MDF_JUDGE_VERDICT const&amp;)" location="f3:370" file="f3" line="370" endline="370" inline="1">
    <Argument type="_1102" location="f3:366" file="f3" line="366"/>
  </OperatorMethod>
  <Constructor id="_817" name="._36" artificial="1" throw="" context="_275" access="public" mangled="_ZN17MDF_JUDGE_VERDICTC1ERKS_ *INTERNAL* " demangled="MDF_JUDGE_VERDICT::MDF_JUDGE_VERDICT(MDF_JUDGE_VERDICT const&amp;)" location="f3:370" file="f3" line="370" endline="370" inline="1">
    <Argument type="_1102" location="f3:366" file="f3" line="366"/>
  </Constructor>
  <Constructor id="_818" name="._36" artificial="1" throw="" context="_275" access="public" mangled="_ZN17MDF_JUDGE_VERDICTC1Ev *INTERNAL* " demangled="MDF_JUDGE_VERDICT::MDF_JUDGE_VERDICT()" location="f3:370" file="f3" line="370" inline="1"/>
  <Field id="_819" name="chosen_channel_mask" type="_1103" offset="0" context="_278" access="public" location="f3:312" file="f3" line="312"/>
  <Destructor id="_820" name="._32" artificial="1" throw="" context="_278" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGD1Ev *INTERNAL* " demangled="MDF_EM_OVERRIDE_CONFIG::~MDF_EM_OVERRIDE_CONFIG()" location="f3:313" file="f3" line="313" endline="313" inline="1">
  </Destructor>
  <OperatorMethod id="_821" name="=" returns="_1104" artificial="1" throw="" context="_278" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGaSERKS_" demangled="MDF_EM_OVERRIDE_CONFIG::operator=(MDF_EM_OVERRIDE_CONFIG const&amp;)" location="f3:313" file="f3" line="313" endline="313" inline="1">
    <Argument type="_1105" location="f3:311" file="f3" line="311"/>
  </OperatorMethod>
  <Constructor id="_822" name="._32" artificial="1" throw="" context="_278" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_EM_OVERRIDE_CONFIG::MDF_EM_OVERRIDE_CONFIG(MDF_EM_OVERRIDE_CONFIG const&amp;)" location="f3:313" file="f3" line="313" endline="313" inline="1">
    <Argument type="_1105" location="f3:311" file="f3" line="311"/>
  </Constructor>
  <Constructor id="_823" name="._32" artificial="1" throw="" context="_278" access="public" mangled="_ZN22MDF_EM_OVERRIDE_CONFIGC1Ev *INTERNAL* " demangled="MDF_EM_OVERRIDE_CONFIG::MDF_EM_OVERRIDE_CONFIG()" location="f3:313" file="f3" line="313" inline="1"/>
  <Field id="_824" name="XorYorZ" type="_387" offset="0" context="_286" access="public" location="f3:572" file="f3" line="572"/>
  <Field id="_825" name="UpOrDown" type="_387" offset="32" context="_286" access="public" location="f3:573" file="f3" line="573"/>
  <Field id="_826" name="forceThreshold" type="_385" offset="64" context="_286" access="public" location="f3:574" file="f3" line="574"/>
  <Field id="_827" name="targetDistance" type="_385" offset="128" context="_286" access="public" location="f3:575" file="f3" line="575"/>
  <Destructor id="_828" name="._68" artificial="1" throw="" context="_286" access="public" mangled="_ZN15MDF_TRIAL_INPUTD1Ev *INTERNAL* " demangled="MDF_TRIAL_INPUT::~MDF_TRIAL_INPUT()" location="f3:576" file="f3" line="576" endline="576" inline="1">
  </Destructor>
  <OperatorMethod id="_829" name="=" returns="_1106" artificial="1" throw="" context="_286" access="public" mangled="_ZN15MDF_TRIAL_INPUTaSERKS_" demangled="MDF_TRIAL_INPUT::operator=(MDF_TRIAL_INPUT const&amp;)" location="f3:576" file="f3" line="576" endline="576" inline="1">
    <Argument type="_1107" location="f3:571" file="f3" line="571"/>
  </OperatorMethod>
  <Constructor id="_830" name="._68" artificial="1" throw="" context="_286" access="public" mangled="_ZN15MDF_TRIAL_INPUTC1ERKS_ *INTERNAL* " demangled="MDF_TRIAL_INPUT::MDF_TRIAL_INPUT(MDF_TRIAL_INPUT const&amp;)" location="f3:576" file="f3" line="576" endline="576" inline="1">
    <Argument type="_1107" location="f3:571" file="f3" line="571"/>
  </Constructor>
  <Constructor id="_831" name="._68" artificial="1" throw="" context="_286" access="public" mangled="_ZN15MDF_TRIAL_INPUTC1Ev *INTERNAL* " demangled="MDF_TRIAL_INPUT::MDF_TRIAL_INPUT()" location="f3:576" file="f3" line="576" inline="1"/>
  <Field id="_832" name="sample_header" type="_134" offset="0" context="_287" access="public" location="f3:301" file="f3" line="301"/>
  <Field id="_833" name="data" type="_1096" offset="128" context="_287" access="public" location="f3:302" file="f3" line="302"/>
  <Destructor id="_834" name="._30" artificial="1" throw="" context="_287" access="public" mangled="_ZN14MDF_GLOVE_DATAD1Ev *INTERNAL* " demangled="MDF_GLOVE_DATA::~MDF_GLOVE_DATA()" location="f3:303" file="f3" line="303" endline="303" inline="1">
  </Destructor>
  <OperatorMethod id="_835" name="=" returns="_1108" artificial="1" throw="" context="_287" access="public" mangled="_ZN14MDF_GLOVE_DATAaSERKS_" demangled="MDF_GLOVE_DATA::operator=(MDF_GLOVE_DATA const&amp;)" location="f3:303" file="f3" line="303" endline="303" inline="1">
    <Argument type="_1109" location="f3:300" file="f3" line="300"/>
  </OperatorMethod>
  <Constructor id="_836" name="._30" artificial="1" throw="" context="_287" access="public" mangled="_ZN14MDF_GLOVE_DATAC1ERKS_ *INTERNAL* " demangled="MDF_GLOVE_DATA::MDF_GLOVE_DATA(MDF_GLOVE_DATA const&amp;)" location="f3:303" file="f3" line="303" endline="303" inline="1">
    <Argument type="_1109" location="f3:300" file="f3" line="300"/>
  </Constructor>
  <Constructor id="_837" name="._30" artificial="1" throw="" context="_287" access="public" mangled="_ZN14MDF_GLOVE_DATAC1Ev *INTERNAL* " demangled="MDF_GLOVE_DATA::MDF_GLOVE_DATA()" location="f3:303" file="f3" line="303" inline="1"/>
  <Field id="_838" name="stop" type="_387" offset="0" context="_290" access="public" location="f3:267" file="f3" line="267"/>
  <Field id="_839" name="group_stimulus" type="_387" offset="32" context="_290" access="public" location="f3:268" file="f3" line="268"/>
  <Field id="_840" name="group_numChans" type="_387" offset="64" context="_290" access="public" location="f3:269" file="f3" line="269"/>
  <Field id="_841" name="group_channel" type="_1110" offset="96" context="_290" access="public" location="f3:270" file="f3" line="270"/>
  <Field id="_842" name="group_pattern" type="_1110" offset="608" context="_290" access="public" location="f3:271" file="f3" line="271"/>
  <Field id="_843" name="manual_stimulus" type="_387" offset="1120" context="_290" access="public" location="f3:273" file="f3" line="273"/>
  <Field id="_844" name="manual_channel" type="_387" offset="1152" context="_290" access="public" location="f3:274" file="f3" line="274"/>
  <Field id="_845" name="manual_pattern" type="_387" offset="1184" context="_290" access="public" location="f3:275" file="f3" line="275"/>
  <Destructor id="_846" name="._26" artificial="1" throw="" context="_290" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHAND1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_CHAN::~MDF_CERESTIM_CONFIG_CHAN()" location="f3:276" file="f3" line="276" endline="276" inline="1">
  </Destructor>
  <OperatorMethod id="_847" name="=" returns="_1111" artificial="1" throw="" context="_290" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHANaSERKS_" demangled="MDF_CERESTIM_CONFIG_CHAN::operator=(MDF_CERESTIM_CONFIG_CHAN const&amp;)" location="f3:276" file="f3" line="276" endline="276" inline="1">
    <Argument type="_1112" location="f3:266" file="f3" line="266"/>
  </OperatorMethod>
  <Constructor id="_848" name="._26" artificial="1" throw="" context="_290" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHANC1ERKS_ *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_CHAN::MDF_CERESTIM_CONFIG_CHAN(MDF_CERESTIM_CONFIG_CHAN const&amp;)" location="f3:276" file="f3" line="276" endline="276" inline="1">
    <Argument type="_1112" location="f3:266" file="f3" line="266"/>
  </Constructor>
  <Constructor id="_849" name="._26" artificial="1" throw="" context="_290" access="public" mangled="_ZN24MDF_CERESTIM_CONFIG_CHANC1Ev *INTERNAL* " demangled="MDF_CERESTIM_CONFIG_CHAN::MDF_CERESTIM_CONFIG_CHAN()" location="f3:276" file="f3" line="276" inline="1"/>
  <Field id="_850" name="j_ang" type="_1113" offset="0" context="_291" access="public" location="f3:279" file="f3" line="279"/>
  <Field id="_851" name="j_vel" type="_1113" offset="1792" context="_291" access="public" location="f3:280" file="f3" line="280"/>
  <Field id="_852" name="j_trq" type="_1113" offset="3584" context="_291" access="public" location="f3:281" file="f3" line="281"/>
  <Destructor id="_853" name="._27" artificial="1" throw="" context="_291" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKD1Ev *INTERNAL* " demangled="MDF_GROBOT_RAW_FEEDBACK::~MDF_GROBOT_RAW_FEEDBACK()" location="f3:282" file="f3" line="282" endline="282" inline="1">
  </Destructor>
  <OperatorMethod id="_854" name="=" returns="_1114" artificial="1" throw="" context="_291" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKaSERKS_" demangled="MDF_GROBOT_RAW_FEEDBACK::operator=(MDF_GROBOT_RAW_FEEDBACK const&amp;)" location="f3:282" file="f3" line="282" endline="282" inline="1">
    <Argument type="_1115" location="f3:278" file="f3" line="278"/>
  </OperatorMethod>
  <Constructor id="_855" name="._27" artificial="1" throw="" context="_291" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_RAW_FEEDBACK::MDF_GROBOT_RAW_FEEDBACK(MDF_GROBOT_RAW_FEEDBACK const&amp;)" location="f3:282" file="f3" line="282" endline="282" inline="1">
    <Argument type="_1115" location="f3:278" file="f3" line="278"/>
  </Constructor>
  <Constructor id="_856" name="._27" artificial="1" throw="" context="_291" access="public" mangled="_ZN23MDF_GROBOT_RAW_FEEDBACKC1Ev *INTERNAL* " demangled="MDF_GROBOT_RAW_FEEDBACK::MDF_GROBOT_RAW_FEEDBACK()" location="f3:282" file="f3" line="282" inline="1"/>
  <Field id="_857" name="sample_response_timestamp" type="_385" offset="0" context="_294" access="public" location="f4:37" file="f4" line="37"/>
  <Field id="_858" name="sample_alignment_timestamp" type="_385" offset="64" context="_294" access="public" location="f4:38" file="f4" line="38"/>
  <Field id="_859" name="sample_response_count" type="_496" offset="128" context="_294" access="public" location="f4:39" file="f4" line="39"/>
  <Field id="_860" name="sample_alignment_count" type="_496" offset="160" context="_294" access="public" location="f4:40" file="f4" line="40"/>
  <Destructor id="_861" name="._16" artificial="1" throw="" context="_294" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSED1Ev *INTERNAL* " demangled="MDF_SAMPLE_RESPONSE::~MDF_SAMPLE_RESPONSE()" location="f4:41" file="f4" line="41" endline="41" inline="1">
  </Destructor>
  <OperatorMethod id="_862" name="=" returns="_1116" artificial="1" throw="" context="_294" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSEaSERKS_" demangled="MDF_SAMPLE_RESPONSE::operator=(MDF_SAMPLE_RESPONSE const&amp;)" location="f4:41" file="f4" line="41" endline="41" inline="1">
    <Argument type="_1117" location="f4:36" file="f4" line="36"/>
  </OperatorMethod>
  <Constructor id="_863" name="._16" artificial="1" throw="" context="_294" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSEC1ERKS_ *INTERNAL* " demangled="MDF_SAMPLE_RESPONSE::MDF_SAMPLE_RESPONSE(MDF_SAMPLE_RESPONSE const&amp;)" location="f4:41" file="f4" line="41" endline="41" inline="1">
    <Argument type="_1117" location="f4:36" file="f4" line="36"/>
  </Constructor>
  <Constructor id="_864" name="._16" artificial="1" throw="" context="_294" access="public" mangled="_ZN19MDF_SAMPLE_RESPONSEC1Ev *INTERNAL* " demangled="MDF_SAMPLE_RESPONSE::MDF_SAMPLE_RESPONSE()" location="f4:41" file="f4" line="41" inline="1"/>
  <Field id="_865" name="module_name" type="_979" offset="0" context="_302" access="public" location="f3:415" file="f3" line="415"/>
  <Destructor id="_866" name="._44" artificial="1" throw="" context="_302" access="public" mangled="_ZN12MDF_PING_ACKD1Ev *INTERNAL* " demangled="MDF_PING_ACK::~MDF_PING_ACK()" location="f3:416" file="f3" line="416" endline="416" inline="1">
  </Destructor>
  <OperatorMethod id="_867" name="=" returns="_1118" artificial="1" throw="" context="_302" access="public" mangled="_ZN12MDF_PING_ACKaSERKS_" demangled="MDF_PING_ACK::operator=(MDF_PING_ACK const&amp;)" location="f3:416" file="f3" line="416" endline="416" inline="1">
    <Argument type="_1119" location="f3:414" file="f3" line="414"/>
  </OperatorMethod>
  <Constructor id="_868" name="._44" artificial="1" throw="" context="_302" access="public" mangled="_ZN12MDF_PING_ACKC1ERKS_ *INTERNAL* " demangled="MDF_PING_ACK::MDF_PING_ACK(MDF_PING_ACK const&amp;)" location="f3:416" file="f3" line="416" endline="416" inline="1">
    <Argument type="_1119" location="f3:414" file="f3" line="414"/>
  </Constructor>
  <Constructor id="_869" name="._44" artificial="1" throw="" context="_302" access="public" mangled="_ZN12MDF_PING_ACKC1Ev *INTERNAL* " demangled="MDF_PING_ACK::MDF_PING_ACK()" location="f3:416" file="f3" line="416" inline="1"/>
  <Field id="_870" name="ind_force" type="_1075" offset="0" context="_303" access="public" location="f3:241" file="f3" line="241"/>
  <Field id="_871" name="mid_force" type="_1075" offset="192" context="_303" access="public" location="f3:242" file="f3" line="242"/>
  <Field id="_872" name="rng_force" type="_1075" offset="384" context="_303" access="public" location="f3:243" file="f3" line="243"/>
  <Field id="_873" name="lit_force" type="_1075" offset="576" context="_303" access="public" location="f3:244" file="f3" line="244"/>
  <Field id="_874" name="thb_force" type="_1075" offset="768" context="_303" access="public" location="f3:245" file="f3" line="245"/>
  <Field id="_875" name="ind_accel" type="_1075" offset="960" context="_303" access="public" location="f3:247" file="f3" line="247"/>
  <Field id="_876" name="mid_accel" type="_1075" offset="1152" context="_303" access="public" location="f3:248" file="f3" line="248"/>
  <Field id="_877" name="rng_accel" type="_1075" offset="1344" context="_303" access="public" location="f3:249" file="f3" line="249"/>
  <Field id="_878" name="lit_accel" type="_1075" offset="1536" context="_303" access="public" location="f3:250" file="f3" line="250"/>
  <Field id="_879" name="thb_accel" type="_1075" offset="1728" context="_303" access="public" location="f3:251" file="f3" line="251"/>
  <Destructor id="_880" name="._24" artificial="1" throw="" context="_303" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSD1Ev *INTERNAL* " demangled="MDF_GROBOT_SEGMENT_PERCEPTS::~MDF_GROBOT_SEGMENT_PERCEPTS()" location="f3:252" file="f3" line="252" endline="252" inline="1">
  </Destructor>
  <OperatorMethod id="_881" name="=" returns="_1120" artificial="1" throw="" context="_303" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSaSERKS_" demangled="MDF_GROBOT_SEGMENT_PERCEPTS::operator=(MDF_GROBOT_SEGMENT_PERCEPTS const&amp;)" location="f3:252" file="f3" line="252" endline="252" inline="1">
    <Argument type="_1121" location="f3:240" file="f3" line="240"/>
  </OperatorMethod>
  <Constructor id="_882" name="._24" artificial="1" throw="" context="_303" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSC1ERKS_ *INTERNAL* " demangled="MDF_GROBOT_SEGMENT_PERCEPTS::MDF_GROBOT_SEGMENT_PERCEPTS(MDF_GROBOT_SEGMENT_PERCEPTS const&amp;)" location="f3:252" file="f3" line="252" endline="252" inline="1">
    <Argument type="_1121" location="f3:240" file="f3" line="240"/>
  </Constructor>
  <Constructor id="_883" name="._24" artificial="1" throw="" context="_303" access="public" mangled="_ZN27MDF_GROBOT_SEGMENT_PERCEPTSC1Ev *INTERNAL* " demangled="MDF_GROBOT_SEGMENT_PERCEPTS::MDF_GROBOT_SEGMENT_PERCEPTS()" location="f3:252" file="f3" line="252" inline="1"/>
  <Field id="_884" name="module_name" type="_979" offset="0" context="_305" access="public" location="f3:411" file="f3" line="411"/>
  <Destructor id="_885" name="._43" artificial="1" throw="" context="_305" access="public" mangled="_ZN8MDF_PINGD1Ev *INTERNAL* " demangled="MDF_PING::~MDF_PING()" location="f3:412" file="f3" line="412" endline="412" inline="1">
  </Destructor>
  <OperatorMethod id="_886" name="=" returns="_1122" artificial="1" throw="" context="_305" access="public" mangled="_ZN8MDF_PINGaSERKS_" demangled="MDF_PING::operator=(MDF_PING const&amp;)" location="f3:412" file="f3" line="412" endline="412" inline="1">
    <Argument type="_1123" location="f3:410" file="f3" line="410"/>
  </OperatorMethod>
  <Constructor id="_887" name="._43" artificial="1" throw="" context="_305" access="public" mangled="_ZN8MDF_PINGC1ERKS_ *INTERNAL* " demangled="MDF_PING::MDF_PING(MDF_PING const&amp;)" location="f3:412" file="f3" line="412" endline="412" inline="1">
    <Argument type="_1123" location="f3:410" file="f3" line="410"/>
  </Constructor>
  <Constructor id="_888" name="._43" artificial="1" throw="" context="_305" access="public" mangled="_ZN8MDF_PINGC1Ev *INTERNAL* " demangled="MDF_PING::MDF_PING()" location="f3:412" file="f3" line="412" inline="1"/>
  <Field id="_889" name="duration" type="_496" offset="0" context="_311" access="public" location="f3:541" file="f3" line="541"/>
  <Field id="_890" name="reserved" type="_496" offset="32" context="_311" access="public" location="f3:542" file="f3" line="542"/>
  <Destructor id="_891" name="._63" artificial="1" throw="" context="_311" access="public" mangled="_ZN14MDF_COMBO_WAITD1Ev *INTERNAL* " demangled="MDF_COMBO_WAIT::~MDF_COMBO_WAIT()" location="f3:543" file="f3" line="543" endline="543" inline="1">
  </Destructor>
  <OperatorMethod id="_892" name="=" returns="_1124" artificial="1" throw="" context="_311" access="public" mangled="_ZN14MDF_COMBO_WAITaSERKS_" demangled="MDF_COMBO_WAIT::operator=(MDF_COMBO_WAIT const&amp;)" location="f3:543" file="f3" line="543" endline="543" inline="1">
    <Argument type="_1125" location="f3:540" file="f3" line="540"/>
  </OperatorMethod>
  <Constructor id="_893" name="._63" artificial="1" throw="" context="_311" access="public" mangled="_ZN14MDF_COMBO_WAITC1ERKS_ *INTERNAL* " demangled="MDF_COMBO_WAIT::MDF_COMBO_WAIT(MDF_COMBO_WAIT const&amp;)" location="f3:543" file="f3" line="543" endline="543" inline="1">
    <Argument type="_1125" location="f3:540" file="f3" line="540"/>
  </Constructor>
  <Constructor id="_894" name="._63" artificial="1" throw="" context="_311" access="public" mangled="_ZN14MDF_COMBO_WAITC1Ev *INTERNAL* " demangled="MDF_COMBO_WAIT::MDF_COMBO_WAIT()" location="f3:543" file="f3" line="543" inline="1"/>
  <Field id="_895" name="channelNum" type="_496" offset="0" context="_313" access="public" location="f3:546" file="f3" line="546"/>
  <Field id="_896" name="reserved" type="_496" offset="32" context="_313" access="public" location="f3:547" file="f3" line="547"/>
  <Field id="_897" name="name" type="_979" offset="64" context="_313" access="public" location="f3:548" file="f3" line="548"/>
  <Destructor id="_898" name="._64" artificial="1" throw="" context="_313" access="public" mangled="_ZN7MDF_FSRD1Ev *INTERNAL* " demangled="MDF_FSR::~MDF_FSR()" location="f3:549" file="f3" line="549" endline="549" inline="1">
  </Destructor>
  <OperatorMethod id="_899" name="=" returns="_1126" artificial="1" throw="" context="_313" access="public" mangled="_ZN7MDF_FSRaSERKS_" demangled="MDF_FSR::operator=(MDF_FSR const&amp;)" location="f3:549" file="f3" line="549" endline="549" inline="1">
    <Argument type="_1127" location="f3:545" file="f3" line="545"/>
  </OperatorMethod>
  <Constructor id="_900" name="._64" artificial="1" throw="" context="_313" access="public" mangled="_ZN7MDF_FSRC1ERKS_ *INTERNAL* " demangled="MDF_FSR::MDF_FSR(MDF_FSR const&amp;)" location="f3:549" file="f3" line="549" endline="549" inline="1">
    <Argument type="_1127" location="f3:545" file="f3" line="545"/>
  </Constructor>
  <Constructor id="_901" name="._64" artificial="1" throw="" context="_313" access="public" mangled="_ZN7MDF_FSRC1Ev *INTERNAL* " demangled="MDF_FSR::MDF_FSR()" location="f3:549" file="f3" line="549" inline="1"/>
  <Field id="_902" name="x" type="_1128" offset="0" context="_315" access="public" location="f3:232" file="f3" line="232"/>
  <Field id="_903" name="y" type="_1128" offset="1280" context="_315" access="public" location="f3:233" file="f3" line="233"/>
  <Field id="_904" name="z" type="_1128" offset="2560" context="_315" access="public" location="f3:234" file="f3" line="234"/>
  <Field id="_905" name="w" type="_1128" offset="3840" context="_315" access="public" location="f3:235" file="f3" line="235"/>
  <Field id="_906" name="Which" type="_387" offset="5120" context="_315" access="public" location="f3:236" file="f3" line="236"/>
  <Field id="_907" name="Reserved" type="_387" offset="5152" context="_315" access="public" location="f3:237" file="f3" line="237"/>
  <Destructor id="_908" name="._23" artificial="1" throw="" context="_315" access="public" mangled="_ZN19MDF_KINECT_SKELETOND1Ev *INTERNAL* " demangled="MDF_KINECT_SKELETON::~MDF_KINECT_SKELETON()" location="f3:238" file="f3" line="238" endline="238" inline="1">
  </Destructor>
  <OperatorMethod id="_909" name="=" returns="_1129" artificial="1" throw="" context="_315" access="public" mangled="_ZN19MDF_KINECT_SKELETONaSERKS_" demangled="MDF_KINECT_SKELETON::operator=(MDF_KINECT_SKELETON const&amp;)" location="f3:238" file="f3" line="238" endline="238" inline="1">
    <Argument type="_1130" location="f3:231" file="f3" line="231"/>
  </OperatorMethod>
  <Constructor id="_910" name="._23" artificial="1" throw="" context="_315" access="public" mangled="_ZN19MDF_KINECT_SKELETONC1ERKS_ *INTERNAL* " demangled="MDF_KINECT_SKELETON::MDF_KINECT_SKELETON(MDF_KINECT_SKELETON const&amp;)" location="f3:238" file="f3" line="238" endline="238" inline="1">
    <Argument type="_1130" location="f3:231" file="f3" line="231"/>
  </Constructor>
  <Constructor id="_911" name="._23" artificial="1" throw="" context="_315" access="public" mangled="_ZN19MDF_KINECT_SKELETONC1Ev *INTERNAL* " demangled="MDF_KINECT_SKELETON::MDF_KINECT_SKELETON()" location="f3:238" file="f3" line="238" inline="1"/>
  <Field id="_912" name="time" type="_385" offset="0" context="_334" access="public" location="f3:431" file="f3" line="431"/>
  <Field id="_913" name="chan" type="_387" offset="64" context="_334" access="public" location="f3:432" file="f3" line="432"/>
  <Field id="_914" name="unit" type="_387" offset="96" context="_334" access="public" location="f3:433" file="f3" line="433"/>
  <Field id="_915" name="box_id" type="_387" offset="128" context="_334" access="public" location="f3:434" file="f3" line="434"/>
  <Field id="_916" name="length" type="_387" offset="160" context="_334" access="public" location="f3:435" file="f3" line="435"/>
  <Field id="_917" name="snippet" type="_1131" offset="192" context="_334" access="public" location="f3:436" file="f3" line="436"/>
  <Destructor id="_918" name="._48" artificial="1" throw="" context="_334" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETD1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_SNIPPET::~MDF_SPM_SPIKE_SNIPPET()" location="f3:437" file="f3" line="437" endline="437" inline="1">
  </Destructor>
  <OperatorMethod id="_919" name="=" returns="_1132" artificial="1" throw="" context="_334" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETaSERKS_" demangled="MDF_SPM_SPIKE_SNIPPET::operator=(MDF_SPM_SPIKE_SNIPPET const&amp;)" location="f3:437" file="f3" line="437" endline="437" inline="1">
    <Argument type="_1133" location="f3:430" file="f3" line="430"/>
  </OperatorMethod>
  <Constructor id="_920" name="._48" artificial="1" throw="" context="_334" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETC1ERKS_ *INTERNAL* " demangled="MDF_SPM_SPIKE_SNIPPET::MDF_SPM_SPIKE_SNIPPET(MDF_SPM_SPIKE_SNIPPET const&amp;)" location="f3:437" file="f3" line="437" endline="437" inline="1">
    <Argument type="_1133" location="f3:430" file="f3" line="430"/>
  </Constructor>
  <Constructor id="_921" name="._48" artificial="1" throw="" context="_334" access="public" mangled="_ZN21MDF_SPM_SPIKE_SNIPPETC1Ev *INTERNAL* " demangled="MDF_SPM_SPIKE_SNIPPET::MDF_SPM_SPIKE_SNIPPET()" location="f3:437" file="f3" line="437" inline="1"/>
  <Field id="_922" name="data_dir" type="_998" offset="0" context="_337" access="public" location="f3:295" file="f3" line="295"/>
  <Destructor id="_923" name="._29" artificial="1" throw="" context="_337" access="public" mangled="_ZN18MDF_SESSION_CONFIGD1Ev *INTERNAL* " demangled="MDF_SESSION_CONFIG::~MDF_SESSION_CONFIG()" location="f3:296" file="f3" line="296" endline="296" inline="1">
  </Destructor>
  <OperatorMethod id="_924" name="=" returns="_1134" artificial="1" throw="" context="_337" access="public" mangled="_ZN18MDF_SESSION_CONFIGaSERKS_" demangled="MDF_SESSION_CONFIG::operator=(MDF_SESSION_CONFIG const&amp;)" location="f3:296" file="f3" line="296" endline="296" inline="1">
    <Argument type="_1135" location="f3:294" file="f3" line="294"/>
  </OperatorMethod>
  <Constructor id="_925" name="._29" artificial="1" throw="" context="_337" access="public" mangled="_ZN18MDF_SESSION_CONFIGC1ERKS_ *INTERNAL* " demangled="MDF_SESSION_CONFIG::MDF_SESSION_CONFIG(MDF_SESSION_CONFIG const&amp;)" location="f3:296" file="f3" line="296" endline="296" inline="1">
    <Argument type="_1135" location="f3:294" file="f3" line="294"/>
  </Constructor>
  <Constructor id="_926" name="._29" artificial="1" throw="" context="_337" access="public" mangled="_ZN18MDF_SESSION_CONFIGC1Ev *INTERNAL* " demangled="MDF_SESSION_CONFIG::MDF_SESSION_CONFIG()" location="f3:296" file="f3" line="296" inline="1"/>
  <Field id="_927" name="Cmd" type="_1083" offset="0" context="_340" access="public" location="f3:228" file="f3" line="228"/>
  <Destructor id="_928" name="._22" artificial="1" throw="" context="_340" access="public" mangled="_ZN15MDF_KIN_POS_CMDD1Ev *INTERNAL* " demangled="MDF_KIN_POS_CMD::~MDF_KIN_POS_CMD()" location="f3:229" file="f3" line="229" endline="229" inline="1">
  </Destructor>
  <OperatorMethod id="_929" name="=" returns="_1136" artificial="1" throw="" context="_340" access="public" mangled="_ZN15MDF_KIN_POS_CMDaSERKS_" demangled="MDF_KIN_POS_CMD::operator=(MDF_KIN_POS_CMD const&amp;)" location="f3:229" file="f3" line="229" endline="229" inline="1">
    <Argument type="_1137" location="f3:227" file="f3" line="227"/>
  </OperatorMethod>
  <Constructor id="_930" name="._22" artificial="1" throw="" context="_340" access="public" mangled="_ZN15MDF_KIN_POS_CMDC1ERKS_ *INTERNAL* " demangled="MDF_KIN_POS_CMD::MDF_KIN_POS_CMD(MDF_KIN_POS_CMD const&amp;)" location="f3:229" file="f3" line="229" endline="229" inline="1">
    <Argument type="_1137" location="f3:227" file="f3" line="227"/>
  </Constructor>
  <Constructor id="_931" name="._22" artificial="1" throw="" context="_340" access="public" mangled="_ZN15MDF_KIN_POS_CMDC1Ev *INTERNAL* " demangled="MDF_KIN_POS_CMD::MDF_KIN_POS_CMD()" location="f3:229" file="f3" line="229" inline="1"/>
  <Field id="_932" name="load_calibration" type="_387" offset="0" context="_343" access="public" location="f3:403" file="f3" line="403"/>
  <Field id="_933" name="calib_session_id" type="_387" offset="32" context="_343" access="public" location="f3:404" file="f3" line="404"/>
  <Field id="_934" name="num_reps" type="_387" offset="64" context="_343" access="public" location="f3:405" file="f3" line="405"/>
  <Field id="_935" name="reserved" type="_387" offset="96" context="_343" access="public" location="f3:406" file="f3" line="406"/>
  <Field id="_936" name="subject_name" type="_979" offset="128" context="_343" access="public" location="f3:407" file="f3" line="407"/>
  <Destructor id="_937" name="._42" artificial="1" throw="" context="_343" access="public" mangled="_ZN20MDF_XM_START_SESSIOND1Ev *INTERNAL* " demangled="MDF_XM_START_SESSION::~MDF_XM_START_SESSION()" location="f3:408" file="f3" line="408" endline="408" inline="1">
  </Destructor>
  <OperatorMethod id="_938" name="=" returns="_1138" artificial="1" throw="" context="_343" access="public" mangled="_ZN20MDF_XM_START_SESSIONaSERKS_" demangled="MDF_XM_START_SESSION::operator=(MDF_XM_START_SESSION const&amp;)" location="f3:408" file="f3" line="408" endline="408" inline="1">
    <Argument type="_1139" location="f3:402" file="f3" line="402"/>
  </OperatorMethod>
  <Constructor id="_939" name="._42" artificial="1" throw="" context="_343" access="public" mangled="_ZN20MDF_XM_START_SESSIONC1ERKS_ *INTERNAL* " demangled="MDF_XM_START_SESSION::MDF_XM_START_SESSION(MDF_XM_START_SESSION const&amp;)" location="f3:408" file="f3" line="408" endline="408" inline="1">
    <Argument type="_1139" location="f3:402" file="f3" line="402"/>
  </Constructor>
  <Constructor id="_940" name="._42" artificial="1" throw="" context="_343" access="public" mangled="_ZN20MDF_XM_START_SESSIONC1Ev *INTERNAL* " demangled="MDF_XM_START_SESSION::MDF_XM_START_SESSION()" location="f3:408" file="f3" line="408" inline="1"/>
  <Field id="_941" name="sample_header" type="_134" offset="0" context="_346" access="public" location="f3:475" file="f3" line="475"/>
  <Field id="_942" name="score" type="_385" offset="128" context="_346" access="public" location="f3:476" file="f3" line="476"/>
  <Field id="_943" name="gain" type="_385" offset="192" context="_346" access="public" location="f3:477" file="f3" line="477"/>
  <Field id="_944" name="idle" type="_387" offset="256" context="_346" access="public" location="f3:478" file="f3" line="478"/>
  <Field id="_945" name="reserved" type="_387" offset="288" context="_346" access="public" location="f3:479" file="f3" line="479"/>
  <Destructor id="_946" name="._54" artificial="1" throw="" context="_346" access="public" mangled="_ZN8MDF_IDLED1Ev *INTERNAL* " demangled="MDF_IDLE::~MDF_IDLE()" location="f3:480" file="f3" line="480" endline="480" inline="1">
  </Destructor>
  <OperatorMethod id="_947" name="=" returns="_1140" artificial="1" throw="" context="_346" access="public" mangled="_ZN8MDF_IDLEaSERKS_" demangled="MDF_IDLE::operator=(MDF_IDLE const&amp;)" location="f3:480" file="f3" line="480" endline="480" inline="1">
    <Argument type="_1141" location="f3:474" file="f3" line="474"/>
  </OperatorMethod>
  <Constructor id="_948" name="._54" artificial="1" throw="" context="_346" access="public" mangled="_ZN8MDF_IDLEC1ERKS_ *INTERNAL* " demangled="MDF_IDLE::MDF_IDLE(MDF_IDLE const&amp;)" location="f3:480" file="f3" line="480" endline="480" inline="1">
    <Argument type="_1141" location="f3:474" file="f3" line="474"/>
  </Constructor>
  <Constructor id="_949" name="._54" artificial="1" throw="" context="_346" access="public" mangled="_ZN8MDF_IDLEC1Ev *INTERNAL* " demangled="MDF_IDLE::MDF_IDLE()" location="f3:480" file="f3" line="480" inline="1"/>
  <Field id="_950" name="dof_vals" type="_1001" offset="0" context="_347" access="public" location="f3:500" file="f3" line="500"/>
  <Field id="_951" name="tag" type="_979" offset="1344" context="_347" access="public" location="f3:501" file="f3" line="501"/>
  <Destructor id="_952" name="._57" artificial="1" throw="" context="_347" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAD1Ev *INTERNAL* " demangled="MDF_OUTPUT_DOF_DATA::~MDF_OUTPUT_DOF_DATA()" location="f3:502" file="f3" line="502" endline="502" inline="1">
  </Destructor>
  <OperatorMethod id="_953" name="=" returns="_1142" artificial="1" throw="" context="_347" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAaSERKS_" demangled="MDF_OUTPUT_DOF_DATA::operator=(MDF_OUTPUT_DOF_DATA const&amp;)" location="f3:502" file="f3" line="502" endline="502" inline="1">
    <Argument type="_1143" location="f3:499" file="f3" line="499"/>
  </OperatorMethod>
  <Constructor id="_954" name="._57" artificial="1" throw="" context="_347" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAC1ERKS_ *INTERNAL* " demangled="MDF_OUTPUT_DOF_DATA::MDF_OUTPUT_DOF_DATA(MDF_OUTPUT_DOF_DATA const&amp;)" location="f3:502" file="f3" line="502" endline="502" inline="1">
    <Argument type="_1143" location="f3:499" file="f3" line="499"/>
  </Constructor>
  <Constructor id="_955" name="._57" artificial="1" throw="" context="_347" access="public" mangled="_ZN19MDF_OUTPUT_DOF_DATAC1Ev *INTERNAL* " demangled="MDF_OUTPUT_DOF_DATA::MDF_OUTPUT_DOF_DATA()" location="f3:502" file="f3" line="502" inline="1"/>
  <Field id="_956" name="sample_header" type="_134" offset="0" context="_348" access="public" location="f3:520" file="f3" line="520"/>
  <Field id="_957" name="rdt_sequence" type="_496" offset="128" context="_348" access="public" location="f3:521" file="f3" line="521"/>
  <Field id="_958" name="ft_sequence" type="_496" offset="160" context="_348" access="public" location="f3:522" file="f3" line="522"/>
  <Field id="_959" name="status" type="_496" offset="192" context="_348" access="public" location="f3:523" file="f3" line="523"/>
  <Field id="_960" name="reserved" type="_496" offset="224" context="_348" access="public" location="f3:524" file="f3" line="524"/>
  <Field id="_961" name="data" type="_1039" offset="256" context="_348" access="public" location="f3:525" file="f3" line="525"/>
  <Field id="_962" name="offset" type="_1039" offset="640" context="_348" access="public" location="f3:526" file="f3" line="526"/>
  <Destructor id="_963" name="._60" artificial="1" throw="" context="_348" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAD1Ev *INTERNAL* " demangled="MDF_FORCE_SENSOR_DATA::~MDF_FORCE_SENSOR_DATA()" location="f3:527" file="f3" line="527" endline="527" inline="1">
  </Destructor>
  <OperatorMethod id="_964" name="=" returns="_1144" artificial="1" throw="" context="_348" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAaSERKS_" demangled="MDF_FORCE_SENSOR_DATA::operator=(MDF_FORCE_SENSOR_DATA const&amp;)" location="f3:527" file="f3" line="527" endline="527" inline="1">
    <Argument type="_1145" location="f3:519" file="f3" line="519"/>
  </OperatorMethod>
  <Constructor id="_965" name="._60" artificial="1" throw="" context="_348" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAC1ERKS_ *INTERNAL* " demangled="MDF_FORCE_SENSOR_DATA::MDF_FORCE_SENSOR_DATA(MDF_FORCE_SENSOR_DATA const&amp;)" location="f3:527" file="f3" line="527" endline="527" inline="1">
    <Argument type="_1145" location="f3:519" file="f3" line="519"/>
  </Constructor>
  <Constructor id="_966" name="._60" artificial="1" throw="" context="_348" access="public" mangled="_ZN21MDF_FORCE_SENSOR_DATAC1Ev *INTERNAL* " demangled="MDF_FORCE_SENSOR_DATA::MDF_FORCE_SENSOR_DATA()" location="f3:527" file="f3" line="527" inline="1"/>
  <Field id="_967" name="id" type="_387" offset="0" context="_353" access="public" location="f3:373" file="f3" line="373"/>
  <Field id="_968" name="outcome" type="_387" offset="32" context="_353" access="public" location="f3:374" file="f3" line="374"/>
  <Field id="_969" name="reason" type="_979" offset="64" context="_353" access="public" location="f3:375" file="f3" line="375"/>
  <Destructor id="_970" name="._37" artificial="1" throw="" context="_353" access="public" mangled="_ZN18MDF_END_TASK_STATED1Ev *INTERNAL* " demangled="MDF_END_TASK_STATE::~MDF_END_TASK_STATE()" location="f3:376" file="f3" line="376" endline="376" inline="1">
  </Destructor>
  <OperatorMethod id="_971" name="=" returns="_1146" artificial="1" throw="" context="_353" access="public" mangled="_ZN18MDF_END_TASK_STATEaSERKS_" demangled="MDF_END_TASK_STATE::operator=(MDF_END_TASK_STATE const&amp;)" location="f3:376" file="f3" line="376" endline="376" inline="1">
    <Argument type="_1147" location="f3:372" file="f3" line="372"/>
  </OperatorMethod>
  <Constructor id="_972" name="._37" artificial="1" throw="" context="_353" access="public" mangled="_ZN18MDF_END_TASK_STATEC1ERKS_ *INTERNAL* " demangled="MDF_END_TASK_STATE::MDF_END_TASK_STATE(MDF_END_TASK_STATE const&amp;)" location="f3:376" file="f3" line="376" endline="376" inline="1">
    <Argument type="_1147" location="f3:372" file="f3" line="372"/>
  </Constructor>
  <Constructor id="_973" name="._37" artificial="1" throw="" context="_353" access="public" mangled="_ZN18MDF_END_TASK_STATEC1Ev *INTERNAL* " demangled="MDF_END_TASK_STATE::MDF_END_TASK_STATE()" location="f3:376" file="f3" line="376" inline="1"/>
  <CvQualifiedType id="_385c" type="_385" const="1"/>
  <ArrayType id="_977" min="0" max="17u" type="_385" size="1152" align="64"/>
  <ArrayType id="_978" min="0" max="17u" type="_387" size="576" align="32"/>
  <ArrayType id="_979" min="0" max="63u" type="_975" size="512" align="8"/>
  <ReferenceType id="_980" type="_13" size="64" align="64"/>
  <ReferenceType id="_981" type="_13c" size="64" align="64"/>
  <ReferenceType id="_982" type="_22" size="64" align="64"/>
  <ReferenceType id="_983" type="_22c" size="64" align="64"/>
  <ArrayType id="_984" min="0" max="8u" type="_385" size="576" align="64"/>
  <ReferenceType id="_985" type="_45" size="64" align="64"/>
  <ReferenceType id="_986" type="_45c" size="64" align="64"/>
  <ArrayType id="_987" min="0" max="255u" type="_385" size="16384" align="64"/>
  <ArrayType id="_988" min="0" max="255u" type="_1151" size="4096" align="16"/>
  <ArrayType id="_989" min="0" max="255u" type="_975" size="2048" align="8"/>
  <ReferenceType id="_990" type="_58" size="64" align="64"/>
  <ReferenceType id="_991" type="_58c" size="64" align="64"/>
  <ReferenceType id="_992" type="_60" size="64" align="64"/>
  <ReferenceType id="_993" type="_60c" size="64" align="64"/>
  <ReferenceType id="_994" type="_67" size="64" align="64"/>
  <ReferenceType id="_995" type="_67c" size="64" align="64"/>
  <ReferenceType id="_996" type="_73" size="64" align="64"/>
  <ReferenceType id="_997" type="_73c" size="64" align="64"/>
  <ArrayType id="_998" min="0" max="127u" type="_975" size="1024" align="8"/>
  <ReferenceType id="_999" type="_81" size="64" align="64"/>
  <ReferenceType id="_1000" type="_81c" size="64" align="64"/>
  <ArrayType id="_1001" min="0" max="20u" type="_385" size="1344" align="64"/>
  <ReferenceType id="_1002" type="_89" size="64" align="64"/>
  <ReferenceType id="_1003" type="_89c" size="64" align="64"/>
  <ReferenceType id="_1004" type="_91" size="64" align="64"/>
  <ReferenceType id="_1005" type="_91c" size="64" align="64"/>
  <ArrayType id="_1006" min="0" max="575u" type="_363" size="4608" align="8"/>
  <ReferenceType id="_1007" type="_94" size="64" align="64"/>
  <ReferenceType id="_1008" type="_94c" size="64" align="64"/>
  <ReferenceType id="_1009" type="_95" size="64" align="64"/>
  <ReferenceType id="_1010" type="_95c" size="64" align="64"/>
  <ArrayType id="_1011" min="0" max="31u" type="_385" size="2048" align="64"/>
  <ReferenceType id="_1012" type="_97" size="64" align="64"/>
  <ReferenceType id="_1013" type="_97c" size="64" align="64"/>
  <ReferenceType id="_1014" type="_104" size="64" align="64"/>
